[{
  "_id": {
    "$oid": "6706be0d30f32534925c8c28"
  },
  "category": "herders",
  "dogInfo": [
    {
      "name": "Australian Cattle",
      "images": "dogs-195/54-australian-cattle-dog.jpg",
      "origin": "The Australian Cattle Dog is a breed of dog that originated in Australia during the 1800's. It was developed from several breeds of farm dogs, including Collies and Kelpies. Farmers and Ranchers use Australian Cattle Dogs to herd their cattle. The Australian Cattle Dog has been known by several other names, including the Australian Heeler, the Queensland Heeler, Queensland Blue Heeler, and The Blue Heeler.",
      "heightAtShoulder": {
        "males": "17-20",
        "females": "15-18 in."
      },
      "weight": {
        "males": "35-45",
        "females": "30-40 lbs."
      },
      "grooming": "They have short thick coats and bushy tails, there is not much shedding as one might think. But regular, brushing is good once or twice a week.",
      "cost": "Expensive",
      "capabilities": "Australian Cattle Dog will herd sheep, cattle, and children. They are good watchdogs and affectionate pets.",
      "trainingTip": "These are responsive, easily trained dogs.",
      "housebreaking": "There are no particular problems.",
      "aestheticQuality": "Short, thick coats, with bushy tails.",
      "personality": "Australian Cattle are splinded with all children but they do tend to think they are in charge. A medium to large apartment makes city life a reasonable choice since exercise is important to this dog both indoors and outdoors."
    },
    {
      "name": "Australian Shepherd",
      "images": "dogs-195/12-australian-shepherd.jpg",
      "origin": "The Australian Shepherd is a medium sized dog originally bred for herding livestock. The breed was developed in the United States. The Australian Shepherds are often called 'Aussie's'. It got its name because many sheepherders who came from Australia in the late 1800's used simular dogs to herd their flocks.",
      "heightAtShoulder": {
        "males": "18-23",
        "females": "16-21 in."
      },
      "weight": {
        "males": "45-65",
        "females": "35-55 lbs."
      },
      "grooming": "It has a straight wavy coat that needs good brushings regularly and there is some shedding.",
      "cost": "Moderate",
      "capabilities": "Aussies are intelligent, and protective instincts make the Australian Shepherd an excellent watchdog and pet. In addition, many Australian Shepherds can be trained to guard.",
      "trainingTip": "This is a sensitive breed and as such does very poorly when punished or treated harshly, there is no need for it. Train them easily and gently to maintain their sweet temperaments.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "The Australian Shepherd has very strong hearding instincts.",
      "personality": "Australian Shepherds are splinded with all children but they do tend to think they are in charge. A medium to large apartment makes city life a reasonable choice since exercise is important to this dog both indoors and outdoors."
    },
    {
      "name": "Bearded Collie",
      "images": "dogs-195/125-bearded-collie.jpg",
      "origin": "These herding dogs from Southern Scotland were painted by Gainsborough in 1771 in a portrait of the Duke of Buccleuch. Their ancestry seems to herken back to the Magyar Komondor of Central Europe. The Bearded Collie offers Americans an opportunity to own a very new old breed. The Beardie was not a breed in America until the 1960s.",
      "heightAtShoulder": {
        "males": "21-22",
        "females": "20-21 in."
      },
      "weight": {
        "males": "45-55",
        "females": "40-50 lbs."
      },
      "grooming": "Considering this breed's double coat (harder outer coat and downy undercoat), there is not as much shedding as much as one might think. But regular, thorough brushing is required.",
      "cost": "Expensive",
      "capabilities": "Beardies will herd sheep, cattle, and children. They are good watchdogs but not guard dogs.",
      "trainingTip": "These are responsive, easily trained dogs.",
      "housebreaking": "There are no particular problems.",
      "aestheticQuality": "Fluffy, medium-sized Sheepdog.",
      "personality": "Beardies are splinded with all children but they do tend to think they are in charge. A medium to large apartment makes city life a reasonable choice since exercise is important to this dog both indoors and outdoors."
    },
    {
      "name": "Belgian Malinois(MAL-uh-NWAH)",
      "images": "dogs-195/37-belgian-malinois.jpg",
      "origin": "The Belgian Malinois is a breed of dog closely related to the Belgian Sheepdog. It is named for the town of Molines or Mechelen, Belgium, where it originated in the late 1800's.",
      "heightAtShoulder": {
        "males": "23-25",
        "females": "22-23 in."
      },
      "weight": {
        "males": "50-55",
        "females": "45-50 lbs."
      },
      "grooming": "The Belgian Malinois has a short-haired coat with longer hair along the back of the hind legs. Occasional brushing a couple times a week will be good.",
      "cost": "Expensive",
      "capabilities": "The Belgian Malinois intelligent, and protective instincts make it an excellent watchdog, companion, and pet. In addition, Belgian Malinois can be trained to guard, they are mostly used for Police work.",
      "trainingTip": "These are responsive, easily trained dogs.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "A devoted and loyal dog.",
      "personality": "Belgian Malinois is an exuberant dog who loves and needs to run. He is probably best for older children because he is so energetic. Apartment living is possible if the apartment is large enough and the outdoor exercise is daily. Belgian Malinois are happiest when they are with their own families or working."
    },
    {
      "name": "Belgian Sheepdog",
      "images": "dogs-195/117-belgian-sheepdog.jpg",
      "origin": "The Belgian Sheepdog is a breed of dog developed in Belgium in the late 1800's to herd sheep. Except in the United States, the dog is known as the Groenendal, named for a town in Belgium.",
      "heightAtShoulder": {
        "males": "25-27",
        "females": "23-25 in."
      },
      "weight": {
        "males": "55-60",
        "females": "50-55 lbs."
      },
      "grooming": "The Belgian Sheepdog has long black hair that does shed, and he needs regular brushings every week and maybe a trip to a groomer for a trim once or twice a year.",
      "cost": "Expensive",
      "capabilities": "Belgian Sheepdog are very devoted, and protective companions. In addition, many Belgian Sheepdog can be trained to guard.",
      "trainingTip": "They are very intelligent and learn easily.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Known for their Intelligence, agility, and herding intinct.",
      "personality": "Belgian Sheepdog is an exuberant dog who loves and needs to run. He is probably best for older children because he is so energetic. Apartment living is possible if the apartment is large enough and the outdoor exercise is daily. Belgian Sheepdog are happiest when they are with their families."
    },
    {
      "name": "Belgian Tervuren(TUR-vurn)",
      "images": "dogs-195/106-belgian-tervuren.jpg",
      "origin": "Belgian Turvurens is a breed of dog closely related to the Belgian Sheepdog. It is named after the town of Tervuren, Belgium, where the breed originated about 1880.",
      "heightAtShoulder": {
        "males": "25",
        "females": "24 in."
      },
      "weight": {
        "males": "55",
        "females": "50 lbs."
      },
      "grooming": "The Belgian Turvuren has a rich mahogany coat with black over lays on its face, ears, shoulders, and tail.",
      "cost": "Very Expensive",
      "capabilities": "Belgian Sheepdog are very devoted, and protective companions. In addition, many Belgian Turvuren can be trained to guard.",
      "trainingTip": "They are very intelligent and learn easily.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "They make affectionate companions.",
      "personality": "Belgian Turvuren is a very affectionate companion dog who loves and needs to run. He is probably best for older children because he is so energetic. Apartment living is possible if the apartment is large enough and the outdoor exercise is daily. Belgian Turvuren are happiest when they are with their families."
    },
    {
      "name": "Berger Picard",
      "images": "dogs-195/151-berger-picard.jpg",
      "origin": "The Berger Picard or Picardy Shepherd, is a French herding dog originating in Picardy. These dogs nearly became extinct after both World War I and World War II and remain a rare breed.",
      "heightAtShoulder": {
        "males": "24-26",
        "females": "22-24 in."
      },
      "weight": {
        "males": "51-71",
        "females": "51-71 lbs."
      },
      "Grooming": "The Berger Picard needs lots of brushing and could use professional grooming some times.",
      "cost": "Very Expensive to acquire.",
      "Capabilities": "Canaan Dogs are natural pets and love their families. The Berger Picard make good guarddogs and watchdogs.",
      "Training Tip": "They are very bright and learn easily.",
      "Housebreaking": "There should be no problems.",
      "Aesthetic quality": "Their mellow attitude.",
      "Personality": "These are affectionate, intelligent, loyal dogs who take their family responsibilities seriously. If given enough outdoor exercise they are not to active inside and adjust to apartment living well."
    },
    {
      "name": "Border Collie",
      "images": "dogs-195/32-border-collie.jpg",
      "origin": "The Border Collie is a breed of dog commonly used to herd sheep. The dog originated near the border between England and Scotland in the 1700's. Border Collies are smart, athletic dogs.",
      "heightAtShoulder": {
        "males": "18-22",
        "females": "15-20 in."
      },
      "weight": {
        "males": "30-50",
        "females": "25-45 lbs."
      },
      "grooming": "The Border Collie does shed so they need to be brushed out and they could use some grooming occasionally.",
      "cost": "Expensive",
      "capabilities": "Herding, protective instincts make the Border Collie an excellent watchdog. In addition, many Border Collies can be trained to guard. But the Border Collie is best with kids and loves to play.",
      "trainingTip": "They are very intelligent and learn easily.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Known for their Intelligence, agility, and herding intinct.",
      "personality": "These are affectionate, intelligent, loyal dogs who take their family responsibilities seriously. Young children and toddlers must seem like spring lambs to them, needing a lot of care. If given enough outdoor exercise they are not to active inside and adjust to apartment living well. Be sure to get a well-bred puppy for children."
    },
    {
      "name": "Bouvier des Flandres",
      "images": "dogs-195/94-bouvier-des-flandres.jpg",
      "origin": "The Bouvier served as a cattle drover for the farmers and butchers of Northern France in the late nineteenth century. Many were lost when Northern France was captured in World War I, but some survived working in the French military.",
      "heightAtShoulder": {
        "males": "24-28",
        "females": "24-27 in."
      },
      "weight": {
        "males": "85-100",
        "females": "75-90 lbs."
      },
      "grooming": "Like all these herding dogs, the Bouvier has a longer, harder outer coat over a shorter, downy undercoat. Shedding continues all year round but is heaviest in the late spring and early fall when the coat adjusts to the new season. The Bouvier will need regular, thorough brushing plus visits to a professional groomer for trimming.",
      "cost": "Expensive, to acquire and feed.",
      "capabilities": "Bouviers are wonderful, effective guard dogs and watch dogs as well as drovers.",
      "trainingTip": "Luckily this breed trains well, because they are large, powerful dogs that must not go untrained. They are very bright and willing to please, so all Bouviers should be well behaved.",
      "housebreaking": "No problem.",
      "aestheticQuality": "Large, woolly, dominant animal.",
      "personality": "This large, exuberant dog loves and needs to run. He is probably best for older children because he is so energetic; however, he settles down once he is inside. Apartment living is possible if the apartment is large enough and the outdoor exercise is daily. Bouviers are happiest when they are with their own families, especially the children."
    },
    {
      "name": "Briard(bree AHRD)",
      "images": "dogs-195/150-briard.jpg",
      "origin": "The Briard is a dog that was first bred in France, probably in the 800's. Briards were used to herd sheep. They also have carried supplies and served as guides and sentries in wars.",
      "heightAtShoulder": {
        "males": "27-41",
        "females": "25-39 in."
      },
      "weight": {
        "males": "60-90",
        "females": "55-85 lbs."
      },
      "grooming": "They have black, tawny(tan), or gray coats of long, wavy hair. They need weekly brushings and they do shed mostly all year round. They need to be professionally groomed a few times a year.",
      "cost": "Expensive",
      "capabilities": "These dogs are very good watchdogs and will make an excelent guard dog. They are very protective of their family and companions.",
      "trainingTip": "These are responsive, easily trained dogs.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Graceful, warm, dignified beauty.",
      "personality": "These are affectionate, intelligent, loyal dogs who take their family responsibilities seriously. If given enough outdoor exercise they are not to active inside and adjust to apartment living well. Be sure to get a well-bred puppy for children."
    },
    {
      "name": "Canaan Dog",
      "images": "dogs-195/184-canaan-dog.jpg",
      "origin": "The Canaan Dog is a native dog of Israel. It is descended from the Pariah Dog, which lives throughout the Middle East and North Africa. The Canaan Dog has a triangular, wedge-shaped head with pointed ears. Its athletic body includes a level back and a well tucked-up belly.",
      "heightAtShoulder": {
        "males": "20-24",
        "females": "19-23 in."
      },
      "weight": {
        "males": "45-55",
        "females": "35-45 lbs."
      },
      "Grooming": "The color of the coat ranges from sandy to reddish brown or black and can include white markings. They need weekly brushings and they do shed mostly all year round. They need to be professionally groomed a few times a year.",
      "cost": "Very Expensive",
      "Capabilities": "Canaan Dogs are natural pets and love their families.",
      "Training Tip": "They are very bright and learn easily.",
      "Housebreaking": "There should be no problems.",
      "Aesthetic quality": "Canaan Dogs are known for their intelligence.",
      "Personality": "These are affectionate, intelligent, loyal dogs who take their family responsibilities seriously. If given enough outdoor exercise they are not to active inside and adjust to apartment living well. Be sure to get a well-bred puppy for children."
    },
    {
      "name": "Cardigan Welsh Corgi(KAWR gee)",
      "images": "dogs-195/66-cardigan-welsh-corgi.jpg",
      "origin": "The Cardigan Welsh Corgi is a small, strong breed of dog that was first raised in Cardiganshire, Wales. Since about A. D. 1000, Cardigans have been used to herd cattle, nipping at the feet of the cattle to drive them. Cardigan Welsh Corgi resembles the Pembroke Welsh Corgi. However, the Cardigan has a slightly longer body, bigger ears, a coarser coat, and a long foxlike tail. The word Corgi comes from two Welsh words meaning Dwarf Dog.",
      "heightAtShoulder": {
        "males": "12",
        "females": "12 in."
      },
      "weight": {
        "males": "26-34",
        "females": "24-32 lbs."
      },
      "grooming": "Their short, rough coat and downy undercoat shed all year long, especially in the late spring and early fall. Regular brushing is helpful.",
      "cost": "Moderate",
      "capabilities": "Corgis are natural guard dogs and watchdogs.",
      "trainingTip": "They are very bright and learn easily.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Foxlike in appearance, with large ears, and a long furry tail.",
      "personality": "The Cardigan probably does not relate to children as easily as the Pembroke does, because the Pembroke is a bit more outgoing than the Cardigan, although they both like children. Older children usually get along with this breed better because their dominance is more acceptable to these decision-making cattle-dogs. These dogs are very active indoors but because of their short legs they do not require too much outdoor exercise. Apartments, houses or acres of countryside are all fine."
    },
    {
      "name": "Rough Collie",
      "images": "dogs-195/40-rough-collie.jpg",
      "origin": "Collie comes from the English word colly, meaning black. The original collies before the nineteenth century were either black or black and white. The famous sable and white coloring was developed around 1870, along with the tricolor and the blue merle (blue-gray and black marbled). Both the well-known rough-coated collie and the less famous smooth-coated come in sable and white, tricolor, blue-merle or white (which also has some sable, tricolor, or blue-merle markings). Because of Lassie everyone knows that Collies are sheep herders from the Scottish Highlands.",
      "heightAtShoulder": {
        "males": "24-26",
        "females": "22-24 in."
      },
      "weight": {
        "males": "60-75",
        "females": "40-65 lbs."
      },
      "grooming": "Both the Smooth- and the Rough-coated Collies have double coats. The outer coat on the rough varity is long and stands out from the body to give that typical 'Lassie' look. The outer coat on the Smooth variety is short and lies flat to the body. Both varieties have a short, dense undercoat. Both varieties shed, especially in the late spring and early fall when the coat adjusts to the new season. Regular brushing is essential. but Collies do not need much clipping or trimming so a professional groomer is not necessary unless the rough coat has been neglected for a period of time.",
      "cost": "Expensive",
      "capabilities": "Herding, protective instincts make the Collie an excellent watchdog. In addition, many Collies can be trained to guard.",
      "trainingTip": "All Collies should be very bright and responsive and easily trained. Begin early to avoid a stubborness that can develop in an untrained dog. Avoid punishing a Collie: they are sensitive and respond poorly to punishment. Hitting them can make them aggressive.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Graceful, warm, dignified beauty.",
      "personality": "These are affectionate, intelligent, loyal dogs who take their family responsibilities seriously. Young children and toddlers must seem like spring lambs to them, needing a lot of care. If given enough outdoor exercise they are not to active inside and adjust to apartment living well. Be sure to get a well-bred puppy for children."
    },
    {
      "name": "Smooth Collie",
      "images": "dogs-195/40-smooth-collie.jpg",
      "origin": "Collie comes from the English word colly, meaning black. The original Collies before the nineteenth century were either black or black and white. The famous sable and white coloring was developed around 1870, along with the tricolor and the blue merle (blue-gray and black marbled). Both the less famous smooth-coated and the well-known rough-coated Collie come in sable and white, tricolor, blue-merle or white (which also has some sable, tricolor, or blue-merle markings). Because of Lassie everyone knows that Collies are sheep herders from the Scottish Highlands.",
      "heightAtShoulder": {
        "males": "24-26",
        "females": "22-24 in."
      },
      "weight": {
        "males": "60-75",
        "females": "40-65 lbs."
      },
      "grooming": "Both the Smooth- and the Rough-coated Collies have double coats. The outer coat on the Smooth variety is short and lies flat to the body. The outer coat on the rough varity is long and stands out from the body to give that typical 'Lassie' look. Both varieties have a short, dense undercoat. Both varieties shed, especially in the late spring and early fall when the coat adjusts to the new season. Regular brushing is essential. but Collies do not need much clipping or trimming so a professional groomer is not necessary unless the rough coat has been neglected for a period of time.",
      "cost": "Expensive",
      "capabilities": "Herding, protective instincts make the Collie an excellent watchdog. In addition, many Collies can be trained to guard.",
      "trainingTip": "All Collies should be very bright and responsive and easily trained. Begin early to avoid a stubborness that can develop in an untrained dog. Avoid punishing a Collie: they are sensitive and respond poorly to punishment. Hitting them can make them aggressive.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Graceful, warm, dignified beauty.",
      "personality": "These are affectionate, intelligent, loyal dogs who take their family responsibilities seriously. Young children and toddlers must seem like spring lambs to them, needing a lot of care. If given enough outdoor exercise they are not to active inside and adjust to apartment living well. Be sure to get a well-bred puppy for children."
    },
    {
      "name": "German Shepherd",
      "images": "dogs-195/3-german-shepherd.jpg",
      "origin": "At the end of the nineteenth century a number of different German herding dogs were bred together for their intelligence and herding ability. Conformation was considered only as it affected the dog's performance in work. The result was the German Shepherd dog. Also known as the Anatolian Shepherd(al SAY shuhn), which is a term used in the United Kingdom and Commonwealth Countries for a German Shepherd Dog. It lives to serve its human master. The German shepherd can be taught any number of tasks and is famous for service to blind persons, the police and the military. Nearly forgotten is its talent as a herder.",
      "heightAtShoulder": {
        "males": "24-26",
        "females": "22-24 in."
      },
      "weight": {
        "males": "75-85",
        "females": "60-70 lbs."
      },
      "grooming": "The Shepherd has the herding dog's hard outer coat and downy undercoat that sheds all year round, but particularly in the late spring and early fall. They need a lot of brushing but no professional care.",
      "cost": "Expensive",
      "capabilities": "This breed's abilities are its reason for being. They are superior guard dogs and watchdogs and wonderful, devoted companions. They even have good noses and are often trained to detect hidden bombs or narcotics.",
      "trainingTip": "The German Shepherd Dog is eminently trainable. The dog is so intelligent that punishment is offensive. These are very bright, sensitivedogs. Abuse is counterproductive. Simply correct unwanted behavior with a dominant demeanor and consistently praise achievement.",
      "housebreaking": "No special problem.",
      "aestheticQuality": "The classic image of the faithful and noble friend.",
      "personality": "Shepherds need the respect and love of their families above all else. The children are their self-determined responsibility. All ages and types of children will be well cared for. Exercise is important. Shepherds are powerful, active dogs and will be active indoors even with a daily outdoor exercise period, so a small apartment is not appropriate, but they will adjust to any environment if necessary. The reports of aggresive behavior from German Shepherd Dogs could refer only to a poorly bred or mistreated animal, so select a well-bred puppy from a responsible breeder."
    },
    {
      "name": "Miniature American Shepherd",
      "images": "dogs-195/31-miniature-american-shepherd.jpg",
      "origin": "The Miniature American Shepherd, frequently abbreviated MAS, is a small herding dog breed. The MAS is highly intelligent and biddable. The breed is often trained for dog sports such as herding, agility, obedience, canine freestyle, flyball, and others.",
      "heightAtShoulder": {
        "males": "14-18",
        "females": "13-17 in."
      },
      "weight": {
        "males": "20-40",
        "females": "15-35 lbs."
      },
      "Grooming": "The Miniature American Shepherd needs lots of brushing and could use professional grooming some times.",
      "cost": "Expensive",
      "Capabilities": "The breed is often trained for dog sports such as herding, agility, obedience, canine freestyle, flyball, and others.",
      "Training Tip": "They are very bright and learn easily. The Miniature American Shepherd is a very intelligent animal that learns very fast and easy.",
      "Housebreaking": "No problems at all.",
      "Aesthetic quality": "Their agility",
      "Personality": "These are affectionate, intelligent, loyal dogs. They are active inside and outside because they have a lot of energy but given enough exercise they adjust to apartment living well."
    },
    {
      "name": "Old English Sheepdog",
      "images": "dogs-195/68-old-english-sheepdog.jpg",
      "origin": "The Old English Sheepdog, which originated in England around 1800's for herding sheep and looking after them and protecting them.",
      "heightAtShoulder": {
        "males": "23-29",
        "females": "22-27 in."
      },
      "weight": {
        "males": "75-90",
        "females": "65-80 lbs."
      },
      "grooming": "Anyone who gets one of these dogs should be prepared to spend time grooming him. The dog's long shaggy coat that must be brushed regularly.",
      "cost": "Expensive, to acquire and feed.",
      "capabilities": "The Old English Sheepdog's, protective instincts make it an excellent watchdog. In addition, many Old English Sheepdog are great with kids and will watch over them.",
      "trainingTip": "Start early and be firm but not overly so. These dogs want to please their family.",
      "housebreaking": "Pretty easy for the most part, keep a regular schedule.",
      "aestheticQuality": "A big shaggy dog, who is fun loving.",
      "personality": "The Old English Sheepdog needs the respect and love of their families above all else. The children are their self-determined responsibility. All ages and types of children will be well cared for. Exercise is important. The Old English Sheepdog are powerful, active dogs and will be active indoors even with a daily outdoor exercise period, so a small apartment is not appropriate, but they will adjust to any environment if necessary. The reports of aggresive behavior from The Old English Sheepdog could refer only to a poorly bred or mistreated animal, so select a well-bred puppy from a responsible breeder."
    },
    {
      "name": "Pembroke Welsh Corgi(KAWR gee)",
      "images": "dogs-195/11-pembroke-welsh-corgi.jpg",
      "origin": "Henry I brought Flemish weavers to England in 1107. They made their home in Southwestern Wales. With them came their dogs, who descended from Northern Spitz-types. They are known today as Pembroke Welsh Corgis. The Cardigan Welsh Corgi is descended from the Dachshund, but because the two Corgis were interbred  in the nineteenth century, and they are very similar in appearance now. Pembrokes are the Corgis with pointed ears and almost no tail. The Cardigans have more rounded ears and long tails. For hundreds of years the Corgis servered their masters by nipping the heels of neighbors' cattle to keep them off their master's share of the grazing land. The word Corgi comes from two Welsh words meaning Dwarf Dog.",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "10-12 in."
      },
      "weight": {
        "males": "27-30",
        "females": "25-28 lbs."
      },
      "grooming": "The medium-length outer coat and downy undercoat shed all year long, especially in the late spring and early fall. Regular brushing is helpful.",
      "cost": "Moderate",
      "capabilities": "Corgis are natural guard dogs and watchdogs.",
      "trainingTip": "They are very bright and learn easily.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Foxlike head on long, low, tailless body.",
      "personality": "The Pembroke is a bit more outgoing than the Cardigan and probably relates to children more easily, although they both like children. Older children usually get along with this breed better because their dominance is more acceptable to these decision-making cattle-dogs. These dogs are very active indoors but because of their short legs they do not require too much outdoor exercise. Apartments, houses or acres of countryside are all fine."
    },
    {
      "name": "Polish Lowland Sheepdog",
      "images": "dogs-195/175-polish-lowland-sheepdog.jpg",
      "origin": "The Polish Lowland Sheepdog, is a medium-sized, shaggy-coated, sheep dog breed native to Poland. ",
      "heightAtShoulder": {
        "males": "18-20",
        "females": "17-19 in."
      },
      "weight": {
        "males": "40-50",
        "females": "30-40 lbs."
      },
      "Grooming": "With the shaggy-coat the Polish Lowland Sheepdog needs a lot of brushing daily and professional grooming.",
      "cost": "Expensive",
      "Capabilities": "Polish Lowland Sheepdog are natural pets and love their families. They are very active, lively, and agile.",
      "Training Tip": "They are very bright and learn easily.",
      "Housebreaking": "No problems at all.",
      "Aesthetic quality": "Their look is like a bear",
      "Personality": "These are affectionate, intelligent, loyal dogs who take their family responsibilities seriously. If given enough outdoor exercise they are not to active inside and adjust to apartment living well. Be sure to get a well-bred puppy for children."
    },
    {
      "name": "Puli (Hungarian)",
      "images": "dogs-195/143-hungarian-puli.jpg",
      "origin": "A Hungarian herding dog, that originated somewhere around 1000's. Someone once described the Puli as looking like a 'mop with eyes'. The Puli is a mid-sized dog.",
      "heightAtShoulder": {
        "males": "19-20",
        "females": "17-19 in."
      },
      "weight": {
        "males": "30-35",
        "females": "25-30 lbs."
      },
      "grooming": "The Puli has a very long and corded white coat, like the strands of a mop, and it requires more than a little attention to keep it looking good.",
      "cost": "Very Expensive",
      "capabilities": "The Puli is a very quick learner and makes an excellent guard dog. This is also a very active dog, and while he is a high-spirited and protective, he is also willful and quick-tempered.",
      "trainingTip": "These are responsive and very quick learners, and easily trained dogs.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "A very high-strung dog with lots of energy.",
      "personality": "The Puli does bark a lot and some times it can get excessive. This is not the dog for very small children because they may inadvertantly anger him. He is a very protective dog who is very active and needs lots of room to run around. Not the dog for an apartment."
    },
    {
      "name": "Shetland Sheepdog",
      "images": "dogs-195/27-shetland-sheepdog.jpg",
      "origin": "The Sheltie descends from the same Scottish sheep herders as the modern Collie. But the Sheltie is a much smaller version. The people of the Shetland Islands, off the Northern coast of Scotland, allowed the Sheltie to develop quietly and go unnoticed by the rest of the world until the beginning of the twentieth century.",
      "heightAtShoulder": {
        "males": "13-16",
        "females": "13-16 in."
      },
      "weight": {
        "males": "15-20",
        "females": "15-20 lbs."
      },
      "grooming": "The long outer coat and downy undercoat shed all year long, especially in the late spring and early fall when the coat adjusts to the change in temperature. Regular brushing is essential.",
      "cost": "Moderate",
      "capabilities": "Warning strangers and sounding the alarm to strange noises are well within the Sheltie's talents, but guarding is not.",
      "trainingTip": "This is a sensitive breed and as such does very poorly when punished or treated harshly. They become shy if mistreated. Train them easily and gently to maintain their sweet temperaments.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Miniature version of Lassie.",
      "personality": "Shelties need older,  more thoughtful children who will not roughhouse with them. Even though they are relative small, they like outdoor exercise and remain moderately active indoors. This is a good choice for apartment dwellers if the dog is introduced to the environment early. An older dog seeing buses and hearing taxis for the first time may be frightened."
    }
  ]
},{
  "_id": {
    "$oid": "6706be2030f32534925c8c29"
  },
  "category": "hound",
  "dogInfo": [
    {
      "name": "Afghan Hound(AF guhn)",
      "images": "dogs-195/122-afghan-hound.jpg",
      "origin": "The Afghan Hound has been used for hunting Gazelles and Hares in Afganistan for hundreds of years. No one really knows just when or where the Afghan Hound originated.",
      "heightAtShoulder": {
        "males": "27",
        "females": "25 in."
      },
      "weight": {
        "males": "50-60",
        "females": "45-55 lbs."
      },
      "grooming": "It has a heavy coat of long, silky hair that needs constant brushing and occasional trimming.",
      "cost": "Expensive",
      "capabilities": "Announcing the approach of strangers is well within the Afghan Hounds talents. He is a very alert dog.",
      "trainingTip": "The Afghan Hound is intelligent and pretty easy to train.",
      "housebreaking": "Really easy with no problems.",
      "aestheticQuality": "Known for its speed and agility.",
      "personality": "The Afghan Hound is a very protective dog of his family and especially kids. He has a lot of energy so taking him on runs would be great."
    },
    {
      "name": "American Foxhound",
      "images": "dogs-195/192-american-foxhound.jpg",
      "origin": "This is a medium-sized hunting dog. It was bred and trained to hunt foxes by following the scent they leave on the ground. They can be trained to hunt on their on or they hunt in packs of 15 or 20. Most hunt clubs use packs of Foxhounds. The dog has a very sensitive nose to help people track Foxes.",
      "heightAtShoulder": {
        "males": "21-25",
        "females": "20-24 in."
      },
      "weight": {
        "males": "60-70",
        "females": "50-60 lbs."
      },
      "grooming": "Foxhounds are usually white, with different-sized patches of black or tan or both. But a Foxhound can be almost any color. It has very short hair and very little shedding at all.",
      "cost": "Expensive",
      "capabilities": "American Foxhounds can function as watchdogs and even now and then as guard dogs, although it is not their primary talent. Primarily they are scenting hounds.",
      "trainingTip": "These are responsive dogs. They learn very fast and are quick in remembering what is required of them.",
      "housebreaking": "Very easy.",
      "aestheticQuality": "The are well known for their speed, endurance, and stamina in the field.",
      "personality": "Cooperative, gentle, cheerful American Foxhound need their family's attention and love. They are active indoors and deserve a good walk outdoors. Toddlers are handled with the patience of job and quiet older children will value the loyalty and friendship offered by a American Foxhound."
    },
    {
      "name": "Basenji",
      "images": "dogs-195/86-basenji.jpg",
      "origin": "The Basenji is a breed of dog first found in Central Africa around 3400 B.C. Basenji cannot bark, but they can make a yodeling sound.",
      "heightAtShoulder": {
        "males": "16-17",
        "females": "15-16 in."
      },
      "weight": {
        "males": "22-24",
        "females": "20-22 lbs."
      },
      "grooming": "Basenjis have short, silky hair of various colors. It does do some shedding and weekly brushings would do great.",
      "cost": "Expensive",
      "capabilities": "Creating a quiet, relaxed atmosphere is one of the Basenjis most noticeable qualities, but it will act as watchdog if no one else will do it. Guarding is out.",
      "trainingTip": "These are responsive dogs. They learn fast and very intelligent.",
      "housebreaking": "Very easy.",
      "aestheticQuality": "They are known for their yodeling.",
      "personality": "They love to play and they have lots of energy. They will play all day long as long as the kids keep going it will be right there with them. He is a smaller dog so toddlers may need supervision."
    },
    {
      "name": "Basset Hound",
      "images": "dogs-195/36-basset-hound.jpg",
      "origin": "Bas in French means a 'low thing' or 'dwarf.' A dog refered to as a Basset was mentioned in 1585 in a French treatise on Badger hunting. But the Basset Hound appears to have been used most often for hunting rabbits, hares, and deer in France and Belgium. It looks like a Bloodhound on short legs and shares that dog's ability to follow a scent.",
      "heightAtShoulder": {
        "males": "14",
        "females": "14 in."
      },
      "weight": {
        "males": "45",
        "females": "45 lbs."
      },
      "grooming": "This breed sheds, but atleast the coat is short. Otherwise they just need an occasional brushing.",
      "cost": "Moderate",
      "capabilities": "Creating a quiet, relaxed atmosphere is one of the Basset's most noticeable qualities, but it will act as watchdog if no one else will do it. Guarding is out. They are much too easygoing for guard work.",
      "trainingTip": "Bassets are very responsive. Just don't expect quick responses. Give them more praise than correction. Flattery will get you everywhere.",
      "housebreaking": "Early obedience training along with early housebreaking are the best insurance. Some Basset Hounds do have trouble with this chore.",
      "aestheticQuality": "Long, low, heavy, and calm, with a deadpan expression.",
      "personality": "Cooperative, gentle, cheerful Bassets need their family's attention and love. They are not very active indoors but deserve a good walk outdoors, which makes them ideal for the city. Toddlers are handled with the patience of job and quiet older children will value the loyalty and friendship offered by a Basset. Only a very active teenager might be disappointed when the dog preferred a game of Scrabble to a game of catch."
    },
    {
      "name": "Beagle",
      "images": "dogs-195/7-beagle.jpg",
      "origin": "The Romans found Beagle packs in England when they arrived. The English used them for hunting rabbit. Beagle means small, for they are the smallest of the Hounds. Although they have been bred for centuries in packs, they adapt well to living individually in families. The Beagle as we see it today in America was developed in the 1880's. They are bred in two varieties, different only in size. The 13-inch variety and the 15-inch variety both resemble the English Foxhound in miniature and both participate in AKC beagle field trials.",
      "heightAtShoulder": {
        "males": "11-15",
        "females": "10-14 in."
      },
      "weight": {
        "males": "15-23",
        "females": "14-22 lbs."
      },
      "grooming": "Beagles have some shedding, but the coat is short. Occasional brushing is good.",
      "cost": "Moderate",
      "capabilities": "Announcing the approach of strangers is well within the Beagle's talents, but not guarding.",
      "trainingTip": "Circumvent an inborn stubbornness by beginning the training early. Give a lot of praise and demand a lot. Be firm but never punish. Beagles respond very poorly to punishment.",
      "housebreaking": "Housebreaking is difficult if begun late. Get an early start and there is no problem. Rigid schedules always help.",
      "aestheticQuality": "The Snoopy look.",
      "personality": "There is a reason why Beagles are so popular. They are sweet-natured dogs that seem to be genuinely happy. However, popularity breeds indiscriminate breeding, so be sure to get a well-bred puppy. Beagles hate to be left alone. They need a lot of outdoor exercise and are fairly active indoors, but many have made the adjustment to apartment living well. They are gentle enough for toddlers and playful enough for older children."
    },
    {
      "name": "Black and Tan Coonhound",
      "images": "dogs-195/127-black-and-tan-coonhound.jpg",
      "origin": "Black and tans are scent hounds; they live by their noses. They have been bred from English Talbot Hounds, Bloodhounds and Foxhounds for their ability to hunt by scent and for their beautiful black and tan coats. Obviously these hounds specialize in raccoons, but they also excel in trailing deer, mountain lion and bear.",
      "heightAtShoulder": {
        "males": "25-27",
        "females": "23-25 in."
      },
      "weight": {
        "males": "65-85",
        "females": "60-80 lbs."
      },
      "grooming": "There is some shedding of the short coat. The dog needs a brushing now and then.",
      "cost": "Moderate",
      "capabilities": "Black and Tans can function as watchdogs and even now and then as guard dogs, although it is not their primary talent. Primarily they are scenting hounds.",
      "trainingTip": "These are responsive dogs. Do not be too exuberant when praising them. They need to concentrate.",
      "housebreaking": "They have surprisingly few problems in this area, but don't take a hound for granted.",
      "aestheticQuality": "Sleek, black, athletic hunting dog.",
      "personality": "This is a large, energetic animal that needs extensive, daily, outdoor exercise, which usually means a country setting is best. However, he is calm indoors. Such a large, active dog would seem to be too much for a toddler, but if the child doesn't mind, the Black and Tan doesn't. They are very patient, easygoing members of the family. What they don't like is being left alone."
    },
    {
      "name": "Bloodhound",
      "images": "dogs-195/46-bloodhound.jpg",
      "origin": "The Bloodhound originated in the Middle East around 100 B.C. The Bloodhound is an excellent tracking animal that holds his nose to the ground to follow the sent. He has long ears to stir up the scent so that he can follow it easier.",
      "heightAtShoulder": {
        "males": "22-26",
        "females": "20-24 in."
      },
      "weight": {
        "males": "80-110",
        "females": "70-100 lbs."
      },
      "grooming": "The Bloodhound has a very short coat and hardly any shedding. Occasional baths would be great for this breed.",
      "cost": "Expensive",
      "capabilities": "Bloodhounds can function as watchdogs and even now and then as guard dogs, although it is not their primary talent. Primarily they are scenting hounds.",
      "trainingTip": "These are responsive dogs. Do not be too exuberant when praising them. They need to concentrate.",
      "housebreaking": "They have surprisingly few problems in this area, but don't take a hound for granted.",
      "aestheticQuality": "Sleek, athletic hunting dog.",
      "personality": "This is a large, energetic animal that needs extensive, daily, outdoor exercise, which usually means a country setting is best. However, he is calm indoors. Such a large, active dog would seem to be too much for a toddler, but if the child doesn't mind, the Bloodhound doesn't. They are very patient, easygoing members of the family. What they don't like is being left alone."
    },
    {
      "name": "Borzoi(BAWR zoy)",
      "images": "dogs-195/103-borzoi.jpg",
      "origin": "The Borzoi also called a Russian Wolfhound, is a dog originally bred in Russia around the 1600's to chase down game animals. The word Borzoi is Russian for swift.",
      "heightAtShoulder": {
        "males": "26-31",
        "females": "24-29 in."
      },
      "weight": {
        "males": "75-150",
        "females": "65-140 lbs."
      },
      "grooming": "This rough, shaggy coat needs some care and brushing to keep that tousled curly look. There is shedding.",
      "cost": "Very Expensive, to acquire and feed",
      "capabilities": "The Borzoi can function as a watchdog because they will alert to any strangers coming around. They are very playful animals and love to run around.",
      "trainingTip": "These are responsive dogs. They learn fast and are very intelligent.",
      "housebreaking": "Borzois have no problem with housebreaking, but begin early.",
      "aestheticQuality": "The are well known for their speed, endurance, and stamina in the field.",
      "personality": "This is a large, energetic animal that needs extensive, daily, outdoor exercise, which usually means a country setting is best. However, he is calm indoors. Such a large, active dog would seem to be too much for a toddler, but if the child doesn't mind, the Borzoi doesn't. They are very patient, easygoing members of the family."
    },
    {
      "name": "Dachshund",
      "images": "dogs-195/10-dachshund.jpg",
      "origin": "The 'Hotdog' is available, like frankfurters, in a variety of sizes and are classified as either miniature or standard. He may be shorthaired, wirehaired, and longhaired. The Dachshund comes in a variety of hues, including red, brown with brownish spots, or black with tan spots. The Dachshund comes from Germany, and his name means 'Badger Dog,' referring to his original purpose - to go to ground for Badger and other game. Dachshunds can suffer from possible back trouble, which is hereditary and genetic, so owners should beaware that it could occur and talk to the breeder about any problems in the line they are considering.",
      "heightAtShoulder": {
        "males": "5-10 ",
        "females": "5-9 in."
      },
      "weight": {
        "males": "5-20",
        "females": "5-20 lbs."
      },
      "grooming": "There is some shedding of the short coat, and also the wirehaired, and the longhaired. The dog needs a brushing now and then.",
      "cost": "Moderate",
      "capabilities": "These are happy, friendly dogs who make excellent pets and watchdogs because of their bark.",
      "trainingTip": "They are responsive dogs and training should not be a problem. You can not be hard on them or aggresive because they will become timid and shy.",
      "housebreaking": "Very easy.",
      "aestheticQuality": "They are known for their short statchered and long body.",
      "personality": "They love to play and they have lots of energy. They will play all day long as long as the kids keep going it will be right there with them. They make great pets and they will love everyone in the house."
    },
    {
      "name": "English Foxhound",
      "images": "dogs-195/194-english-foxhound.jpg",
      "origin": "The English Foxhound is one of the oldest breeds of hounds. Careful breeding records, dating back to the 1700's, given the ancestry of some purebred English Foxhounds through 50-60 generations. The breed derives from the Staghound, the Beagle, and the Southern(Old English) Hound. It has traditionally been used for hunting Foxes. The Hounds run in packs, trailing the Fox by the scent it leaves on the ground. English Foxhounds are rarely kept as house pets. They were first brought to North America in 1738.",
      "heightAtShoulder": {
        "males": "22-23",
        "females": "21-22 in."
      },
      "weight": {
        "males": "60-75",
        "females": "55-70 lbs."
      },
      "grooming": "Its smooth, hard coat does not shed at all and doesn't need much attention.",
      "cost": "Expensive",
      "capabilities": "These dogs are primarily used as watch dogs now and some guarding because they are very standoffish.",
      "trainingTip": "These are responsive dogs.",
      "housebreaking": "They are not really kept as house pets at all.",
      "aestheticQuality": "Its sturdy and heavy-boned body.",
      "personality": "They are not affectionate and do not seek much petting or attention from people."
    },
    {
      "name": "Greyhound",
      "images": "dogs-195/142-greyhound.jpg",
      "origin": "Greyhounds are one of the fastest of all dogs. It originated more than 5,000 years ago in Egypt, where it was used to hunt Gazelles. Greyhounds were also once used to hunt game in North America, especially on the Kansas plains. Today, Greyhounds race on an oval track, on which they chase a mechanical lure. Some states have done away with Greyhound racing and made it illegal. A Greyhound is a strong and elegant animal. Greyhounds used in track racing are registered with The National Greyhound Association in Abilene, Kansas. Greyhounds bred for show are registered with the American Kennel Club in Raleigh, North Carolina.",
      "heightAtShoulder": {
        "males": "20-23",
        "females": "20-23 in."
      },
      "weight": {
        "males": "60-70",
        "females": "60-70 lbs."
      },
      "grooming": "This breed sheds very little, but atleast the coat is short.",
      "cost": "Very Expensive",
      "capabilities": "These are happy, friendly dogs who love their families and playing around. They love to have fun with kids and they love to run because they are full of energy.",
      "trainingTip": "They are responsive dogs and training should not be a problem. You can not be hard on them or aggresive because they will become timid and shy.",
      "housebreaking": "Really easy with no problems.",
      "aestheticQuality": "Known for its speed and agility.",
      "personality": "This is a large, energetic animal that needs extensive, daily, outdoor exercise, which usually means a country setting is best. However, he is calm indoors. Such a energetic, active dog would seem to be too much for a toddler, but if the child doesn't mind, the Greyhound doesn't. They are very patient, easygoing members of the family."
    },
    {
      "name": "Harrier",
      "images": "dogs-195/190-harrier.jpg",
      "origin": "The Harrier is a breed of dog developed for the sport of hunting Hares. It has a keen sense of smell and can move quickly. The Harrier is sturdy and heavy boned, with cat-like feet. They look like small Foxhounds or large Beagles. The breed probably originated as early as the 1000's. Its ancestry is unclear, but many breeders believe that the Harrier was developed in France from a type of Foxhound. Americans have raised Harriers for Rabbit hunting since colonial times.",
      "heightAtShoulder": {
        "males": "19-21",
        "females": "18-20 in."
      },
      "weight": {
        "males": "35-55",
        "females": "35-55 lbs."
      },
      "grooming": "There is a little shedding so a little brushing will help.",
      "cost": "Expensive",
      "capabilities": "These are happy, friendly dogs who make excellent pets and watchdogs and guarddogs because of their loyalty to their owners.",
      "trainingTip": "These are responsive dogs. They learn fast and are very intelligent.",
      "housebreaking": "Really easy with no problems.",
      "aestheticQuality": "Their cat-like feet",
      "personality": "There is a reason why Harriers are so popular. They are sweet-natured dogs that seem to be genuinely happy. However, popularity breeds indiscriminate breeding, so be sure to get a well-bred puppy. They need a lot of outdoor exercise and are fairly active indoors, but many have made the adjustment to apartment living well. They are gentle enough for toddlers and playful enough for older children."
    },
    {
      "name": "Ibizan Hound(ee BEE zuhn",
      "images": "dogs-195/171-ibizan.jpg",
      "origin": "It is a rare breed of dog from the Island of Ibiza, off the Eastern coast of Spain. It is descended from hunting dogs of ancient Egypt brought to Ibiza by merchants. The people of Ibiza used it primarily to hunt rabbits and other game. The breed became popular on the spanish mainland and eventually spread throughout Europe. It was introduced into the United States in 1956. Today it is used chiefly for hunting and exhibition. The Ibizan Hound resembles the Greyhound.",
      "heightAtShoulder": {
        "males": "23-27",
        "females": "22-26 in."
      },
      "weight": {
        "males": "42-50",
        "females": "40-48 lbs."
      },
      "grooming": "There is some shedding of the short coat, there is also some of the Ibiza Hounds that have longer coats that are thick and wiry. The dog needs a brushing now and then.",
      "cost": "Very Expensive",
      "capabilities": "These dogs are primarily used as watch dogs now and exhibition.",
      "trainingTip": "These are responsive dogs. They learn very fast and are quick in remembering what is required of them.",
      "housebreaking": "Really easy with no problems.",
      "aestheticQuality": "Sleek, athletic hunting dog.",
      "personality": "The ancient but rare Ibizan Hound is best suited to country living. They are happy, easygoing dogs who love their family."
    },
    {
      "name": "Irish Wolfhound",
      "images": "dogs-195/74-irish-wolfhound.jpg",
      "origin": "This Medieval giant hunted the Irish Elk (six feet at the shoulder) and the wolf for Kings. There is even mention of this enormous dog in Roman history. But by the nineteenth century the Irish Wolfhound was almost extinct. The breed was saved by a Scottish Officer in the British army, Captain George A. Graham.",
      "heightAtShoulder": {
        "males": "32-34",
        "females": "30-32 in."
      },
      "weight": {
        "males": "120",
        "females": "105 lbs."
      },
      "grooming": "This wiry, rough coat needs regular brushing, trimming, and stripping (plucking out loose fur with one's fingers). There is also some shedding.",
      "cost": "Very Expensive, to acquire and feed",
      "capabilities": "They are beautiful to look at and easy to live with but they are not suitable as watchdogs or guard dogs.",
      "trainingTip": "Be firm. These dogs must be controlled because of their size. A consistent early beginning is the best way. Irish Wolfhounds will respond quite well when they know you mean it.",
      "housebreaking": "Irish Wolfhounds have no problem with housebreaking, but begin early.",
      "aestheticQuality": "Lovable, smiling giant.",
      "personality": "They do not like to rush. Wolfhounds are easygoing cooperative dogs who must be pushed to take their long daily gallops. Being inactive indoors allows them to adapt to city life well. Older children are better suited to the Wolfhound. Small Children might be overcome by their size. They are especially good at rough play with big kids. But these very large dogs have shorter life spans."
    },
    {
      "name": "Norwegian Elkhound",
      "images": "dogs-195/91-norwegian-elkhound.jpg",
      "origin": "The dog's bones have been found among those of Vikings dating 7,000 years ago. This breed is generally regarded as one of the best ever developed. The Norwegian Elkhound has the heart of Lion, which it has engaged in combat, and has been used for all kinds of hunting, including Bears and Wolfes. It is said that the Norwegian Elkhound can smell and hear things at distances up to three miles, which is astonishing.",
      "heightAtShoulder": {
        "males": "20",
        "females": "19 in."
      },
      "weight": {
        "males": "45-50",
        "females": "45-50 lbs."
      },
      "grooming": "The Norwegian Elkhound sheds heavily and they need daily brushing.",
      "cost": "Very Expensive, to acquire and feed",
      "capabilities": "He has a distinct, high-pitched bark and barks more than other breeds. In addition to all of the qualities this dog has, the dog is very gentle, playful, and very loyal.",
      "trainingTip": "This is a very smart breed, but if these dogs are not well trained they may try to dominate their owners.",
      "housebreaking": "Norwegian Elkhounds have no problem with housebreaking, but begin early.",
      "aestheticQuality": "His heart of a Lion.",
      "personality": "He is very gentle, playful, and very loyal. He loves kids and playing with them and will go as long as they want without stopping. They are very protective of their family."
    },
    {
      "name": "Otterhound",
      "images": "dogs-195/176-otterhound.jpg",
      "origin": "From the early thirteenth century in England there was a need to hunt Otter. Man and Otter were in competition for fish. In the nineteenth century it became a sport, and Otter Hounds were kept in packs. But most of the Otters are gone now in England, as are most of the Otter Hounds. The dog's happy-go-lucky quality is beginning to appeal to Americans.",
      "heightAtShoulder": {
        "males": "24-27",
        "females": "22-26 in."
      },
      "weight": {
        "males": "75-115",
        "females": "65-100 lbs."
      },
      "grooming": "This rough, shaggy coat needs some care and brushing to keep that tousled look. There is shedding.",
      "cost": "Moderate",
      "capabilities": "These are happy, friendly dogs who do a little watching but no guarding.",
      "trainingTip": "Otter Hounds are difficult to train. Be firm and consistent. Begin early and stay with it. Training is important for such a large dog.",
      "housebreaking": "Keep rigid schedules and be very firm. Housebreaking is a difficult chore for the Otter Hound. Begin early.",
      "aestheticQuality": "Playful, shaggy giant.",
      "personality": "The ancient but rare Otter Hound is best suited to country living. They are happy, easygoing dogs who love everyone, but they should never be off leash or out of the owner's control. They will take off after a wild animal and wonder where they are miles later. Big children have a great time with these big dogs, but small children need a different breed."
    },
    {
      "name": "Petits Bassets Griffons Vendeen",
      "images": "dogs-195/164-petits-bassets-griffons-vendeen.jpg",
      "origin": "The Petit Basset Griffon Venden, or PBGV, is a breed of dog of the scent hound type, bred to trail hares in bramble-filled terrain of the Vende district of France. The breed is known in the United States as 'Petit' or 'PBGV,' in England as 'Roughie,' and in Denmark as 'Griffon' or 'Petit'.",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "9-11 in."
      },
      "weight": {
        "males": "33-44",
        "females": "33-44 lbs."
      },
      "grooming": "The Petit Basset Griffon Vendeen sheds heavily and they need daily brushing.",
      "cost": "Expensive",
      "capabilities": "These are happy, friendly dogs who do a little watching but no guarding.",
      "trainingTip": "They are responsive dogs and training should not be a problem.",
      "housebreaking": "Petit Basset Griffon Vendeen have no problem with housebreaking, but begin early.",
      "aestheticQuality": "Friendly, lively, happy, and active.",
      "personality": "They love to play and they have lots of energy. They will play all day long as long as the kids keep going it will be right there with them."
    },
    {
      "name": "Pharaoh Hound",
      "images": "dogs-195/180-pharaoh-hound.jpg",
      "origin": "The Pharaoh Hound or Kelb tal-Fenek is a Maltese breed of hunting dog. It is traditionally used for rabbit-hunting in the rocky terrain of the islands; the Maltese name means 'rabbit dog'.",
      "heightAtShoulder": {
        "males": "17-19",
        "females": "17-19 in."
      },
      "weight": {
        "males": "40-60",
        "females": "40-60 lbs."
      },
      "grooming": "This breed sheds very little, but atleast the coat is short.",
      "cost": "Very Expensive",
      "capabilities": "They are beautiful to look at and easy to live with but they are not suitable as watchdogs or guard dogs because they are very sociable and playful.",
      "trainingTip": "They are responsive dogs and training should not be a problem.",
      "housebreaking": "Really easy with no problems.",
      "aestheticQuality": "Sleek, rich tan, red golden, tan, chestnut colored, athletic looking dog.",
      "personality": "They love to play and they have lots of energy. They will play all day long as long as the kids keep going it will be right there with them."
    },
    {
      "name": "Rhodesian Ridgeback",
      "images": "dogs-195/42-rhodesian-ridgeback.jpg",
      "origin": "The Rhodesian Ridgeback is a large breed of dog breed originally bred in Southern Africa. The original breed standard was drafted by F.R. Barnes, in Bulawayo, Southern Rhodesia, in 1922, and approved by the South African Kennel Union in 1927. Its forebears can be traced to the ridged hunting and guardian dogs of the Khoikhoi.",
      "heightAtShoulder": {
        "males": "25-27",
        "females": "24-26 in."
      },
      "weight": {
        "males": "79-90",
        "females": "64-75 lbs."
      },
      "grooming": "The Rhodesian Ridgeback needs very little grooming and there is no shedding.",
      "cost": "Very Expensive",
      "capabilities": "These are happy, friendly dogs who make excellent pets and watchdogs and guarddogs because of their loyalty to their owners.",
      "trainingTip": "They are responsive dogs and training should not be a problem. You can not be hard on them or aggresive because they will become timid and shy. They are very sensitive and they are strong willed.",
      "housebreaking": "Rhodesian Ridgeback have no problem with housebreaking, but begin early and be consistent.",
      "aestheticQuality": "Sleek, athletic hunting dog.",
      "personality": "This is a large, energetic animal that needs extensive, daily, outdoor exercise, which usually means a country setting is best. However, he is calm indoors. Such a energetic, active dog would seem to be too much for a toddler, but if the child doesn't mind, the Rhodesian Ridgeback doesn't. They are very patient, easygoing members of the family."
    },
    {
      "name": "Saluki",
      "images": "dogs-195/144-saluki.jpg",
      "origin": "The Saluki is a standardised breed developed from sighthounds - dogs that hunt primarily by sight rather than strong scent - that was once used by nomadic tribes to run down game animals. The dog was originally bred in the Fertile Crescent.",
      "heightAtShoulder": {
        "males": "16-20",
        "females": "16-20 in."
      },
      "weight": {
        "males": "40-60",
        "females": "40-60 lbs."
      },
      "grooming": "This long, soft coat needs regular brushing and trimming. There is also some shedding.",
      "cost": "Very Expensive",
      "capabilities": "The Saluki can function as a watchdog because they will alert to any strangers coming around. They are not playful animals and are really aloof.",
      "trainingTip": "These are responsive dogs. They learn fast and are very intelligent.",
      "housebreaking": "Very easy.",
      "aestheticQuality": "Known for its speed and agility.",
      "personality": "The Saluki is real reserved, quiet, and they are aloof. They would rather be left alone and just lounge around."
    },
    {
      "name": "Scottish Deerhound",
      "images": "dogs-195/166-scottish-deerhound.jpg",
      "origin": "The Scottish Deerhound, or simply the Deerhound, is a breed of large sighthound, once bred to hunt the red deer by coursing. In outward appearance it is similar to the Greyhound, but larger and more heavily boned, with a rough coat.",
      "heightAtShoulder": {
        "males": "28-30",
        "females": "27-29 in."
      },
      "weight": {
        "males": "85-110",
        "females": "75-95 lbs."
      },
      "grooming": "Daily brushing whould do him good and he will shed a little.",
      "cost": "Very Expensive, to acquire and feed",
      "capabilities": "These are happy, friendly dogs who make excellent pets and watchdogs.",
      "trainingTip": "They are responsive dogs and training should not be a problem.",
      "housebreaking": "Very easy.",
      "aestheticQuality": "His heart of a Lion.",
      "personality": "The Afghan Hound is a very protective dog of his family and especially kids. He has a lot of energy so taking him on runs would be great. He is a very gentle dog who loves to play and as long as the kids want to play he will be right there with them. He is a large dog but he is very Gentle."
    },
    {
      "name": "Whippet",
      "images": "dogs-195/59-whippet.jpg",
      "origin": "This dog seems to personify Coco Chanel's motto, 'You can't be to beautiful or to thin.' If a dog can be described as gorgeous, then this is an apt description for the Whippet. He is a slim and sleek, a kind of thinner, smaller version of a greyhound, and brings to mind of a fashion model parading down a runway.",
      "heightAtShoulder": {
        "males": "22",
        "females": "22 in."
      },
      "weight": {
        "males": "28",
        "females": "28 lbs."
      },
      "grooming": "The Whippet needs very little grooming and there is no shedding.",
      "cost": "Expensive",
      "capabilities": "A very classy dog that is gorgeous and reminds you of a runway model.",
      "trainingTip": "These are responsive dogs. They learn fast and are very intelligent.",
      "housebreaking": "Very easy.",
      "aestheticQuality": "Their Beauty.",
      "personality": "The Whippet can make a very difficult pet because they will chase after anything that they see, such as the neighbor's cat. Paying no mind to the traffic streaming back and forth in the roadway. One should be weary, however, when bringing a Whippet into a house with very young kids. This fragile dog needs gentle handling and has little patience for someone pulling his tail."
    }
  ]
},{
  "_id": {
    "$oid": "6706be2c30f32534925c8c2a"
  },
  "category": "nonsporting",
  "dogInfo": [
    {
      "name": "American Eskimo Dog",
      "images": "dogs-195/119-american-eskimo-dog.jpg",
      "origin": "This small dog was developed by breeders in the United States during the early 1900's It is decended from the European Spitz breeds. American Eskimo dogs are often called 'Eskies'. They were well known for performing in Circuses. This breed of dog has three(3) varieties - Standard, Miniature, and Toy.",
      "heightAtShoulder": {
        "males": "9-19",
        "females": "7-17 in."
      },
      "weight": {
        "males": "8-60",
        "females": "7-55 lbs."
      },
      "grooming": "They have a very fluffy white coat that is medium length that needs brushing daily and sometimes needs professional grooming.",
      "cost": "Expensive",
      "capabilities": "The American Eskimo Dog is a very intelligent, alert, and entergetic dog, that loves to entertain and please its family and guest. He is a very playful dog with lots of energy.",
      "trainingTip": "The Eskimo Dog is very easy to train. There is no need to be loud or anything toward them when training. Give lots of praise and the use of a excited and upbeat voice is all that you need.",
      "housebreaking": "Very Easy.",
      "aestheticQuality": "Known for its fluffy white coat.",
      "personality": "Eskies are very entergetic, alert to their surroundings, and very intelligent. They love to play around and entertain their families or guest of the house. It is very good with kids and younger children, just without being to rough with them because of their smaller stature."
    },
    {
      "name": "Bichon Frise",
      "images": "dogs-195/45-bichon-frise.jpg",
      "origin": "Bichon-type dogs lived in the Dark Ages throughout the Mediterranean region. They thrived during the Renaissance in Spain, France, and Italy. For hundreds of years they were kept as pets. No hunting or herding for the Bichon. Their job in entertaining and giving unending love and devotion. They are experts. After a long history in Europe they made the trip to the United States in the 1950s and were accepted by the American Kennel club in the 1970s.",
      "heightAtShoulder": {
        "males": "8-12",
        "females": "8-12 in."
      },
      "weight": {
        "males": "14-20",
        "females": "11-18 lbs."
      },
      "grooming": "This abundant, curly white coat almost never sheds! However, there is extensive brushing involved and regular visits to a professional groomer for trimming.",
      "cost": "Expensive",
      "capabilities": "Companionship is their principal talent, though they sometimes serve as watchdogs.",
      "trainingTip": "Training should be easy. They are very responsive.",
      "housebreaking": "Be patient and diligent about the schedule. After perfection has been reach there could be lapses, so never give up that rigid schedule.",
      "aestheticQuality": "Fluffy little white ball.",
      "personality": "The Bichon is so happy and sweet natured, busy and active, that it is extremely easy to live with, exspecially in an apartment. Although very active in doors, it needs comparatively little outdoor exercise. They are really the size of a large toy dog, so they can't withstand rough treatment from young or active children."
    },
    {
      "name": "Boston Terrier",
      "images": "dogs-195/21-boston-terrier.jpg",
      "origin": "Born and bred in Boston in the 1870s from the mating of an English Bulldog and a white English Terrier, Boston Terriers serve the sole purpose of giving and recieving affection. They always seem to have a smile on their wide little faces.",
      "heightAtShoulder": {
        "males": "15-16",
        "females": "15-16 in."
      },
      "weight": {
        "males": "15-25",
        "females": "15-25 lbs."
      },
      "grooming": "There is some shedding, but the coat is short. Occasional brushing is good. The care of the Boston Terrier is really easy.",
      "cost": "Moderate",
      "capabilities": "Companionship is their primary function, but they do make good watch dogs.",
      "trainingTip": "There is the Terrier stubborn streak here, so be patient. Expect a Boston to be responsive, particularly when the training is consistent, firm, and the praise is exuberant.",
      "housebreaking": "Include as many walks as possible in the housebreaking schedule and don't be surprised when mistakes happen. Bostons are sensitive to punishment, so simple admonish when necessary and praise lavishly when appropiate.",
      "aestheticQuality": "Round eyed, round bodied, and wise.",
      "personality": "Bostons are easy to love and live with. They make wonderful city dogs because need minimal outdoor exercise even though they are somewhat active indoors. They are not much bigger than some of the Toy breeds, so some caution should govern how the children play with them, but Bostons can have a great time with any age child."
    },
    {
      "name": "Bulldog",
      "images": "dogs-195/5-bulldog.jpg",
      "origin": "The affectionate homebody was originally bred to attack bulls for sport. When bull-baiting was abolished in England in 1835, the Bulldog nearly vanished with it. The few people still intrested in the breed for its own sake created the Bulldog we know today. The courage remains but the fighting instinct has been deliberately bred out.",
      "heightAtShoulder": {
        "males": "15-16",
        "females": "14-15 in."
      },
      "weight": {
        "males": "50",
        "females": "40 lbs."
      },
      "grooming": "There is some shedding, but the coat is short. Occasional brushing is good. Bulldogs do need their mouths wiped at times each day.",
      "cost": "Expensive",
      "capabilities": "This is a suberb guard dog. He is always gentle and does not become aggresive until absolutely necessary. He doesn't bark much, so as a watchdog he isn't very effective.",
      "trainingTip": "When training is begun early, Bulldogs are very responsive. If to much time goes by, a stubborness could set in.",
      "housebreaking": "No Problem",
      "aestheticQuality": "A wheezing, snoring, drooling, magnificent animal.",
      "personality": "These legendary tough guys need and give loyalty and affection. Bulldogs only live up to their ferocious looks after extreme provocation. Any space, any place is fine since they need minimal exercise. Bulldogs love everyone in the family, including the cat. They are particularly strong and patient, which is a good combination for toddlers. They are poor at jogging and romping, which could be a drawback for an active teenager."
    },
    {
      "name": "Chinese Shar-Pei (shahr pay)",
      "images": "dogs-195/61-chinese-shar-pei.jpg",
      "origin": "It is a breed of dog that originated in China about 200 B.C. It is also known simply as the Shar-Pei. Its skin is loose, and wrinkles cover the head, neck, and shoulders. Shar-Peis originally were used as guard dogs and later may have been bred to fight.",
      "heightAtShoulder": {
        "males": "18-20",
        "females": "18-20 in."
      },
      "weight": {
        "males": "40-50",
        "females": "40-50 lbs."
      },
      "grooming": "The Chinese Shar Pei has a short, harsh coat of a solid colors. There is very little shedding.",
      "cost": "Expensive",
      "capabilities": "The Chinese Shar Pei can be used as a guard dog and watch dog.",
      "trainingTip": "Training should be easy. They are very responsive and intelligent.",
      "housebreaking": "Very Easy.",
      "aestheticQuality": "Known for its wrinkles.",
      "personality": "They are alert, independent, intelligent, and very loyal. They love children and playing as much as they want to play, also they will watch over them."
    },
    {
      "name": "Chow Chow",
      "images": "dogs-195/84-chow-chow.jpg",
      "origin": "This breed is commonly called Chow, and is one of the oldest breeds of dogs. It originally was bred in China about 150 B.C.",
      "heightAtShoulder": {
        "males": "18-20",
        "females": "18-20 in."
      },
      "weight": {
        "males": "50-60",
        "females": "45-55 lbs."
      },
      "grooming": "The Chow may have long or short hair. Its coat is solid black, blue, red, cinnamon, or cream, with lighter shadings underneath. There is shedding and it does need some grooming.",
      "cost": "Very Expensive",
      "capabilities": "The Chow is a great watchdog and guarddog. They are very active and love to play.",
      "trainingTip": "Training should be easy. They are very responsive and intelligent.",
      "housebreaking": "Easy.",
      "aestheticQuality": "They are known for their blue-black tongue.",
      "personality": "Chows are very strong, active, and intelligent dogs. They love their families and love to play around. They are very good with kids and very protective."
    },
    {
      "name": "Dalmatian",
      "images": "dogs-195/51-dalmatian.jpg",
      "origin": "Dalmatians are obviously named for Dalmatia, a coastal province of Yugoslavia, where they have lived for atleast two hundred years. But the people of many countries claim the Dalmatian as part of their history and culture. His service in Fire houses is legendary, but then so is his service as a 'coach dog,' which he is sometimes called. The English have called him the 'Spotted Dick' and the 'Plum Pudding Dog.' The Dalmatian also has a long history with the Gypsies. Clearly this is an adaptable, popular dog.",
      "heightAtShoulder": {
        "males": "19-23",
        "females": "19-23 in."
      },
      "weight": {
        "males": "50-65",
        "females": "50-65 lbs."
      },
      "grooming": "Dalmatians do shed, but the coat is very short and flat. Regular brushing helps.",
      "cost": "Moderate",
      "capabilities": "These dogs have served their many admirers in many ways. They can haul loads, herd flocks, or serve in the military as sentry dogs. They can hunt and retrieve fowl, follow a scent, or hunt large game. They have performed in circus acts and been trained for guard work. They work well with horses and have tremendous endurance.",
      "trainingTip": "Dalmatians require a calm, firm, patient trainer. Because the dog can be excitable, praise him quietly and gently. Dalmatians are intrinsically stubborn, but their desire to please their owners is so great that they overcome that innate resistance.",
      "housebreaking": "This breed housebreaks with no problems.",
      "aestheticQuality": "Black spots on a large white dog.",
      "personality": "These active, strong dogs need a lot of exercise inside and out. Active children with a love for running and romping would be good for a Dalmatian. This dog is probably too big and active for very young children. When buying a Dalmatian for children be sure to go to a reputable breeder who can show you good steady bloodlines. The city is all right if the dog is exercised faithfully."
    },
    {
      "name": "Finnish Spitz",
      "images": "dogs-195/187-finnish-spitz.jpg",
      "origin": "It is a strong, sturdy dog related to the Siberian Huskey, the Samoyed, and other Artic dogs. A Finnish Spitz looks somewhat like a Fox. The Finnish Spitz is the National dog of Finland. It is descended from dogs used for hunting by the early Finns. Finns still use the dog to hunt game birds. Outside Finland, however, the Finnish Spitz is kept primarily as a pet.",
      "heightAtShoulder": {
        "males": "17-20",
        "females": "15-18 in."
      },
      "weight": {
        "males": "25-35",
        "females": "23-33 lbs."
      },
      "grooming": "The Finnish Spitz has a thick fur that sheds and needs grooming and daily brushing to keep it looking healthy.",
      "cost": "Expensive",
      "capabilities": "These dogs have served their many admirers in many ways. They can hunt and retrieve fowl, follow a scent, or hunt game birds.",
      "trainingTip": "Finnish Spitzs require a calm, firm, patient trainer. Because the dog can be excitable, praise him quietly and gently. Finnish Spitzs are intrinsically stubborn, but their desire to please their owners is so great that they overcome that innate resistance.",
      "housebreaking": "This breed housebreaks with no problems.",
      "aestheticQuality": "Their red-gold coat and bushy tail.",
      "personality": "These active, strong dogs need a lot of exercise inside and out. Active children with a love for running and romping would be good for a Finnish Spitz. This dog is probably too big and active for very young children. When buying a Finnish Spitz for children be sure to go to a reputable breeder who can show you good steady bloodlines. The city is all right if the dog is exercised faithfully."
    },
    {
      "name": "French Bulldog",
      "images": "dogs-195/2-french-bulldog.jpg",
      "origin": "The French Bulldog is a strong, heavy little dog. Its chuncky body is broader in front than in the back. The French Bulldog has a less wrinkled face than the English one.",
      "heightAtShoulder": {
        "males": "12-15",
        "females": "11-14 in."
      },
      "weight": {
        "males": "18-28",
        "females": "16-26 lbs."
      },
      "grooming": "There is some shedding, but the coat is short. Occasional brushing is good. French Bulldogs do need their mouths wiped at times each day.",
      "cost": "Expensive",
      "capabilities": "This is a suberb guard dog. He is always gentle and does not become aggresive until absolutely necessary. He doesn't bark much, so as a watchdog he isn't very effective.",
      "trainingTip": "French Bulldogs require a calm, firm, patient trainer. Because the dog can be excitable, praise him quietly and gently. French Bulldogs are intrinsically stubborn, but their desire to please their owners is so great that they overcome that innate resistance.",
      "housebreaking": "Be patient and diligent about the schedule. So never give up that rigid schedule.",
      "aestheticQuality": "Its large square wrinkled head.",
      "personality": "French Bulldogs are very strong, active, and intelligent dogs. They love their families and love to play around. They are very good with kids and very protective."
    },
    {
      "name": "Keeshond",
      "images": "dogs-195/96-keeshond.jpg",
      "origin": "For several hundred years the pet dog in Holland has been the Keeshond. It was named for Kees de Gyselaer of Dordrecht, the political opponent of the Prince of Orange in the latter part of the eighteenth century. Before that it had simply been 'the people's dog.' The Prince of Orange won the contest, causing the Keeshod to decrease in numbers until 1920, when the Baroness Van Hardenbroek became his patroness. Keeshons now enjoy international acceptance.",
      "heightAtShoulder": {
        "males": "18",
        "females": "17 in."
      },
      "weight": {
        "males": "40",
        "females": "35 lbs."
      },
      "grooming": "The harsh outer coat and the heavy undercoat shed all year long. In late spring and early fall the shedding is heavier to prepare for the new season. Frequent brushing helps. Frequent baths don't.",
      "cost": "Moderate",
      "capabilities": "These are principally companion dogs, though they can preform as excellent watchdogs.",
      "trainingTip": "Keeshods are responsive and easily trained.",
      "housebreaking": "No Problem",
      "aestheticQuality": "Foxlike face with heavy coat of northern dogs.",
      "personality": "These easy-to-live-with dogs can adapt to all life-styles. They get along well with children of all ages and they can handle city life well for an active dog. A reasonable amount of exercise is good for them."
    },
    {
      "name": "Lhasa Apso",
      "images": "dogs-195/78-lhasa-apso.jpg",
      "origin": "The Lhasa Apso is a non-sporting dog breed originating in Tibet. Traditionally the breed has been used as an interior watchdog.",
      "heightAtShoulder": {
        "males": "10-11",
        "females": "10-11 in."
      },
      "weight": {
        "males": "12-18",
        "females": "12-14 lbs."
      },
      "grooming": "The Lhasa Apso has a thick fur that sheds and needs grooming and daily brushing to keep it looking healthy.",
      "cost": "Very Expensive",
      "capabilities": "Playful, intelligent, assertive, steady, lively, alert, friendly, energetic, devoted, spirited, fearless, and obedient.",
      "trainingTip": "Lhasa Apsos are extremely bright and responsive.",
      "housebreaking": "This breed housebreaks with no problems.",
      "aestheticQuality": "Known for its long hair like coat.",
      "personality": "The Lhasa Apso is so happy and sweet natured, busy and active, that it is extremely easy to live with, exspecially in an apartment. Although very active in doors, it needs comparatively little outdoor exercise. They are really the size of a large toy dog, so they can't withstand rough treatment from young or active children."
    },
    {
      "name": "Lwchen",
      "images": "dogs-195/161-lowchen.jpg",
      "origin": "The Lwchen originated in Europe somewhere around the Middle ages. The Lwchen or Little Lion Dog is a breed of small dog. The Lwchen once had the dubious distinction, like the Portuguese Water Dog and the Havanese, of being the rarest dog in the world. In 1973 there were only 65 registered examples of the breed.",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "10-12 in."
      },
      "weight": {
        "males": "11-18",
        "females": "9-13 lbs."
      },
      "Grooming": "The Lwchen needs daily brushing and regular trips to a professional groomer. Some people grooms its fur like that of the Poodle.",
      "cost": "Very Expensive to aquire",
      "Capabilities": "Playful, intelligent, friendly, happy, active, and familial.",
      "Training Tip": "The Lwchen learns very fast and quick.",
      "Housebreaking": "No problems at all.",
      "Aesthetic quality": "Little Lion Dog",
      "Personality": "The Lwchen is a very active dog that loves to play and please his family. He is good for older kids, but with smaller kids he may be to active and demanding."
    },
    {
      "name": "Poodle",
      "images": "dogs-195/6-poodle.jpg",
      "origin": "The name Poodle comes from the German name Pudel or from Pudeln (to splash in water) and the Poodle itself evidently comes from Germany, though its history goes so far back that there are no conclusive records. The French Poodle is a misnomer, although the French do love the dog. They call it the Caniche (duck dog). The breed began as a standard Poodle, a water retriever of remarkable skill and intelligence. They are also famous as dancers and tricksters. The Poodle is always clipped, whether in a natural, even, sporting clip, or one of the fancy show clips, because his fur grows like human hair; it does not stop. Unclipped, the Poodle's coat is very difficult to manage. Poodles come in three varities - Toy, Miniature, and Standard. Only the Miniature and Standard varities are recommended for children.",
      "heightAtShoulder": {
        "males": "10-15",
        "females": "10-15 in."
      },
      "weight": {
        "males": "15-20",
        "females": "12-18 lbs."
      },
      "grooming": "There is almost no shedding, but the Poodle needs regular brushing and regular trips to a professional groomer for clipping.",
      "cost": "Moderate",
      "capabilities": "Some standard Poodles can be trained for guard work. All Poodles are good for watchdogs. Most of them love to swim. Standards can be trained to hunt fowl, and miniatures can be trained to do all kinds of tricks.",
      "trainingTip": "Poodles are extremely bright and responsive. They can learn just about anything they are taught.",
      "housebreaking": "No Problem",
      "aestheticQuality": "Sculpted, cosmopolitan, sophisticate, or rugged sporting dog depending on coat clip and life-style.",
      "personality": "Poodles win all popularity contests because they are extremely intelligent, cooperative, and sensitive to their owner's needs. Only a poorly bred Poodle shows any negative qualities. Miniatures need as much living space as standards because they are more active. Both varities need daily outdoor exercise. Standards are large, active dogs that could overwhelm a toddler. Now and then a miniature is to high-strung for a very small child. Both sizes are wonderful with older children."
    },
    {
      "name": "Schipperke",
      "images": "dogs-195/114-schipperke.jpg",
      "origin": "A Schipperke is a small breed of dog that is believed to have originated in the 1600s in Flanders. There has been a long informal debate over whether this type of dog is a spitz or miniature sheepdog. In their home country of Belgium they are considered a small shepherd.",
      "heightAtShoulder": {
        "males": "11-13",
        "females": "10-12 in."
      },
      "weight": {
        "males": "6-20",
        "females": "6-20 lbs."
      },
      "grooming": "The Schipperke has a thick fur that sheds and needs grooming and daily brushing to keep it looking healthy.",
      "cost": "Expensive",
      "capabilities": "Curious, faithful, agile, fearless, confident, and independent.",
      "trainingTip": "The Schipperke is very easy to train. There is no need to be loud or anything toward them when training. Give lots of praise and the use of a excited and upbeat voice is all that you need.",
      "housebreaking": "This breed housebreaks with no problems.",
      "aestheticQuality": "His Shepherd like looks.",
      "personality": "The Schipperke is so happy and sweet natured, busy and active, that it is extremely easy to live with, exspecially in an apartment. Although very active in doors it still likes to go outdoors and run around and chase toys with the kids or their owner."
    },
    {
      "name": "Shiba Inu",
      "images": "dogs-195/43-shiba-inu.jpg",
      "origin": "The Shiba Inu is a breed of hunting dog from Japan. A small-to-medium breed, it is the smallest of the six original dog breeds native to Japan. Its name literally translates to 'brushwood dog', as it is used to flush game.",
      "heightAtShoulder": {
        "males": "17-20",
        "females": "16-19 in."
      },
      "weight": {
        "males": "40-60",
        "females": "35-55 lbs."
      },
      "grooming": "The Shiba Inu have medium length hair. Its coat is red sesame, black & tan, black sesame, cream, red, or sesame and the underneath will be one of the other colors. There is shedding and it does need some grooming.",
      "cost": "Expensive",
      "capabilities": "Charming, keen, alert, fearless, confident, and faithful.",
      "trainingTip": "Training should be easy. They are very responsive and intelligent.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Their red-sesame coat and bushy tail.",
      "personality": "These active, strong dogs need a lot of exercise inside and out. Active children with a love for running and romping would be good for a Shiba Inu. This dog is probably too big and active for very young children. When buying a Shiba Inu for children be sure to go to a reputable breeder who can show you good steady bloodlines. The city is all right if the dog is exercised faithfully."
    },
    {
      "name": "Tibetan Spaniel",
      "images": "dogs-195/118-tibetan-spaniel.jpg",
      "origin": "The Tibetan Spaniel is a breed of assertive, small dogs originating in Tibet. This breed is not a spaniel in the original meaning of the term; its breeding differs from other spaniels, and unlike true spaniels, which are gun dogs, the Tibetan spaniel is a companion dog.",
      "heightAtShoulder": {
        "males": "10",
        "females": "10 in."
      },
      "weight": {
        "males": "9-15",
        "females": "9-15 lbs."
      },
      "grooming": "Needs daily brushing and some groomimg. The Tibetan Spaniel sheds a lot but with the brushing daily will help.",
      "cost": "Expensive",
      "capabilities": "Even though the Tibetan Spaniel is a little aloof he is great as a watch dog and alerting to strangers.",
      "trainingTip": "Tibetan Spaniels are responsive and easily trained.",
      "housebreaking": "This breed housebreaks with no problems.",
      "aestheticQuality": "Fluffy little dog.",
      "personality": "They are alert, independent, intelligent, and very loyal."
    },
    {
      "name": "Tibetan Terrier",
      "images": "dogs-195/99-tibetan-terrier.jpg",
      "origin": "The Tibetan Terrier is a medium-sized breed of dog that originated in Tibet. Despite its name, it is not a member of the terrier group. The breed was given its English name by European travelers due to its resemblance to known terrier breeds.",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "9-11 in."
      },
      "weight": {
        "males": "18-31",
        "females": "18-31 lbs."
      },
      "grooming": "The Tibetan Terrier has a long thick fur that sheds and needs grooming and daily brushing to keep it looking healthy.",
      "cost": "Expensive",
      "capabilities": "Amiable, sensitive, energetic, affectionate, reserved, and gentle.",
      "trainingTip": "Tibetan Terrier require a calm, firm, patient trainer. Because the dog can be excitable, praise him quietly and gently. Tibetan Terriers are reserved and very sensitive, but their desire to please their owners is so great that they overcome that innate resistance.",
      "housebreaking": "This breed housebreaks with no problems.",
      "aestheticQuality": "Known for its long fur coat.",
      "personality": "They are gentle, affectionate, intelligent, and energetic. They love children and playing as much as they want to play, also they will watch over them."
    }
  ]
},{
  "_id": {
    "$oid": "6709694175a514a448064b10"
  },
  "category": "sporting",
  "dogInfo": [
    {
      "name": "American Water Spaniel",
      "images": "dogs-195/158-american-water-spaniel.jpg",
      "origin": "The American Water Spaniel was developed in the United States around 1800's. The dog is especially helpful to pheasant and duck hunters. If flushes birds (forces them to fly out of their hiding place) so the hunter can shoot the birds. The dog then brings the dead bird back to the hunter.",
      "heightAtShoulder": {
        "males": "15-18",
        "females": "13-16 in."
      },
      "weight": {
        "males": "25-45",
        "females": "20-40 lbs."
      },
      "grooming": "The dog's thick curly coat protects it both from cold water and thorny bushes. Requires a lot of brushing and upkeep. He needs some expert trimming twice a year or so to maintain his healthy coat",
      "cost": "Expensive",
      "capabilities": "They're good hunters and guard dogs and also make a great pet.",
      "trainingTip": "They are bright, responsive animals. Because they are essentially hunting dogs, it is a good idea to begin early. Resist their irresistable expressions and demand obedience to all your commands. American Water Spaniels respond very poorly to physical abuse. Always avoid hitting, but especially with a American Water Spaniel.",
      "housebreaking": "Comparatively easy to housebreak.",
      "aestheticQuality": "Graceful dogs with lovable faces.",
      "personality": "The American Water Spaniel has a very mild manner and great to get along with. It aims to please its owner and loves to play around with the kids and it will protect them because they feel they are responsible for them."
    },
    {
      "name": "Brittany",
      "images": "dogs-195/28-brittany.jpg",
      "origin": "The 'French' spaniel is very popular at the field trials. Brittanies resemble Setters as much as Spaniels, but their tails are always short, like those of their fellow Spaniels. Unlike the other Spaniels, the Brittany is often born with a short tail. They were used to hunt Woodcock in western France long before records were kept.",
      "heightAtShoulder": {
        "males": "17-20",
        "females": "17-20 in."
      },
      "weight": {
        "males": "30-40",
        "females": "30-40 lbs."
      },
      "grooming": "These Spaniels shed a little. They need brushing regularly and trimming now and then.",
      "cost": "Moderate",
      "capabilities": "These hunters are warm, friendly companion dogs that can serve as watchdogs because they will bark at outside sounds and intruders. Although more assertive than the other Spaniels, they are not suitable for guard work.",
      "trainingTip": "Brittanies respond to obedience training a little more readily than some of the other hunting breeds, but they still need an early beginning, a firm hand, a consistent routine and a strong-willed trainer.",
      "housebreaking": "Housebreaking goes pretty wellconsidering this is a hunting dog, but begin early and be consistent.",
      "aestheticQuality": "Tall orange or brown and white spaniel.",
      "personality": "If given enough outdoor exercise, Brittanies do well in the city. They love children and play well with them, but they are large dogs and quite active even inside so would probably overwelm most toddlers. All Brittanies are affectionate, gentle, and outgoing. Occasionally one will become attached to one person in a family. So make sure everyone is involved with the dog's daily routine to avoid attachments."
    },
    {
      "name": "Chesapeake Bay Retriever",
      "images": "dogs-195/50-chesapeake-bay-retriever.jpg",
      "origin": "The Chesapeake Bay Retriever was developed in the United States around the 1800's, and trained to retrieve ducks that their owners have shot.",
      "heightAtShoulder": {
        "males": "23-26",
        "females": "22-25 in."
      },
      "weight": {
        "males": "65-80",
        "females": "60-75 lbs."
      },
      "grooming": "The Chesapeake Bay Retriever has a thick, oily coat that sheds water easily, so therefore their is not to much you can do with their coat except some brushing out and a little trimming.",
      "cost": "Moderate",
      "capabilities": "These hunters are warm, friendly companion dogs that can serve as watchdogs because they will bark at outside sounds and intruders. Although more assertive than the other Retrievers, they are not suitable for guard work.",
      "trainingTip": "They are fairly easy to train and they are very alert",
      "housebreaking": "Housebreaking goes pretty well considering this is a hunting dog, but begin early and be consistent.",
      "aestheticQuality": "The best of all Duck Retrievers",
      "personality": "Without training, the Chesapeake Bay Retriever can be much to playful for very young children because they have a lot of endurance. They are big dogs who like to romp and play with big kids. This is not a sedate dog. Chesapeake Bay Retriever love and need miles of outdoor exercise every day and come inside to be very active for the rest of the day. A country setting is best for them."
    },
    {
      "name": "Clumber Spaniel",
      "images": "dogs-195/135-clumber-spaniel.jpg",
      "origin": "The dukes of Newcastle lived in Clumber Park, Nottingham. As far back as the nineteenth century they bred an uncharacteristic spaniel from various dogs imported from France. These dogs are shaped like Spaniel cousins of the Basset Hound and have an excellent nose for finding game. They made their know appearance in America in 1883.",
      "heightAtShoulder": {
        "males": "16-19",
        "females": "16-19 in."
      },
      "weight": {
        "males": "55-65",
        "females": "35-50 lbs."
      },
      "grooming": "These Spaniels shed a little. They need regular brushing and trimming now and then.",
      "cost": "Expensive",
      "capabilities": "They're good hunters but don't look for a guard dog or a watchdog here.",
      "trainingTip": "Clumbers give leisurely responses. Just begin early, be patient and consistent and don't give up.",
      "housebreaking": "This chore goes pretty well, Stick to the schedule.",
      "aestheticQuality": "Heavyset, cartoonlike face.",
      "personality": "There is no need to hurry for a Clumber. Outdoor exercise is important but they would just as soon wait until tomorrow. Small apartments are fine despite their size because of their sedate temperament. A Clumber is affectionate and gentle and a tower of patience with toddlers and small children. He can become attached to one person, so encourage everyone in the family to relate to him every day. His style of play is very subtle. Clumbers need to be coaxed."
    },
    {
      "name": "Cocker Spaniel",
      "images": "dogs-195/30-cocker-spaniel.jpg",
      "origin": "The always popular ans easily recognizable Cocker (often called the American Cocker) is one of the smaller breeds of the ancient Spaniels. It takes its name from the Woodcock which it can find, flush, and retrieve so well. The breed was introduced in America in the 1880s. By the middle of the twentieth century, the Cocker Spaniel had become one of the most popular and prolific breeds in the country. After suffering some breeding problems as the result of indiscriminate mass production, the Cocker Spaniel is now regaining its deserved position as an ideal American dog.",
      "heightAtShoulder": {
        "males": "14-16",
        "females": "13-15 in."
      },
      "weight": {
        "males": "25-28",
        "females": "23-26 lbs."
      },
      "grooming": "Cocker Spaniels shed. They need regular brushing, and trimming by an expert.",
      "cost": "Moderate",
      "capabilities": "Cockers are not meant to be guard dogs, but they can make good watchdogs.",
      "trainingTip": "They are bright, responsive animals. Because they are essentially hunting dogs, it is a good idea to begin early. Resist their irresistable expressions and demand obedience to all your commands. Cockers respond very poorly to physical abuse. Always avoid hitting, but especially with a Cocker.",
      "housebreaking": "A good reason for sticking to the obedience training is because it helps the housebreaking. Hunting breeds, and the Cocker is a hunting breed, have lived outdoors in kennels for so many generations that controlling bodily functions for the indoor life can be a difficult task. Begin housebreaking early and stick to a schedule. Praise success. Admonish failure but without physical abuse, including rolled-up newspapers.",
      "aestheticQuality": "Sweet, small dog with big hanging ears and big gentle eyes.",
      "personality": "A well-bred Cocker can live happily in a city apartment, getting a fair amount of outside exercise and remaining even tempered and moderately active indoors. Cockers are gentle, cheerful and easily to get along with. They are wonderful companions for children of all ages. Just be sure to get a well-bred puppy. A large family would do well with a Cocker because the dog can give personal attention, love and play to each member."
    },
    {
      "name": "Curly-Coated Retriever",
      "images": "dogs-195/159-curly-coated-retriever.jpg",
      "origin": "The Curly-Coated Retriever is a dog trained to bring back game that has been shot. It gets its name from its black or liver-colored coat, which is a mass of thick, tight curls. The Curly-Coated Retriever originated in England around the 1800's.",
      "heightAtShoulder": {
        "males": "26",
        "females": "25 in."
      },
      "weight": {
        "males": "50-80",
        "females": "45-75 lbs."
      },
      "grooming": "The Curly-Coated Retriever requires a lot of brushing and upkeep. He needs some expert trimming twice a year or so to maintain his healthy coat",
      "cost": "Expensive",
      "capabilities": "They're good hunters and guard dogs and also make a great pet.",
      "trainingTip": "The Curly-Coated Retriever is easy to train.",
      "housebreaking": "Very easy",
      "aestheticQuality": "Its liver-colored coat",
      "personality": "The Curly-Coated Retriever has a very mild manner and great to get along with. It aims to please its owner and loves to play around with the kids and it will protect them because they feel they are responsible for them."
    },
    {
      "name": "English Cocker Spaniel;",
      "images": "dogs-195/47-english-cocker-spaniel.jpg",
      "origin": "The English Cocker Spaniel is slightly larger than the American Cocker and is closely related to the English Springer Spaniel. The English began to breed Spaniels seperately by size in the late nineteenth century, but they all retain that splendid, engaging spaniel personality.",
      "heightAtShoulder": {
        "males": "16-17",
        "females": "15-16 in."
      },
      "weight": {
        "males": "28-34",
        "females": "26-32 lbs."
      },
      "grooming": "English Cockers shed. They need regular brushing, and expert trimming.",
      "cost": "Moderate",
      "capabilities": "Anyone should be able to get along with an English Cocker, including an intruder. However, they will bark at strange noises or when someone comes to the door, making them effective watchdogs.",
      "trainingTip": "This breed trains rather easily, especially for a hunting breed. They are responsive and willing to please if the trainer is consistent and firm.",
      "housebreaking": "Patience may be required. Stick to rigid schedules, begin early, praise successes, scold but never hit for failures.",
      "aestheticQuality": "Long, hanging ears and graceful sporting lines.",
      "personality": "Marvelous, adaptive English Cockers can do well in the country and the city with some outdoor exercise. They are moderately active indoors, certainly active enough to show a house full of children a good time. English Cockers are well suited to all ages. They are so adaptive and loving that any child flourishes in their presence."
    },
    {
      "name": "English Setter",
      "images": "dogs-195/101-english-setter.jpg",
      "origin": "Bird dogs have been very important to the English hunter throughout their history. Four hundred years ago the English Setter was breed from various Spaniels, including the Spanish Pointer. In addition to its superb skill in the field, the English Setter has an extraordinary beauty. Though it is seen in solid colors or a solid color and white, it is most recognizable in its 'belton' coat(white with flecks or freckles of the darker color).",
      "heightAtShoulder": {
        "males": "25",
        "females": "24 in."
      },
      "weight": {
        "males": "60-70",
        "females": "50-60 lbs."
      },
      "grooming": "The Setter's flat, straight coat needs expert trimming now and then. Frequent brushing keeps them in good condition. There is some shedding.",
      "cost": "Moderate",
      "capabilities": "The English Setter's greatest trait is patience. They have an easy going, laid-back quality not suited to guard work, though they can sometimes function as watchdog.",
      "trainingTip": "In training, the English Setter's patience can become stubborn resistance. Try coaxing, insistence and ecstatic praise. Never get tough with an English Setter. It doesn't work. Begin early and always be firm and consistent.",
      "housebreaking": "Setters are not easy to housebreak. Begin early, stick closely to the schedule, and always praise the successes. Admonish the failures but don't use physical punishment. Begin immediately with house breaking and skip paper training. The transition from one to the other adds to the confusion.",
      "aestheticQuality": "Magnificent form and grace on point or in motion - coat color, pattern and texture glorious.",
      "personality": "Affectionate, loving, gentle English Setters are quiet and relaxed inside but require long vigorous runs outside everyday. They also require undying love and devotion from every memeber of the family. They can be remarkably patient with toddlers and young children or they can give big kids a run for their money. Adjustment to apartment life is quite good."
    },
    {
      "name": "English Springer Spaniel",
      "images": "dogs-195/26-english-springer-spaniel.jpg",
      "origin": "These Spaniels are named for their ability to 'spring' the birds from cover, forcing them to fly up. The smaller Cockers flush Woodcock, a low-flying bird. Springers and Cockers are considered land Spaniels, though they can retrieve from the water if needed.",
      "heightAtShoulder": {
        "males": "20",
        "females": "19 in."
      },
      "weight": {
        "males": "49-55",
        "females": "46-50 lbs."
      },
      "grooming": "English Springers shed. They need regular brushing, and expert trimming.",
      "cost": "Moderate",
      "capabilities": "Springers can serve as watchdogs but not guard dogs. They are expert hunters and companions.",
      "trainingTip": "English Springers respond well for a hunting breed. They are eager to please and responsive. Take advantage and give them a good, consistent, early obedience course.",
      "housebreaking": "Typical hunting dog difficulties with housebreaking occur in this breed, too. A conscientious obedience course can help. Begin the housebreaking early and stick to a schedule.",
      "aestheticQuality": "Long, hanging ears and graceful sporting lines.",
      "personality": "These are good city or country dogs. They are active and need exercise, the kind a group of children can give them. Though they are larger than other Spaniels, the English Springer Spaniels are among the best dogs for kids because of their ability to relate to them and their easygoing temperament, easygoing Springers are usually gentle with toddlers and playful with older children. Like all Spaniels they love retrieving games with balls and sticks."
    },
    {
      "name": "Field Spaniel",
      "images": "dogs-195/160-field-spaniel.jpg",
      "origin": "The Field Spaniel is a medium-sized dog breed of spaniel type. They were originally developed to be all-black show dogs in the late 19th and early 20th centuries and were unpopular for work as a hunting dog.",
      "heightAtShoulder": {
        "males": "17-18",
        "females": "17-18 in."
      },
      "weight": {
        "males": "33-44",
        "females": "33-44 lbs."
      },
      "Grooming": "The Field Spaniel does shed. They need regular brushing, and expert trimming.",
      "cost": "Very Expensive",
      "Capabilities": "Sensitive, docile, cautious, sociable, adaptable, familial.",
      "Training Tip": "The Field Spaniel learns fast and wants to please their owner. They do not respond well to harsh treatment at all; it can make them shy and shut down. They are a vary sensitive dog that responds best to a lots of praise and encouragement.",
      "Housebreaking": "Stick to a regular schedule and be consistent, encourage victories and not to rough or harsh on the mishaps.",
      "Aesthetic quality": "Its long and bushy undergrowth and fluffy ears.",
      "Personality": "The Field Spaniel loves his family and loves playing with kids. He can't take to much rough treatment from young children if he thinks they are being to mean or aggresive because of him being so sensitive and cautious. He is a very socialable dog who looks for love from everybody."
    },
    {
      "name": "Flat-Coated Retriever",
      "images": "dogs-195/102-flat-coated-retriever.jpg",
      "origin": "The Flat-Coated Retriever is a breed of medium-sized dog often used for hunting, flushing, and retrieving game from land and water.",
      "heightAtShoulder": {
        "males": "22-24",
        "females": "22-24 in."
      },
      "weight": {
        "males": "60-75",
        "females": "60-75 lbs."
      },
      "grooming": "The Flat-Coated Retriever requires a lot of brushing and upkeep. He needs some expert trimming twice a year or so to maintain his healthy coat",
      "cost": "Expensive",
      "capabilities": "Anyone should be able to get along with an Flat-Coated Retriever, including an intruder. However, they will bark at strange noises or when someone comes to the door, making them effective watchdogs.",
      "trainingTip": "The Flat-Coated Retriever is easy to train.",
      "housebreaking": "This chore goes pretty well, stick to the schedule.",
      "aestheticQuality": "Shining, breathtaking, black coat.",
      "personality": "The Flat-Coated Retriever has a very mild manner and great to get along with. It aims to please its owner and loves to play around with the kids and it will protect them because they feel they are responsible for them."
    },
    {
      "name": "German Short-haired Pointer",
      "images": "dogs-195/9-german-short-haired-pointer.jpg",
      "origin": "The history of hunting dogs goes back long before written records were kept. In nineteenth-century Germany, hunters and breeders wanted to combine the separate abilities of the different hunting breeds - pointing, trailing, retrieving on land and water, keen scenting, hardy endurance - into one beautifully formed dog. After years and generations of work they acheived the German Shorthaired Pointer. This breed is popular among nonhunters as well because German Shorthairs are particularly intelligent, loyal and loving.",
      "heightAtShoulder": {
        "males": "23-25",
        "females": "21-23 in."
      },
      "weight": {
        "males": "55-70",
        "females": "45-60 lbs."
      },
      "grooming": "There is some shedding but the coat is very short. A brushing now and then is good for the coat.",
      "cost": "Moderate",
      "capabilities": "German Shorthairs make wonderful watch dogs because they will bark at any strange sound. The German Shorthair is too gentle by nature for guard work. (A good guard dog must attack if needed.)",
      "trainingTip": "Start early. As loving and loyal as this breed is, remember this is a hunting dog. German Shorthairs need a very firm, strong, consistent hand from a very early age. They can be very strong willed and stubborn without it.",
      "housebreaking": "A breed so used to the outdoor life is more difficult to housebreak. Begin early, be firm, stick to a very rigid schedule, and don't be surprised over the years when mistakes happen. Get right back to the strict schedule and firm attitude.",
      "aestheticQuality": "Brown and White athlete",
      "personality": "Older children can appreciate the German Shorthair's friendship and faithfulness. They can also go on long, long daily walks and runs necessary to keep this breed in even temper and good physical shape. Younger children would be overwhelmed. German Shorthaire need a lot of companionship. They hate to be left alone. Without enough exercise and company they can be destructive, chewing everything in reach and barking and howling until relief comes. City living is usually to confined for such an active hunting breed. Even with outdoor exercise the German Shorthair remains very active indoors. Many teenagers feel exactly the same way and enjoy playing chase and race with this handsome canine."
    },
    {
      "name": "German Wire-haired Pointer",
      "images": "dogs-195/60-german-wire-haired-pointer.jpg",
      "origin": "The history of hunting dogs goes back long before written records were kept. In nineteenth-century Germany, hunters and breeders wanted to combine the separate abilities of the different hunting breeds - pointing, trailing, retrieving on land and water, keen scenting, hardy endurance - into one beautifully formed dog. After years and generations of work they acheived the German Wirehaired Pointer. This breed is popular among nonhunters as well because German Wirehaired Pointers are particularly intelligent, loyal and loving.",
      "heightAtShoulder": {
        "males": "23-25",
        "females": "21-23 in."
      },
      "weight": {
        "males": "55-70",
        "females": "45-60 lbs."
      },
      "grooming": "There is some shedding. A brushing now and then is good for the coat.",
      "cost": "Moderate",
      "capabilities": "German Wirehaired Pointers make wonderful watch dogs because they will bark at any strange sound. The German Wirehaired Pointer is too gentle by nature for guard work. (A good guard dog must attack if needed.)",
      "trainingTip": "Start early. As loving and loyal as this breed is, remember this is a hunting dog. German Wirehaired Pointers need a very firm, strong, consistent hand from a very early age. They can be very strong willed and stubborn without it.",
      "housebreaking": "A breed so used to the outdoor life is more difficult to housebreak. Begin early, be firm, stick to a very rigid schedule, and don't be surprised over the years when mistakes happen. Get right back to the strict schedule and firm attitude.",
      "aestheticQuality": "Brown and White athlete",
      "personality": "Older children can appreciate the German Wirehaired Pointers friendship and faithfulness. They can also go on long, long daily walks and runs necessary to keep this breed in even temper and good physical shape. Younger children would be overwhelmed. German Wirehaired Pointers need a lot of companionship. They hate to be left alone. Without enough exercise and company they can be destructive, chewing everything in reach and barking and howling until relief comes. City living is usually to confined for such an active hunting breed. Even with outdoor exercise the German Wirehaired Pointer remains very active indoors. Many teenagers feel exactly the same way and enjoy playing chase and race with this handsome canine."
    },
    {
      "name": "Golden Retriever",
      "images": "dogs-195/4-golden-retriever.jpg",
      "origin": "Goldens are breed like the other retrievers in the nineteenth century. but the golden was bred by Lord Tweedmouth's gamekeepers on his Scottish estate called Guisachan. A male yellow retriever named Nous was mated to a Tweed water spaniel named Belle in 1867 or 1868. From that romantic setting comes our present day Golden Retriever.",
      "heightAtShoulder": {
        "males": "23-24",
        "females": "21-23 in."
      },
      "weight": {
        "males": "65-75",
        "females": "60-70 lbs."
      },
      "grooming": "This beautiful, slightly wavey fur does shed. Regular brushing will help.",
      "cost": "Expensive",
      "capabilities": "The Golden is so easy going and gentle that guarding is simply not in it's nature. On the other hand a Golden can be a totally trustworthy companion for a child. They often serve as dog guides for the blind or service dogs for the inpaired.",
      "trainingTip": "This is an extremely responsive breed. Training seems very easy because they are so willing to please. But these are hunting dogs whose minds can wander. Give the commands and praise in a calm voice and be sure each command is obeyed properly.",
      "housebreaking": "Retrievers are comparatively easy to housebreak.",
      "aestheticQuality": "Honey-colored, graceful dogs with lovable faces.",
      "personality": "Goldens love everyone, understand everything. They are intelligent, dignified, considerate and perfect6 for young children, toddlers, babies, and of course older children. That is not to say they are boring. If the child wants to play ball or run or just be silly, the Golden can do that too. They can adjust to almost any life-style in the city or the country, but they deserve to get some daily exercise and a swim every now and then."
    },
    {
      "name": "Gordon Setter",
      "images": "dogs-195/107-gordon-setter.jpg",
      "origin": "In the late eighteenth century, the Duke of Gordon gave his name to the already exsisting black and mahogany Setter. The Duke developed the breed to locate birds in the field at his castle in Scotland. In the middle of the nineteenth century, the Gordon Setter brought its expertise to America.",
      "heightAtShoulder": {
        "males": "24-27",
        "females": "23-26 in."
      },
      "weight": {
        "males": "55-80",
        "females": "45-70 lbs."
      },
      "grooming": "The Setter's flat, straight coat needs expert trimming. There is some shedding. Regular brushing helps",
      "cost": "Moderate",
      "capabilities": "Unlike the other Setters, The Gordon can be trained to guard. They have a more protected nature than the English or the Irish but they retain the Setter's love of children.",
      "trainingTip": "Begin early and be very firm. The Gordon is stubborn. Habits once established are difficult to break.",
      "housebreaking": "Try not to paper train a Gordon. The transition to housebreaking is confusing for them. They have the typical Setter difficulty with housebreaking. Stick to rigid schedules and begin early.",
      "aestheticQuality": "Strength and great dignity in a black and tan coat.",
      "personality": "Gordons are hunting dogs and usually do best in the country. With long outdoor runs they can settle down when they come inside. Like the other Setters, the Gordon likes a lot of attention from its family and in return takes excellent care of all the children from infancy to adulthood."
    },
    {
      "name": "Irish Setter",
      "images": "dogs-195/75-irish-setter.jpg",
      "origin": "This easily recognized Irishman was created at the beginning of the eighteenth century in Ireland, of course. It was red and white then and still is inn Ireland. It is breed strictly for that solid, mahogany-red color in America only.",
      "heightAtShoulder": {
        "males": "27",
        "females": "25 in."
      },
      "weight": {
        "males": "70",
        "females": "60 lbs."
      },
      "grooming": "The flat, straight Setter coat needs expert trimming now and then. There is some shedding. Regular brushing keeps the dog in good condition.",
      "cost": "Expensive",
      "capabilities": "In addition to their hunting talents Irish Setters are good entertainers. They are very playful and like to clown around. Guard work is out of the question, but some Irish Setters are good watchdogs.",
      "trainingTip": "Begin early and be very firm. The Irish Setter shows that typical Setter stubborness.",
      "housebreaking": "The Irish Setter, like his fellow Setters, require strict housebreaking schedules. Begin with housebreaking as early as possible. Skip paper training. It causes confusion. Be firm, consistent, and diligent.",
      "aestheticQuality": "Shining, breathtaking, chestnut red coat.",
      "personality": "Without training the Irish Setter can be much to playful for very young children. They are big dogs who like to romp and play with big kids. This is not a sedate dog. Irish Setters love and need miles of outdoor exercise every day and come inside to be very active for the rest of the day. A country setting is best for them."
    },
    {
      "name": "Irish Water Spaniel",
      "images": "dogs-195/174-irish-water-spaniel.jpg",
      "origin": "This breed began in Ireland as a water retriever.",
      "heightAtShoulder": {
        "males": "22-23",
        "females": "22-23 in."
      },
      "weight": {
        "males": "55-65",
        "females": "55-65 lbs."
      },
      "grooming": "The Irish Water Spaniel has a liver-colored, dense, short, curly-coat that sheds very little; however, this coat should be trimmed once a week.",
      "cost": "Very Expensive",
      "capabilities": "The Irish Water Spaniel can be protective, stubborn, and timid, and tends to be a one-person dog, though as long as he is well socialized, he should not have any problems with other family members, children, or strange dogs.",
      "trainingTip": "Begin early and be very firm. The Irish Water Spaniel is stubborn. Habits once established are difficult to break.",
      "housebreaking": "Begin early and stick to the schedule. Some Irish Water Spaniel make a mistake now and then and some don't.",
      "aestheticQuality": "Its liver-colored coat.",
      "personality": "Without training the Irish Water Spaniel can be much to playful for very young children. They are medium-sized dogs who like to romp and play with big kids. This is not a sedate dog. Irish Water Spaniels love and need miles of outdoor exercise every day and come inside to be very active for the rest of the day. A country setting is best for them."
    },
    {
      "name": "Labrador Retriever",
      "images": "dogs-195/1-labrador-retriever.jpg",
      "origin": "Like the other retrievers, the Labrador comes from Newfoundland. However, it was not crossed as often to the hunting dogs of England. In the mid nineteenth century the Earl of Malmesbury and the Duke of Buccleuch each sponsered the breeding of pure Labradors in England. The real mystery is how Labrador Retrievers came to Newfoundland. They must have arrived by ship, since there were apparently no native dogs on the American continent. But such records were never kept. If not for the English we would not have these magnificent dogs. They all but disappeared in Newfoundland when a dog tax was imposed.",
      "heightAtShoulder": {
        "males": "22-24",
        "females": "21-23 in."
      },
      "weight": {
        "males": "60-75",
        "females": "55-70 lbs."
      },
      "grooming": "This shiny, short, close-lying, black, yellow, or chocolate(red rust color) coat sheds a little but not excessively. Brushing is helpful. Retrievers love water, so baths can be fun.",
      "cost": "Moderate",
      "capabilities": "Labradors are amazingly versatile dogs. Of course they can hunt and retrieve but they also make good guard dogs and watchdogs while remaining gentle and trustworthy with children. Many Labs have been trained as guides for the blind, service dogs for the impaired, and also for bomb detection for our Military and various police forces.",
      "trainingTip": "Training such an intelligent animal is easy providing the trainer stays in charge. The Labrador's intelligence can make him mischievous if he is not controlled. Demand a lot from a breed with so much potential, and begin early. Give them generous praise.",
      "housebreaking": "Begin early and stick to the schedule. Some Labradors make a mistake now and then and some don't.",
      "aestheticQuality": "Staunch, powerful dignity",
      "personality": "Labs are as intelligent, devoted, reliable, and even-tempered as a dog can be. They are active indoors and need to run outdoors and they can adjust to city life well. They are large, assertive dogs that relate very well to toddlers and young children as well as older children. They love to 'retrieve' balls and sticks and are expert swimmers. After all, they worked for the fishermen in their Newfoundland days."
    },
    {
      "name": "Nova Scotia Duck Tolling Retriever",
      "images": "dogs-195/90-nova-scotia-duck-tolling-retriever.jpg",
      "origin": "The Nova Scotia Duck Tolling Retriever is a medium-sized gundog bred primarily for hunting. It is often referred to as a 'toller'. It is the smallest of the retrievers, and is often mistaken for a small Golden Retriever. Tollers are intelligent, eager to please, alert, and energetic.",
      "heightAtShoulder": {
        "males": "18-21",
        "females": "17-20 in."
      },
      "weight": {
        "males": "44-51",
        "females": "37-44 lbs."
      },
      "Grooming": "The Nova Scotia Duck Tolling Retriever does shed. They need regular brushing, and expert trimming.",
      "cost": "Very Expensive",
      "Capabilities": "Intelligent, outgoing, alert, patient, and loving.",
      "Training Tip": "The Nova Scotia Duck Tolling Retriever learns fast and wants to please their owner. They do not respond well to harsh treatment at all; it can make them shy and shut down. They are a vary patient dog that responds best to a lots of praise and encouragement.",
      "Housebreaking": "Stick to a regular schedule and be consistent, encourage victories and not to rough or harsh on the mishaps.",
      "Aesthetic quality": "Its red-golden coat.",
      "Personality": "The Nova Scotia Duck Tolling Retriever loves his family and loves playing with kids. He can't take to much rough treatment from young children if he thinks they are being to mean or aggresive because of him being so sensitive and cautious. He is a very socialable dog who looks for love from everybody."
    },
    {
      "name": "Pointer",
      "images": "dogs-195/116-pointer.jpg",
      "origin": "The Pointer, sometimes called the English Pointer, is a medium-sized breed of pointing dog developed in England.",
      "heightAtShoulder": {
        "males": "22-28",
        "females": "21-26 in."
      },
      "weight": {
        "males": "40-75",
        "females": "35-66 lbs."
      },
      "grooming": "There is some shedding. A brushing now and then is good for the coat.",
      "cost": "Very Expensive",
      "capabilities": "Even tempered, kind, amiable, loyal, affectionate, and active.",
      "trainingTip": "They are fairly easy to train and they are very alert",
      "housebreaking": "Comparatively easy to housebreak.",
      "aestheticQuality": "Grayish-colored, graceful dogs with lovable faces.",
      "personality": "These dogs are bright and develop very personal relationships with each member of the family. They are wonderful for older active children who have the time and energy to give them long, daily runs and lots of active personal attention. Pointers are very active indoors as well, so they are not well suited to a sedentary household or the city living. Small children usually find the Pointer too large and active to play with comfortably."
    },
    {
      "name": "Sussex Spaniel",
      "images": "dogs-195/172-sussex-spaniel.jpg",
      "origin": "The Sussex Spaniel is a breed of dog native to Sussex in southern England. It is a low, compact spaniel and is as old a breed as and similar in appearance to the Clumber Spaniel. They can be slow-paced, but can have a clownish and energetic temperament.",
      "heightAtShoulder": {
        "males": "15-16",
        "females": "15-16 in."
      },
      "weight": {
        "males": "35-44",
        "females": "35-44 lbs."
      },
      "grooming": "The Sussex Spaniel requires a lot of brushing and upkeep. He needs some expert trimming twice a year or so to maintain his healthy coat",
      "cost": "Very Expensive",
      "capabilities": "The Sussex Spaniel is so easy going and gentle that guarding is simply not in it's nature. On the other hand a Golden can be a totally trustworthy companion for a child.",
      "trainingTip": "They are bright, responsive animals. Because they are essentially hunting dogs, it is a good idea to begin early. Resist their irresistable expressions and demand obedience to all your commands. Sussex Spaniels respond very poorly to physical abuse. Always avoid hitting, but especially with a Sussex Spaniel.",
      "housebreaking": "Begin early and stick to the schedule. Some Sussex Spaniel Spaniel make a mistake now and then and some don't.",
      "aestheticQuality": "Heavyset, cartoonlike face with big ears.",
      "personality": "There is no need to hurry for a Sussex Spaniel. Outdoor exercise is important but they would just as soon wait until tomorrow. Small apartments are fine despite their size because of their sedate temperament. A Sussex Spaniel is affectionate and gentle and a tower of patience with toddlers and small children. He can become attached to one person, so encourage everyone in the family to relate to him every day. His style of play is very subtle. Sussex Spaniels need to be coaxed."
    },
    {
      "name": "Vizsla",
      "images": "dogs-195/35-vizsla.jpg",
      "origin": "The Vizsla, also known as Hungarian Vizsla, Magyar Vizsla or Hungarian Pointer, is a dog breed from Hungary and belongs to the Fdration Cynologique Internationale group 7, the Canadian Kennel Club group 1, and the American Kennel Club.",
      "heightAtShoulder": {
        "males": "22-26",
        "females": "21-25 in."
      },
      "weight": {
        "males": "44-64",
        "females": "40-55 lbs."
      },
      "grooming": "The Vizsla sheds hardly any at all. It does help to brush his coat once in a while to maintain his healthy look.",
      "cost": "Expensive",
      "capabilities": "The Vizsla is very affectionate, gentle, and loyal.",
      "trainingTip": "The Vizsla is easy to train.",
      "housebreaking": "There should be no problems at all.",
      "aestheticQuality": "Its golden-colored coat.",
      "personality": "Affectionate, loving, gentle Vizslas are quiet and relaxed inside but require long vigorous runs outside everyday. They also require undying love and devotion from every memeber of the family. They can be remarkably patient with toddlers and young children or they can give big kids a run for their money. Adjustment to apartment life is quite good."
    },
    {
      "name": "Weimaraner",
      "images": "dogs-195/39-weimaraner.jpg",
      "origin": "This is another magnificent German hunting dog created by dedicated breeders in the nineteenth century. The Weimaraner, named for the court at Weimar, was bred to hunt large game such as wolf, bear, deer, and wildcat. There is no large game to hunt in Germany now, and little elsewhere for that matter, so the Weimaraner has been adapted to bird hunting, which suits the breed equally well.",
      "heightAtShoulder": {
        "males": "25-27",
        "females": "23-25 in."
      },
      "weight": {
        "males": "70-85",
        "females": "55-70 lbs."
      },
      "grooming": "There is some shedding but the coat is short. Periodic brushing is good for the dog's coat.",
      "cost": "Moderate",
      "capabilities": "Weimaraner make wonderful watchdogs. They will sound the alarm at any unfamiliar noise. May of them can be trained to guard and attack, but such training requires an expert. These dogs do not guard naturally, and if trained to do so need constant supervision.",
      "trainingTip": "Begin early, very early; be firm; be consistent; never waver. These are hunting dogs who have been breed to follow their own instincts, not those of their owners. Unless their owner wants them to track a Mountain Lion or bring a wild pheasant home for dinner, there may be a conflict of intrests. Teach this breed, from the beginning, that the owner makes all of the decisions and must be obeyed every time.",
      "housebreaking": "Hunting breeds accustomed to outdoor living are much more difficult to housebreak. Weimaraner must begin early, be given rigid schedules, and be corrected firmly.",
      "aestheticQuality": "Sleek, iridescent gray hunter.",
      "personality": "These dogs are bright and develop very personal relationships with each member of the family. They are wonderful for older active children who have the time and energy to give them long, daily runs and lots of active personal attention. Weimaraners are very active indoors as well, so they are not well suited to a sedentary household or the city living. Small children usually find the Weimaraner too large and active to play with comfortably."
    },
    {
      "name": "Welsh Springer Spaniel",
      "images": "dogs-195/128-welsh-springer-spaniel.jpg",
      "origin": "The Welsh Springer Spaniel is a breed of dog and a member of the spaniel family. Thought to be comparable to the old Land Spaniel, they are similar to the English Springer Spaniel and historically have been referred to as both the Welsh Spaniel and the Welsh Cocker Spaniel.",
      "heightAtShoulder": {
        "males": "18-19",
        "females": "17-18 in."
      },
      "weight": {
        "males": "40-55",
        "females": "35-44 lbs."
      },
      "grooming": "The Welsh Springer Spaniel requires a lot of brushing and upkeep. He needs some expert trimming twice a year or so to maintain his healthy coat",
      "cost": "Expensive",
      "capabilities": "The Welsh Springer Spaniel is affectionate, friendly, active, stubborn, loyal, and playful.",
      "trainingTip": "Begin early and be very firm. The Welsh Springer Spaniel is stubborn. Habits once established are difficult to break.",
      "housebreaking": "Begin early and stick to the schedule. Some Welsh Springer Spaniels make a mistake now and then and some don't.",
      "aestheticQuality": "His red-and-white coat",
      "personality": "Without training the Welsh Springer Spaniels can be much to playful for very young children. They are medium-sized dogs who like to romp and play with big kids. This is not a sedate dog. Welsh Springer Spaniels love and need miles of outdoor exercise every day and come inside to be very active for the rest of the day. A country setting is best for them."
    },
    {
      "name": "Wire-haired Pointing Griffon",
      "images": "dogs-195/63-wire-haired-pointing-griffon.jpg",
      "origin": "The Wirehaired Pointing Griffon is a breed of dog used in hunting as a gundog. It is sometimes considered to be Dutch in ancestry, due to the nationality of the breed founder, Eduard Karel Korthals.",
      "heightAtShoulder": {
        "males": "18-19",
        "females": "17-18 in."
      },
      "weight": {
        "males": "45-55",
        "females": "35-45 lbs."
      },
      "grooming": "The Wirehaired Pointing Griffon requires a lot of brushing and upkeep. He needs some expert trimming twice a year or so to maintain his healthy coat",
      "cost": "Very Expensive",
      "capabilities": "The Wirehaired Pointing Griffon is a proud, loyal, vigilant, gentle, and trainable breed of dog.",
      "trainingTip": "This is an extremely responsive breed. Training seems very easy because they are so willing to please. But these are hunting dogs whose minds can wander. Give the commands and praise in a calm voice and be sure each command is obeyed properly.",
      "housebreaking": "Comparatively easy to housebreak.",
      "aestheticQuality": "Its Grey-brown, liver, orange-white, white-chocolate, grey-tan, and chestnut colored coat.",
      "personality": "Wirehaired Pointing Griffons love everyone, understand everything. They are intelligent, dignified, considerate and perfect for young children, toddlers, babies, and of course older children. That is not to say they are boring. If the child wants to play ball or run or just be silly, the Wirehaired Pointing Griffon can do that too. They can adjust to almost any life-style in the city or the country, but they deserve to get some daily exercise and a swim every now and then."
    }
  ]
},{
  "_id": {
    "$oid": "6709694a75a514a448064b11"
  },
  "category": "terrier",
  "dogInfo": [
    {
      "name": "Airedale",
      "images": "dogs-195/62-airedale-terrier.jpg",
      "origin": "The old English Terriers were breed to hunt Fox, rats, weasels, and other nuisance rodents in the English countryside. In the early nineteenth century these old Terriers were bred with the popular Otter Hound to combine the superior eyesight and hearing of the Terrier and the superior scernting ability of the Otter Hound all in one hardy, courageous dog. The cross was so successful that the resulting Airedale (named for the Aire River Valley) was shown in its own competition in 1879 at the Airedale Agricultural Society Show. The breed has flourished ever since because Airedales can adjust to so many various life-styles. They are the largest of the Terriers and perhaps more restrained than some of their cousins.",
      "heightAtShoulder": {
        "males": "23",
        "females": "22 in."
      },
      "weight": {
        "males": "50-60",
        "females": "45-55 lbs."
      },
      "grooming": "The rough, wiry quality of the Terrier coat needs very little care. The softer undercoat will periodically loosen to make way for new growth. Those with the time and patience should hand plunk out the loose, dead undercoat by pulling the tufts between the thumb and forefinger. However, those with a busier schedule can take the dog to a professional groomer to be trimmed and clipped. Except for the loosened undercoat, which stays on the body till plucked, there is very little shedding. Regular brushing is good.",
      "cost": "Moderate",
      "capabilities": "The tenacious quality needed to hunt rats and the loyal Hound spirit have made the Airedale an excellent guard dog. These dogs have been used by the Military and Police because they will execute their commands even when wounded. Of course Airedales are courageous, indefatigable hunters and trusted companions.",
      "trainingTip": "When Airedales are trained as young puppies, they learn quickly, easily, and willingly. They accept human dominance at this early age, which is important. If allowed to go untrained, an Airedale can become stubborn and difficult to control. This strong, independent spirit always needs a firm, decisive trainer.",
      "housebreaking": "Well-taught puppies become well-housebroken dogs.",
      "aestheticQuality": "Dominant, alert dignity.",
      "personality": "Older children have a great time with Airedales. They can run and jump and wrestle endlessly. But fifty pounds of boundless joy is too much for younger children. Airedales like to run and play a lot inside and outside until a stranger comes along, then they become aloof and distant. Airedales are territorial and may fight with strange dogs and therefore require early obedience training. They are usually polite to outsiders, both people and dogs, unless attacked. If they or their families are attacked, they are fearless. Despite the high energy level, the breed adapts to the city life-style well."
    },
    {
      "name": "American Staffordshire",
      "images": "dogs-195/82-american-staffordshire-terrier.jpg",
      "origin": "The American Staffordshire is a breed of dog that originated in the United States. It descended from the Staffordshire Bull Terrier, a breed brought from England in the late 1800's. By the early 1900's, American breeders had developed a dog taller and heavier than its British ancestors. The American Staffordshire Terrier has been called Yankee Terrier and Pitbull. It was once used in vicious dog fights in pits. The dog is still popularly called Pitbull.",
      "heightAtShoulder": {
        "males": "17-19",
        "females": "15-17 in."
      },
      "weight": {
        "males": "45-65",
        "females": "40-60 lbs."
      },
      "grooming": "The care of a American Staffordshire is easy. They have the rough outer Terrier coat and the soft undercoat. Regular brushing is good.",
      "cost": "Expensive",
      "capabilities": "American Staffordshires make good watchdogs and guarddogs. They are small for guarding but they make excellent guarddogs and protecting what is theirs and their families.",
      "trainingTip": "These are responsive dogs, exspecially for a Terrier. They do not respond well to harsh treatment: it could make them aggresive. Give them praise and encouragement and be consistent.",
      "housebreaking": "Like most Terriers, this one should not have housebreaking problems.",
      "aestheticQuality": "Scrappy, little tough guy.",
      "personality": "American Staffordshire are calm for Terriers while still maintaining the Terrier personality, which makes them idea for children, young and old. American Staffordshire do not like to sit around, though. They are very active dogs inside as well as outside. City life is fine as long as they get enough exercise and if they are introduced to the noise and hubbub as puppies. These dogs have a very negative reputation but they are fun, compasionate, loyal, loving dog who aims to please."
    },
    {
      "name": "Australian Terrier",
      "images": "dogs-195/134-australian-terrier.jpg",
      "origin": "The Australian Terrier is a small dog once used to guard mines and tend sheep in Australia. Now people keep these Terriers chiefly as pets. The breed originated in Australia about 1885.",
      "heightAtShoulder": {
        "males": "12-14",
        "females": "10-12 in."
      },
      "weight": {
        "males": "12-14",
        "females": "10-12 lbs."
      },
      "grooming": "The care of a Australian Terrier is easy. They have the rough outer Terrier coat and the soft undercoat. Now and then that undercoat needs to be plucked (the loose hair pulled out witht the thumb and forefinger). Regular brushing is good.",
      "cost": "Moderate",
      "capabilities": "They will warn of strangers at the door. They are small and unsuited to actual guard work, contrary to what they may think. A Australian Terrier's self-image is quite sound.",
      "trainingTip": "Australian Terrier are and can be stubborn and sometimes aggressive. So begin early and be patient. Be firm and be consistent; don't let them get away without obeying every command just because they are adorable.",
      "housebreaking": "Some little dogs are difficult to housebreak, but not this one. A Australian Terrier is a neat, tidy little animal. Just show him what to do.",
      "aestheticQuality": "Little tough guy.",
      "personality": "All Australian Terrier love their families and are very devoted to the members of their own household. Australian Terriers enjoy company, even a house full of strangers, but some do not. They can live in a city apartment happily or they can run all over a large estate. Adaptability is a trademaark of this intelligent breed. Certainly with older children they are splendid. With younger children some Australian Terriers are too feisty, too scrappy. Then again, some young children are too feisty for a little dog. As tough as the Australian Terrier is, he is not a big-boned tower of patience. He can't take the indiscriminate pounding some very small children might mete out."
    },
    {
      "name": "Bedlington Terrier",
      "images": "dogs-195/141-bedlington-terrier.jpg",
      "origin": "The Bedlington Terrier is a dog that somewhat looks like a lamb. The Bedlington Terrier has long legs and a slender body. For dog shows, The American Kennel Club requires Bedlingtons to weigh a certain weight. The dog is named for Bedlington, England, where originated in 1825. Originally, it was raised to fight Badgers. The Bedlington is related to the Otterhound and Whippet.",
      "heightAtShoulder": {
        "males": "25",
        "females": "23-24 in."
      },
      "weight": {
        "males": "17-23",
        "females": "15-21 lbs."
      },
      "grooming": "It has a soft, fleecy coat, and the fur on its head is often trimmed so that its face looks like a Sheep's face.",
      "cost": "Very Expensive",
      "capabilities": "The dogs were famous as hunters and fighters of Badgers. Now days people use them as pets and show dogs.",
      "trainingTip": "Very easy to train.",
      "housebreaking": "No problem.",
      "aestheticQuality": "Famous for fighting Badgers.",
      "personality": "All Bedlingtons love their families and are very devoted to the members of their own household. Some Bedlingtons enjoy company, even a house full of strangers, but some do not. They can live in a city apartment happily or they can run all over a large estate. Adaptability is a trademaark of this intelligent breed. Certainly with older children they are splendid. Then again, some young children are too feisty for a dog but the Bedlington can do fairly well with younger kids."
    },
    {
      "name": "Border",
      "images": "dogs-195/97-border-terrier.jpg",
      "origin": "Where Scotland borders Northern England the farmers have been plagued by the Hill Fox for hundreds of years. Their defense is the Border Terrier. They are tough little dogs who can hunt and kill a Fox, no small feat. This breed may be difficult to obtain but not impossible. The American Kennel Club can be of help in locating a breeder. They are more commonly found in England and Scotland.",
      "heightAtShoulder": {
        "males": "13-14",
        "females": "11-12 in."
      },
      "weight": {
        "males": "13-16",
        "females": "11-14 lbs."
      },
      "grooming": "The wiry top coat and soft undercoat shed a little, but regular brushing is all that is needed.",
      "cost": "Moderate",
      "capabilities": "Borders make good little watchdogs. They are to small for guarding but they make excellent ratters.",
      "trainingTip": "These are responsive dogs, exspecially for a Terrier. They do not respond well to harsh treatment: it could make them timid. Give them praise and encouragement and be consistent.",
      "housebreaking": "Like most Terriers, this one should not have housebreaking problems.",
      "aestheticQuality": "Scrappy, scruffy little tough guy.",
      "personality": "Borders are the most calm of the Terriers while still maintaining the Terrier personality, which makes them idea for children, young and old. Borders do not like to sit around, though. They are very active dogs inside as well as outside. City life is fine as long as they get enough exercise and if they are introduced to the noise and hubbub as puppies."
    },
    {
      "name": "Bull",
      "images": "dogs-195/64-bull-terrier.jpg",
      "origin": "The Bull Terrier is a medium sized dog that originally was bred in England from the Bulldog and the old White English Terrier. The Bull Terrier has the thick body and good nature of the Bulldog, and the intelligence and quickness of the Terrier. Two varities of Bull Terriers exist. One is all white, and the other is brindle with white markings. The Bull Terrier was used in England for dog baiting(fighting) and for catching rats. Today, it is prized as a pet.",
      "heightAtShoulder": {
        "males": "15-19",
        "females": "13-17 in."
      },
      "weight": {
        "males": "40-60",
        "females": "35-55 lbs."
      },
      "grooming": "The Bull has a short dense coat that is very easily maintained without any shedding.",
      "cost": "Moderate",
      "capabilities": "Clearly the Bull is an excellent guard dog and a companion. He is also a good watchdog. He is very protective of his family and especially kids.",
      "trainingTip": "Bulls can be stubborn if training begins to late. Begin early, at about three months old.",
      "housebreaking": "These dogs housebreak well when taught early in life.",
      "aestheticQuality": "Majestic and wise expression like he knows everything and understands everything going on around him.",
      "personality": "Bulls have intelligent, dominant personalities but surprisingly enough get along well with children. They love to play and romp with older kids. The city suits this breed as well as the country. They are moderately active indoors and out. Bulls are popular, so look for a well-bred puppy."
    },
    {
      "name": "Cairn",
      "images": "dogs-195/73-cairn-terrier.jpg",
      "origin": "The Cairn stems from the Isle of Skye and the West Highlands of Scotland, as does the West Highland White Terrier. These little Terriers are wonderful, feisty hunters of rodents and small game. There are very specific descriptions for the Cairn by the middle of the nineteenth century. Dorothy's Toto was a Cairn who was typically devoted to his mistress as they searched for the mythical land of Oz. They are very partial to their own families and indifferent to 'outsiders.' The spirit of a two-and-a-half-year-old is retained for a lifetime in this breed. However, the Cairn may not want to share that particular spotlight with a human two-and-a-half-year-old. Older children can get along with a Cairn much better.",
      "heightAtShoulder": {
        "males": "10",
        "females": "9 in."
      },
      "weight": {
        "males": "14",
        "females": "13 lbs."
      },
      "grooming": "The care of a Cairn is easy. They have the rough outer Terrier coat and the soft undercoat. Now and then that undercoat needs to be plucked (the loose hair pulled out witht the thumb and forefinger). Regular brushing is good.",
      "cost": "Moderate",
      "capabilities": "Just as they would threaten Rodents and Foxes hiding in the rocks, they will warn of strangers at the door. They are small and unsuited to actual guard work, contrary to what they may think. A Cairn's self-image is quite sound.",
      "trainingTip": "Cairns are Terriers. They are stubborn and sometimes aggressive. So begin early and be patient. Be firm and be consistent; don't let them get away without obeying every command just because they are adorable.",
      "housebreaking": "Some little dogs are difficult to housebreak, but not this one. A Cairn is a neat, tidy little animal. Just show him what to do.",
      "aestheticQuality": "Little tough guy.",
      "personality": "All Cairns love their families and are very devoted to the members of their own household. Some Cairns enjoy company, even a house full of strangers, but some do not. They can live in a city apartment happily or they can run all over a large estate. Adaptability is a trademaark of this intelligent breed. Certainly with older children they are splendid. With younger children some Cairns are too feisty, too scrappy. Then again, some young children are too feisty for a little dog. As tough a sthe Cairn is, he is not a big-boned tower of patience. He can't take the indiscriminate pounding some very small children might mete out."
    },
    {
      "name": "Dandie Dinmont",
      "images": "dogs-195/181-dandie-dinmont-terrier.jpg",
      "origin": "The Dandie Dinmont is a dog that got its name from a book. In Sir Walter Scott's novel Guy Mannering(1815), a farmer named Dandie Dinmont raised a pack of short-legged Terriers that were all the color of pepper or mustard. In the book, the dogs were famous as hunters of Foxes, Badgers, and Otters. A new breed was later called Dandie Dinmont for the farmer in the book.",
      "heightAtShoulder": {
        "males": "8-11",
        "females": "7-10 in."
      },
      "weight": {
        "males": "18-24",
        "females": "16-22 lbs."
      },
      "grooming": "The Dandie Dinmont has a silky topknot(tuft hair) covers it forehead. Its coat is crisp to the touch on the back and soft and downy underneath. It needs regular brushing and grooming to keep its coat looking healthy.",
      "cost": "Expensive",
      "capabilities": "The dogs were famous as hunters of Foxes, Badgers, and Otters. Now days people use them as pets and show dogs.",
      "trainingTip": "Begin early. Be consistent and firm. This breed is bright and responsive if the training is very consistent. When a Dandie Dinmont is given his own way, his stubborn streak begins to show.",
      "housebreaking": "Like most Terriers, this one should not have housebreaking problems.",
      "aestheticQuality": "A silky topknot(tuft hair) on its forehead",
      "personality": "The Dandie Dinmont is an even-tempered animal. He remains gentle in spite of his fairly high activity level, indoors and out, so he is wonderful for younger children when many of the Terriers are not. As long as he gets enough exercise he does well in the city."
    },
    {
      "name": "Irish",
      "images": "dogs-195/120-irish-terrier.jpg",
      "origin": "The Irish Terrier is a dog breed from Ireland, one of many breeds of terrier. The Irish Terrier is considered one of the oldest terrier breeds. The Dublin dog show in 1873 was the first to provide a separate class for Irish Terriers.",
      "heightAtShoulder": {
        "males": "16-18",
        "females": "15-17 in."
      },
      "weight": {
        "males": "24-26",
        "females": "23-25 lbs."
      },
      "grooming": "The rough, wiry quality of the Terrier coat needs very little care. There is very little shedding. Regular brushing is good.",
      "cost": "Expensive",
      "capabilities": "Intelligent, lively, protective, respectful, dominant, and very trainable. He is very protective of his family and he does have a dominant personality.",
      "trainingTip": "These are responsive dogs, exspecially for a Terrier. They do not respond well to harsh treatment. Give them praise and encouragement and be consistent.",
      "housebreaking": "Like most Terriers, this one should not have housebreaking problems.",
      "aestheticQuality": "The Red Daredevil.",
      "personality": "All Irish Terriers love their families and are very devoted to the members of their own household. Irish Terriers enjoy some company, as long as he knows the people a little bit. They can live in a city apartment happily or they can run all over a large estate. Adaptability is a trademaark of this intelligent breed. Certainly with older children they are splendid. With younger children some Irish Terriers are too dominant. Then again, some young children are too feisty for a Irish Terrier so keep your eyes on them and don't let them get to carried away."
    },
    {
      "name": "Kerry Blue",
      "images": "dogs-195/133-kerry-blue-terrier.jpg",
      "origin": "The Kerry Blue is the national dog of Ireland. It is named after County Kerry, where it originated. The Kerry Blue Terrier is a breed of dog. Originally bred to control vermin including rats, rabbits, badgers, ferrets, foxes, otters, hares, deer, and even wolves, over time the Kerry became a general working dog used for a variety of jobs including herding cattle and sheep. Puppies are born black but turn blue-gray as they become older.",
      "heightAtShoulder": {
        "males": "18-20",
        "females": "17-19 in."
      },
      "weight": {
        "males": "33-40",
        "females": "33-40 lbs."
      },
      "grooming": "The Kerry Blue has a silky thick tuft, or forelock covers it forehead which is usually combed between its eyes. Its coat is soft to the touch on the back and soft and downy underneath. It needs regular brushing and grooming to keep its coat looking healthy.",
      "cost": "Expensive",
      "capabilities": "A Kerry Blue can serve as a watchdog, hunter or keeping the kids busy.",
      "trainingTip": "Very easy to train.",
      "housebreaking": "Like most Terriers, this one should not have housebreaking problems.",
      "aestheticQuality": "The dogs beard.",
      "personality": "All Kerry Blue love their families and are very devoted to the members of their own household. Some Kerry Blue enjoy company, even a house full of strangers, but some do not. They can live in a city apartment happily or they can run all over a large estate. Adaptability is a trademark of this intelligent breed. Certainly with older children they are splendid."
    },
    {
      "name": "Lakeland",
      "images": "dogs-195/136-lakeland-terrier.jpg",
      "origin": "The Lakeland Terrier is a dog breed, which takes its name from its place of origin, the Lake District in England. The dog is a small to mid-size member of the Terrier family. While independent in personality, it interacts well with owners and all family members.",
      "heightAtShoulder": {
        "males": "13-15",
        "females": "13-15 in."
      },
      "weight": {
        "males": "15-18",
        "females": "15-18 lbs."
      },
      "grooming": "The silky, wiry quality of the Terrier coat needs some care. There is very little shedding. Regular brushing is good and maybe some trimming around his face sometimes.",
      "cost": "Very Expensive",
      "capabilities": "Intelligent, friendly, bold, confident, and independent. He makes a good watchdog and sometimes he can be a guarddog because he is very bold and has lots of confidence.",
      "trainingTip": "Begin early. Be consistent and firm. This breed is bright and responsive if the training is very consistent.",
      "housebreaking": "These dogs housebreak well when taught early in life.",
      "aestheticQuality": "This bold grizzle & tan, red, blue, and wheaten colored Terrier with long, fluffy fur on his face.",
      "personality": "All Lakeland Terriers love their families and are very devoted to the members of their own household. They can live in a city apartment happily or they can run all over a large estate. Adaptability is a trademark of this intelligent breed. Certainly with older children they are splendid. Then again, some young children are too feisty for a dog but the Lakeland Terrier can do fairly well with younger kids."
    },
    {
      "name": "Manchester",
      "images": "dogs-195/132-manchester-terrier.jpg",
      "origin": "The Manchester Terrier is a breed of dog of the smooth-haired terrier type. The Manchester originated in Manchester, England, in the 1800's. Dog breeders produced the Terrier to compete in rat-killing matches. In these matches, people bet on how many rats a dog could kill in a given period. By mating the Black-and-Tan Terrier, an excellent rat-catcher, with the swift Whippet, the breeders hoped to produced a superior ratter. Today, Manchesters are popular house pets. There are two varities - the standard and the toy.",
      "heightAtShoulder": {
        "males": "14-16",
        "females": "13-15 in."
      },
      "weight": {
        "males": "12-22",
        "females": "12-22 lbs."
      },
      "grooming": "The Manchester Terrier is a breed of dog of the smooth-haired terrier type. There is very little shedding at all and therefore, brushing is mostly done after baths.",
      "cost": "Expensive",
      "capabilities": "Discerning, alert, keen, devoted, happy, and active. They make great pets.",
      "trainingTip": "These are responsive dogs, exspecially for a Terrier. They do not respond well to harsh treatment: it could make them timid. Give them praise and encouragement and be consistent.",
      "housebreaking": "Like most Terriers, this one should not have housebreaking problems.",
      "aestheticQuality": "The whip like tail.",
      "personality": "The Manchester is very loyal to their owners and make excellent watchdogs. They are good around kids and will play right along with them."
    },
    {
      "name": "Miniature Bull",
      "images": "dogs-195/105-miniature-bull-terrier.jpg",
      "origin": "The English Miniature Bull Terrier is a breed with origins in the extinct English White Terrier, the Dalmatian and the Bulldog. The first existence is documented in 1872 in The Dogs of British Island.",
      "heightAtShoulder": {
        "males": "10-14",
        "females": "10-14 in."
      },
      "weight": {
        "males": "20-35",
        "females": "20-35 lbs."
      },
      "grooming": "The Miniature Bull has a short dense coat that is very easily maintained without any shedding.",
      "cost": "Expensive",
      "capabilities": "Stubborn, even tempered, energetic, loving, playful, and courageous.",
      "trainingTip": "Miniature Bulls can be stubborn if training begins to late. Begin early, at about three months old.",
      "housebreaking": "These dogs housebreak well when taught early in life.",
      "aestheticQuality": "Majestic and wise expression like he knows everything and understands everything going on around him.",
      "personality": "Miniature Bulls have intelligent, dominant personalities but surprisingly enough get along well with children. They love to play and romp with older kids. The city suits this breed as well as the country. They are moderately active indoors and out. Miniature Bulls are popular, so look for a well-bred puppy."
    },
    {
      "name": "Miniature Schnauzer",
      "images": "dogs-195/19-miniature-schnauzer.jpg",
      "origin": "The Miniature Schnauzer is a breed of small dog of the Schnauzer type that originated in Germany in the mid-to-late 19th century.",
      "heightAtShoulder": {
        "males": "12-14",
        "females": "12-14 in."
      },
      "weight": {
        "males": "12-20",
        "females": "12-20 lbs."
      },
      "grooming": "The Miniature Schnauzer does have shedding, so regular brushing and grooming once or twice a year would be great for him.",
      "cost": "Very Expensive",
      "capabilities": "Intelligent, alert, friendly, spirited, fearless, and obedient. They make great pets.",
      "trainingTip": "Begin early. Be consistent and firm. This breed is bright and responsive if the training is consistent.",
      "housebreaking": "Like most Terriers, this one should not have housebreaking problems.",
      "aestheticQuality": "Alert, fearless, and spirited.",
      "personality": "The Miniature Schnauzer makes a great watchdog and also a wonderful guarddog because he is fearless, alert, and obedient to his owners and he will protect them the best he can. He loves to play with the kids and he will be right there with them as long as they want to play."
    },
    {
      "name": "Norfolk",
      "images": "dogs-195/130-norfolk-terrier.jpg",
      "origin": "The Norfolk Terrier is a British breed of dog. Prior to gaining recognition as an independent breed in 1964, it was a variety of the Norwich Terrier, distinguished from the 'prick eared' Norwich by its 'drop ears'. Together, the Norfolk and Norwich Terriers are the smallest of the working terriers.",
      "heightAtShoulder": {
        "males": "7-9",
        "females": "7-9 in."
      },
      "weight": {
        "males": "11-12",
        "females": "11-12 lbs."
      },
      "grooming": "The Norfolk has a hard, wiry, and straight hair that does shed. Daily brushing will keep the shedding to a minimum and keeps the coat looking healthy.",
      "cost": "Moderate",
      "capabilities": "Lovable, happy, spirited, fearless, and companionable.",
      "trainingTip": "Very easy to train.",
      "housebreaking": "No problem.",
      "aestheticQuality": "The smallest working terrier.",
      "personality": "All Norfolk Terrier love their families and are very devoted to the members of their own household. They can live in a city apartment happily or they can run all over a large estate. Adaptability is a trademark of this intelligent breed. Certainly with older children they are splendid. Then again, some young children are too feisty for a dog but the Norfolk Terrier can do fairly well with younger kids."
    },
    {
      "name": "Norwich",
      "images": "dogs-195/109-norwich-terrier.jpg",
      "origin": "The Norwich Terrier is a breed of dog originating in England, and was bred to hunt small rodents. One of the smallest terriers, these dogs are relatively rare. Their drop-eared variety is the Norfolk Terrier.",
      "heightAtShoulder": {
        "males": "6-8",
        "females": "6-8 in."
      },
      "weight": {
        "males": "11-12",
        "females": "11-12 lbs."
      },
      "grooming": "The Norwich has a double Coat (hard, wiry, and soft under coat). Daily brushing will keep the shedding to a minimum and keeps the coat looking healthy.",
      "cost": "Very Expensive",
      "capabilities": "Hardy, intelligent, affectionate, energetic, and sensitive",
      "trainingTip": "Very easy to train.",
      "housebreaking": "No problem.",
      "aestheticQuality": "The smallest working terrier.",
      "personality": "All Norwich Terrier love their families and are very devoted to the members of their own household. They can live in a city apartment happily or they can run all over a large estate. Adaptability is a trademark of this intelligent breed. Certainly with older children they are splendid. Then again, some young children are too feisty for a dog but the Norwich Terrier can do fairly well with younger kids."
    },
    {
      "name": "Parson Russell(Jack Russell)",
      "images": "dogs-195/115-parson-russell-terrier.jpg",
      "origin": "The Parson Russell Terrier is a breed of small white terrier that was the original Fox Terrier of the 18th century. The breed is named after the Reverend Jack Russell, credited with the creation of this type of dog.",
      "heightAtShoulder": {
        "males": "8-12",
        "females": "8-12 in."
      },
      "weight": {
        "males": "13-17",
        "females": "13-17 lbs."
      },
      "Grooming": "The Parson Russell sheds a little so daily brushing would help to keep it to a minimum.",
      "cost": "Moderate",
      "Capabilities": "Intelligent, energetic, bold, happy, obedient, and eager.",
      "Training Tip": "Begin a little early with the Parson Russell Terrier and be consistent. He is very obedient and eager to please.",
      "Housebreaking": "There should be no ploblems at all, just be consistent.",
      "Aesthetic quality": "Very energetic little man.",
      "Personality": "All Parson Russell Terriers love their families and are very devoted to the members of their own household. They can live in a city apartment happily or they can run all over a large estate. Adaptability is a trademark of this intelligent breed. Certainly with older children they are splendid. Then again, some young children are too feisty for a dog but the Parson Russell Terrier does well with younger kids."
    },
    {
      "name": "Scottish",
      "images": "dogs-195/57-scottish-terrier.jpg",
      "origin": "The Scottish Terrier, popularly called the Scottie, is a breed of dog. Initially one of the highland breeds of terrier that were grouped under the name of Skye Terrier, it is one of five breeds of Terriers that originated in Scottland.",
      "heightAtShoulder": {
        "males": "10-11",
        "females": "10-11 in."
      },
      "weight": {
        "males": "19-22",
        "females": "18-21 lbs."
      },
      "grooming": "It has a soft, fleecy coat, and the fur on its head chin is often trimmed.",
      "cost": "Very Expensive",
      "capabilities": "Feisty, self-assured, alert, quick, independent, and playful.",
      "trainingTip": "These are responsive dogs, exspecially for a Terrier. They do not respond well to harsh treatment: it could make them feisty and stuborn. Give them praise and encouragement and be consistent.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "Alert black, brindle, and wheaten colored Terrier with long, fluffy fur on his face and beard like look.",
      "personality": "The Scottie is a very outgoing and playful dog. He loves to play around with all the kids and will go as long as they want to play. He will get feisty with other dogs when it comes to the other members of his family."
    },
    {
      "name": "Sealyham",
      "images": "dogs-195/148-sealyham-terrier.jpg",
      "origin": "The Sealyham Terrier is a rare Welsh breed of small to medium-sized terrier that originated in Wales as a working dog. It is principally a white-bodied, rough-coated breed, developed in the mid-to-late-19th century by Captain John Edwardes at Sealyham House, Pembrokeshire.",
      "heightAtShoulder": {
        "males": "8-10",
        "females": "7-9 in."
      },
      "weight": {
        "males": "19-20",
        "females": "17-18 lbs."
      },
      "grooming": "The Sealyham Terrier needs daily brushing and professional grooming. There is shedding.",
      "cost": "Very Expensive",
      "capabilities": "Even tempered, alert, friendly, fearless, and calm.",
      "trainingTip": "When Sealyham Terriers are trained as young puppies, they learn quickly, easily, and willingly. They accept human dominance at this early age, which is important. This strong, independent spirit always needs a firm, decisive trainer.",
      "housebreaking": "Begin early and be consistent.",
      "aestheticQuality": "the long hair on its face around the mouth and nose.",
      "personality": "The Sealyham Terrier is an even-tempered animal. He remains gentle in spite of his fairly high activity level, indoors and out, so he is wonderful for younger children when many of the Terriers are not. As long as he gets enough exercise he does well in the city."
    },
    {
      "name": "Skye",
      "images": "dogs-195/183-skye-terrier.jpg",
      "origin": "The Skye Terrier is a Scottish dog breed that is a long, low, hardy terrier and 'one of the most endangered native dog breeds in the United Kingdom' according to the Kennel Club.",
      "heightAtShoulder": {
        "males": "9-10",
        "females": "8-10 in."
      },
      "weight": {
        "males": "35-40",
        "females": "25-31 lbs."
      },
      "grooming": "The Skye has a hard, wiry, and straight hair that does shed. Daily brushing will keep the shedding to a minimum and keeps the coat looking healthy.",
      "cost": "Very Expensive",
      "capabilities": "Intelligent, good-tempered, friendly, loyal, fearless, and happy.",
      "trainingTip": "With the Skye begin early and be consistent.",
      "housebreaking": "Begin early and be consistent.",
      "aestheticQuality": "The long hair, long body, little guy.",
      "personality": "The Skye is very loyal to their owners and make excellent watchdogs. They are good around kids and will play right along with them."
    },
    {
      "name": "Smooth Fox Terrier",
      "images": "dogs-195/124-smooth-fox-terrier.jpg",
      "origin": "Both varieties of Fox Terrier were bred from other Terriers in nineteenth-century England. They were used with packs of Foxhounds. When the larger dogs ran a Fox to the ground the Fox Terrier burrowed into the tunnel for the kill. As Fox hunting waned, the Fox Terrier became more popular in the show ring and in high-fashion settings. Remember Asta in the Thin Man movies.",
      "heightAtShoulder": {
        "males": "15-16",
        "females": "14-15 in."
      },
      "weight": {
        "males": "17-19",
        "females": "15-17 lbs."
      },
      "grooming": "There is little shedding. But the wirehaired varity needs regular brushing plus visits to the professional groomer for clipping. The smooth varity needs a brushing only now and then.",
      "cost": "Moderate",
      "capabilities": "These are wonderful watchdogs. They will bark at any sound or unusual circumstances. But they are not guard dogs.",
      "trainingTip": "Begin early. Be consistent and firm. This breed is bright and responsive if the training is very consistent. When a Fox Terrier is given his own way, his stubborn streak begins to show.",
      "housebreaking": "Some Fox Terriers have more difficulty with housebreaking than others. Don't wait to find out. Begin training early and be firm.",
      "aestheticQuality": "Alert, clever, and playful.",
      "personality": "They need busy, active, older children who want to play. A fox Terrier's outdoor exercise does not have to be jogging, but he needs a lot of time to chase balls and see what's going on. Such active dogs need a fair-sized home in the city or country. Be sure to explain to the child and the dog that the child must be in charge at all times. Fox Terriers like to take over if given a chance. Fox Terriers are superstars. They are probably the most charming of all. These outgoing dogs do tricks and try anything to get your attention. However, they are highly sensitive and excitable and unbelievably active indoors. They are capable of driving your family quite mad with their energy, barking, and demand for attention. They are also quite scrappy with other dogs. Small children are usually not dominant enough, or fast enough, or alert enough to handle this breed. These dogs require a gentle-but-firm hand plus one who can outwit them. They are very clever, and quite stubborn. They are wonderful for older kids and teenagers."
    },
    {
      "name": "Soft Coated Wheaten",
      "images": "dogs-195/58-soft-coated-wheaten-terrier.jpg",
      "origin": "This Terrier with the unusual fluffly fur comes from Ireland. From all acounts it was a dependable farm dog, protecting livestock and hunting small vermin, for hundreds of years while other Terriers were gaining fame in the show ring. In 1937 it was recognized by the Irish Kennel Club, on St. Patrick's Day to be exact. And on St. Patrick's Day, 1962, the Soft-Coated Wheaten Terrier Club of America was founded in Brooklyn.",
      "heightAtShoulder": {
        "males": "18-19",
        "females": "18-19 in."
      },
      "weight": {
        "males": "35-45",
        "females": "35-45 lbs."
      },
      "grooming": "The Wheaten's coat in unusual for a Terrier. It is fairly long, soft, and wavy. There is very little shedding, but daily brushing is important to keep the fur from matting.",
      "cost": "Expensive",
      "capabilities": "This is apparently a Terrier of all trades. Watchdog is at the top of the list, followed by hunting, herding, and the guarding. They do guard but they are better watchdogs.",
      "trainingTip": "Wheatens are somewhat easier to train than other Terriers. They are willing to please and very bright. Don't let them go without obedience training, though. That Terrier stubbornness will surface.",
      "housebreaking": "No problem",
      "aestheticQuality": "Alert beige Terrier with long, fluffy fur on his face.",
      "personality": "The Wheaten is an even-tempered animal. He remains gentle in spite of his fairly high activity level, indoors and out, so he is wonderful for younger children when many of the Terriers are not. As long as he gets enough exercise he does well in the city."
    },
    {
      "name": "Staffordshire Bull",
      "images": "dogs-195/81-staffordshire-bull-terrier.jpg",
      "origin": "The Staffordshire Bull Terrier, also called the Staffy or Stafford, is a purebred dog of small to medium size in the terrier group that originated in the northern parts of Birmingham and in the Black Country of Staffordshire, for which it is named.",
      "heightAtShoulder": {
        "males": "14-16",
        "females": "13-15 in."
      },
      "weight": {
        "males": "29-37",
        "females": "24-34 lbs."
      },
      "grooming": "The Staffordshire Bull has a short dense coat that is very easily maintained without any shedding.",
      "cost": "Expensive",
      "capabilities": "Intelligent, reliable, loyal, bold, affectionate, fearless, and courageous.",
      "trainingTip": "Begin early. Be consistent and firm. This breed is bright and responsive if the training is very consistent. When a Staffordshire Bull Terrier is given his own way, his stubborn streak begins to show.",
      "housebreaking": "Like most Terriers, this one should not have housebreaking problems.",
      "aestheticQuality": "Little tough guy.",
      "personality": "The Staffordshire Bull Terrier is very loyal to their owners and make excellent watchdogs and guarddogs because they are bold, courageous, and fearless. They are good around kids and will play right along with them. He will protect kids and will love on them all day long."
    },
    {
      "name": "Welsh",
      "images": "dogs-195/112-welsh-terrier.jpg",
      "origin": "The Welsh Terrier originates from Wales and was originally bred for hunting fox, rodents and badger; but during the last century, it has mainly been bred for showing. Despite this, it has retained its terrier strength of character. The Welsh Terrier has been claimed to be the oldest existing dog breed in the UK.",
      "heightAtShoulder": {
        "males": "12-14",
        "females": "10-12 in."
      },
      "weight": {
        "males": "35-45",
        "females": "30-40 lbs."
      },
      "grooming": "The rough, wiry quality of the Terrier coat needs very little care. The softer undercoat will periodically loosen to make way for new growth. However, those with a busier schedule can take the dog to a professional groomer to be trimmed and clipped. There is very little shedding. Regular brushing is good.",
      "cost": "Very Expensive",
      "capabilities": "This is apparently a Terrier of all trades. They do guard but they are better watchdogs. The Welsh Terrier is intelligent, alert, friendly, and spirited.",
      "trainingTip": "These are responsive dogs, exspecially for a Terrier. They do not respond well to harsh treatment: it could make them feisty and stuborn. Give them praise and encouragement and be consistent.",
      "housebreaking": "There should be no problems.",
      "aestheticQuality": "the long hair on its face around the mouth.",
      "personality": "The Welsh Terrier is an even-tempered animal. He remains gentle in spite of his fairly high activity level, indoors and out, so he is wonderful for younger children when many of the Terriers are not. As long as he gets enough exercise he does well in the city."
    },
    {
      "name": "West Highland White",
      "images": "dogs-195/44-west-highland-white-terrier.jpg",
      "origin": "Westies go back at least to the middle of the ninteenth century in Scotland. They come from the common Terrier stock of Scotland that gave us the Cairn, the Scottie, and the Dandie Dinmont. These all white Terriers were often known as Reseneath or Poltalloch Terriers after the estates of their breeders. Colonel Malcolm of Poltalloch had the name officially changed to West Highland White Terrier in the first decade of the twentieth century. The white coat was valued because the dog was much easier to see when hunting. The darker, earth-colored dogs could sometimes be mistaken for the vermin they were chasing, leading to tragic mistakes.",
      "heightAtShoulder": {
        "males": "11",
        "females": "10 in."
      },
      "weight": {
        "males": "17-20",
        "females": "15-18 lbs."
      },
      "grooming": "Believe it or not that sparkling white coat is easy to keep. Too much bathing makes it more difficult. Dry shampoo and regular brushing keep the natural oils distributed throughout the coat and do more to keep the white color clean than soap does. Westies do not shed very much, but they have the Terrier hard outer coat and the soft undercoat that needs plucking when it loosens. Just gently pull the clumps of loose undercoat with the thumb and forefinger. It may take a little practice.",
      "cost": "Moderate",
      "capabilities": "A Westie can serve as a watchdog, hunter, or entertainment director. They are not good guard dogs. Not only are they too small, the West Highland White basically likes company and visitors, and though assertive, he is not an aggressive dog.",
      "trainingTip": "Unlike some other Terriers, Westies are not stubborn, so training is a reasonably simple, straightforward affair. These are very bright dogs. Just follow the basic training course.",
      "housebreaking": "This breed is easy to housebreak.",
      "aestheticQuality": "Alert, perky and white.",
      "personality": "Happy, active, sociable Highlanders enjoy life as long as they are loved, and who could not love them? Some Westies could be too impatient for a toddler or very young child. Like most Terriers, a Westie will only put up with so much. But older children and Westies are a perfect combination. This breed is very active indoors and needs to play a lot. They are very active outdoors as well. However, they make wonderful apartment dogs because they do not need an enormous amount of space for all that activity."
    },
    {
      "name": "Wire-haired Fox Terrier",
      "images": "dogs-195/104-wirehaired-fox-terrier.jpg",
      "origin": "Both varieties of Fox Terrier were bred from other Terriers in nineteenth-century England. They were used with packs of Foxhounds. When the larger dogs ran a Fox to the ground the Fox Terrier burrowed into the tunnel for the kill. As Fox hunting waned, the Fox Terrier became more popular in the show ring and in high-fashion settings. Remember Asta in the Thin Man movies.",
      "heightAtShoulder": {
        "males": "12-14",
        "females": "11-13 in."
      },
      "weight": {
        "males": "15-18",
        "females": "13-16 lbs."
      },
      "grooming": "There is little shedding. The wirehaired varity needs regular brushing plus visits to the professional groomer for clipping. The smooth varity needs a brushing only now and then.",
      "cost": "Moderate",
      "capabilities": "These are wonderful watchdogs. They will bark at any sound or unusual circumstances. But they are not guard dogs.",
      "trainingTip": "Begin early. Be consistent and firm. This breed is bright and responsive if the training is very consistent. When a Fox Terrier is given his own way, his stubborn streak begins to show.",
      "housebreaking": "Some Fox Terriers have more difficulty with housebreaking than others. Don't wait to find out. Begin training early and be firm.",
      "aestheticQuality": "Alert, clever, and playful.",
      "personality": "They need busy, active, older children who want to play. A fox Terrier's outdoor exercise does not have to be jogging, but he needs a lot of time to chase balls and see what's going on. Such active dogs need a fair-sized home in the city or country. Be sure to explain to the child and the dog that the child must be in charge at all times. Fox Terriers like to take over if given a chance. Fox Terriers are superstars. They are probably the most charming of all. These outgoing dogs do tricks and try anything to get your attention. However, they are highly sensitive and excitable and unbelievably active indoors. They are capable of driving your family quite mad with their energy, barking, and demand for attention. They are also quite scrappy with other dogs. Small children are usually not dominant enough, or fast enough, or alert enough to handle this breed. These dogs require a gentle-but-firm hand plus one who can outwit them. They are very clever, and quite stubborn. They are wonderful for older kids and teenagers."
    }
  ]
},{
  "_id": {
    "$oid": "6709695475a514a448064b12"
  },
  "category": "toy",
  "dogInfo": [
    {
      "name": "Affenpinscher(AH fuhn PIN shuhr)",
      "images": "dogs-195/163-affenpinscher.jpg",
      "origin": "The Affenpinscher was developed in Europe, around the 1700's. This breed of dog was used to hunt rodients and loyal and playful pets. The name Affenpinscher comes from the German words meaning Monkey Terrier.",
      "heightAtShoulder": {
        "males": "10",
        "females": "9 in."
      },
      "weight": {
        "males": "7-8",
        "females": "7-8 lbs."
      },
      "grooming": "The Affenpinscher needs a lot of brushing and grooming for the upkeep of the dogs coat.",
      "cost": "Very expensive",
      "capabilities": "Companionship, affectionate, very playful, and intelligent.",
      "trainingTip": "They are very responsive and eager to please. Can't be to rough with them or get aggresive because they will become very shy and shut down.",
      "housebreaking": "Should have no problems at all",
      "aestheticQuality": "Known for its beard and mustache.",
      "personality": "The Companionship and playfulness of the Affenpinscher is great for kids (as long as they are not to small and rough) and younger people."
    },
    {
      "name": "Brussels Griffon(GRIHF uhn)",
      "images": "dogs-195/89-brussels-griffon.jpg",
      "origin": "The Brussels Griffon was developed in Belgium, around the 1600's. The rough-coated Brussels Griffon was developed by crossing a toy dog of Brussels, Belgium, with certain varities of English Toy Spaniels. Brabancons were developed by crossing the rough-coated dog with the pug, also a toy dog.",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "9-11 in."
      },
      "weight": {
        "males": "8-10",
        "females": "8-10 lbs."
      },
      "grooming": "The Brussels Griffon needs a lot of brushing and grooming for the upkeep of the dogs coat.",
      "cost": "Very expensive",
      "capabilities": "Companionship, affectionate, playful, and intelligent.",
      "trainingTip": "Very easy to train.",
      "housebreaking": "No problems.",
      "aestheticQuality": "His wise and old man looks.",
      "personality": "The Companionship and playfulness of the Brussels Griffon is great for kids and younger people."
    },
    {
      "name": "Cavalier King Charles Spaniel",
      "images": "dogs-195/17-cavalier-king-charles-spaniel.jpg",
      "origin": "European palaces and portraits of the sixteenth, seventeenth, eighteenth centuries were filled with toy spaniels. Many of them in those years looked just like the Cavalier of today. This is the English Toy Spaniel.",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "10-12 in."
      },
      "weight": {
        "males": "10-18",
        "females": "10-18 lbs."
      },
      "Grooming": "There is a little shedding. Regular brushing keeps the fur from matting.",
      "cost": "Very expensive",
      "Capabilities": "Companionship or they will flush fowl for the hunter.",
      "Training Tip": "They are very responsive and eager to please.",
      "Housebreaking": "Frequent walks, consistent schedules and patience will help. The Cavalier sometimes has difficulty with housebreaking.",
      "Aesthetic quality": "Elegant, classic, cheerful",
      "Personality": "Cavaliers are loving and playful with all children. They have the Spaniel talent of being able to relate to every member of a large family as though each person were the favorite. Young children and toddlers should be supervised. This breed is a delight to live with and extremely easy to care for. They are reasonably active indoors but do not need extensive outside exercise, which makes them wonderful city dogs."
    },
    {
      "name": "Chihuahua(chee WAH wah)",
      "images": "dogs-195/34-chihuahua.jpg",
      "origin": "The Chihuahua is the smallest breed of dogs. There are two varities of Chihuahuas, the Smooth-Coat and the Long-Coat. The Chihuahua developed Mexico around the 1500's or earlier and it is named for the Mexican State Chihuahua. The dog is called a Chihuahueno in Mexico. There are some experts that believe the Chihuahua originated more than 500 years ago. Also, the Chihuahua is often referred to as the 'Royal dog of the Americans.'",
      "heightAtShoulder": {
        "males": "5",
        "females": "4 in."
      },
      "weight": {
        "males": "1-6",
        "females": "1-6 lbs."
      },
      "grooming": "The smooth-coat Chihuahua needs really little or no brushing at all, but the long-coat Chihuahua needs brushing everyday and some grooming a few times a year.",
      "cost": "Moderate",
      "capabilities": "Companionship, affectionate, playful, and intelligent.",
      "trainingTip": "Begin early and be consistent because the Chihuahua can be stubborn if it gets the notion to be. They learn fast because they are intelligent dogs and they want to please their family.",
      "housebreaking": "Should have no problems when beginning early and being consistent.",
      "aestheticQuality": "Known for its size.",
      "personality": "The Chihuahua is very loyal to their owner and they are very good as watch dogs because they will alert you to someone that is not suppose to be around or someone they don't know. They are great pets and companions, maybe not ideal for smaller kids because the Chihuahua is a very small dog."
    },
    {
      "name": "Chinese Crested",
      "images": "dogs-195/79-chinese-crested.jpg",
      "origin": "The Chinese Crested breed probably originated in Africa somewhere between 1000-1200. The dogs were kept as pets by Mandarins (high-ranking Officials) in China. Chinese merchants carried the dogs on sailing vessels and thus introduced them to other Countries throughout the world. There are two varities of the Chinese Cresteds, the hairless and the powderpuff.",
      "heightAtShoulder": {
        "males": "11-13",
        "females": "10-12 in."
      },
      "weight": {
        "males": "5-10",
        "females": "4-9 lbs."
      },
      "grooming": "Both varities need grooming and brushing, but the powderpuff more so than the hairless one.",
      "cost": "Very expensive",
      "capabilities": "Companionship, affectionate, very playful, and intelligent.",
      "trainingTip": "They are very responsive and eager to please.",
      "housebreaking": "Should have no problems at all",
      "aestheticQuality": "Known for its puff of hair just on its head.",
      "personality": "Chinese Crested are loving, alert, agile, and make great pets. Young children and toddlers should be supervised. This breed is a delight to live with and extremely easy to care for. They are reasonably active indoors but do not need extensive outside exercise at all, which makes them wonderful city dogs."
    },
    {
      "name": "English Toy Spaniel",
      "images": "dogs-195/138-english-toy-spaniel.jpg",
      "origin": "The English Toy Spaniel is a breed of dog that was a favorite with English nobility in the 1600's.The English Toy Spaniel originated from Japan or China, around ancient times. ",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "8-10 in."
      },
      "weight": {
        "males": "9-12",
        "females": "9-12 lbs."
      },
      "grooming": "The dog's Silky coat grows thickly, with longer fringes of hair on the chest, legs, tail, and feet. It needs a lot of grooming and brushing.",
      "cost": "Expensive",
      "capabilities": "Companionship.",
      "trainingTip": "They are very responsive and eager to please.",
      "housebreaking": "Frequent walks, consistent schedules and patience will help. The English Toy Spaniel sometimes has difficulty with housebreaking.",
      "aestheticQuality": "Elegant, classic, cheerful",
      "personality": "English Toy Spaniels are loving and playful with all children. They have the Spaniel talent of being able to relate to every member of a large family as though each person were the favorite. Young children and toddlers should be supervised. This breed is a delight to live with and extremely easy to care for. They are reasonably active indoors but do not need extensive outside exercise, which makes them wonderful city dogs."
    },
    {
      "name": "Havanese(HAH vuh NEEZ)",
      "images": "dogs-195/24-havanese.jpg",
      "origin": "The Havanese is a small lively breed of dog. Havanese have short, muscular legs; large, almond-shaped eyes; drooping ears; and a short snout. Ancestors of the Havanese originally came from the Mediterranean area of Europe, especiaaly coastal Spain and Italy. 1400's or earlier, European explorers had brought them to what is now Cuba. The breed was developed in Cuba and named Havanese after the Cuban capital, Havana.",
      "heightAtShoulder": {
        "males": "9-10",
        "females": "9-10 in."
      },
      "weight": {
        "males": "11-12",
        "females": "11-12 lbs."
      },
      "Grooming": "The Havanese has a long, double coat of soft hair. This coat may be straight or curly and comes in a varity of colors. There is some shedding, but the Havanese needs a lot of brushing and professional grooming a couple times of year.",
      "cost": "Very expensive",
      "Capabilities": "The Havanese is a happy, affectionate dog, and makes a great pet.",
      "Training Tip": "They are very responsive and eager to please.",
      "Housebreaking": "There should be no problems, just be consistent and praise all successes.",
      "Aesthetic quality": "Their large almond-shaped eyes",
      "Personality": "Havanese are loving and playful with all children. They have the Spaniel talent of being able to relate to every member of a large family as though each person were the favorite. Young children and toddlers should be supervised because this is a small dog but he is a tough little guy. This breed is a delight to live with and extremely easy to care for. They are reasonably active indoors but do not need extensive outside exercise, which makes them wonderful city dogs."
    },
    {
      "name": "Italian Greyhound",
      "images": "dogs-195/69-italian-greyhound.jpg",
      "origin": "The Italian Greyhound is a breed of dog similar to the Greyhound but much smaller. Ancient Romans often kept Italian Greyhounds. They hung up signs in their homes saying, 'cave canem' (watch out for dog). These signs were to protect the tiny Greyhounds from being stepped on accidentally.The Italian Greyhound originated in Italy somewhere around 100 B.C.",
      "heightAtShoulder": {
        "males": "13-15",
        "females": "12-14 in."
      },
      "weight": {
        "males": "6-10",
        "females": "6-10 lbs."
      },
      "grooming": "The smooth-coat Italian Greyhound needs really little or no brushing at all.",
      "cost": "Expensive",
      "capabilities": "Companionship, affectionate, playful, and intelligent.",
      "trainingTip": "They are very responsive and eager to please.",
      "housebreaking": "Should have no problems at all",
      "aestheticQuality": "The Italian Greyhound lifts its front feet up high when walking.",
      "personality": "The Companionship and playfulness of the Italian Greyhound is great for kids (as long as they are not to small and rough) and younger people."
    },
    {
      "name": "Japanese Chin",
      "images": "dogs-195/111-japanese-chin.jpg",
      "origin": "The Japanese Chin is a dainty, graceful Toy dog. The Japanese Chin was brought to the Western world from Japan in the 1850's. The breed, which originated in China, was formerly called the Japanese Spaniel which dates back to ancient times.",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "9-11 in."
      },
      "weight": {
        "males": "5-9",
        "females": "5-9 lbs."
      },
      "grooming": "The Japanese Chin has a long and silky coat, with longer hair around its neck and on its tail and legs. It needs a lot of brushing and grooming.",
      "cost": "Very expensive",
      "capabilities": "Companionship, affectionate, very playful, and intelligent.",
      "trainingTip": "Begin early and be consistent because the Japanese Chin can be stubborn if it gets the notion to be. They learn fast because they are intelligent dogs and they want to please their family.",
      "housebreaking": "Should have no problems when beginning early and being consistent.",
      "aestheticQuality": "Its dainty and graceful behavior.",
      "personality": "The Japanese Chin is very loyal to their owner and they are very good as watch dogs because they will alert you to someone that is not suppose to be around or someone they don't know. They are great pets and companions, maybe not ideal for smaller kids because the Japanese Chin is a very small dog."
    },
    {
      "name": "Maltese",
      "images": "dogs-195/38-maltese.jpg",
      "origin": "The Maltese was likely the world's first lapdog. It was developed on the Mediterranean Island of Malta nearly 3,000 years ago. Ladies in Greek and Roman Noble Families carried these dogs in the sleeves of their robes and waited on them like baby children. The Maltese grew to be one of the gentlest of all Toy dogs.",
      "heightAtShoulder": {
        "males": "6",
        "females": "5 in."
      },
      "weight": {
        "males": "4-6",
        "females": "3-5 lbs."
      },
      "grooming": "There is little shedding. The Maltese needs regular brushing plus visits to a professional groomer for clipping because its fur will grow so long it will drag the floor or ground.",
      "cost": "Expensive",
      "capabilities": "Companionship, affectionate, playful, and intelligent.",
      "trainingTip": "Begin early and be consistent because the Maltese can be stubborn if it gets the notion to be and you can't be aggresive with him because he will become shy. They learn fast because they are intelligent dogs and they want to please their owner.",
      "housebreaking": "Should have no problems when beginning early and being consistent.",
      "aestheticQuality": "The Maltese has black eyes with dark rims that make the eyes look large.",
      "personality": "The Maltese is very loyal to their owner. They are great pets and companions, maybe not ideal for smaller kids because the Maltese is a very small dog."
    },
    {
      "name": "Miniature Pinscher",
      "images": "dogs-195/77-miniature-pinscher.jpg",
      "origin": "The Miniature Pinscher, also known as the Zwergpinscher and Mini Pin, is a small breed of dog of the pinscher type originating in Germany. Many breeders believe that the Miniature Pinscher originated somewhere around the 1700's.",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "10-11 in."
      },
      "weight": {
        "males": "8-11",
        "females": "7-11 lbs."
      },
      "grooming": "The Miniature Pinscher needs really little or no brushing at all.",
      "cost": "Expensive",
      "capabilities": "Clever, playful, outgoing, friendly, responsive, energetic, assertive, active, and independent",
      "trainingTip": "Very easy to train.",
      "housebreaking": "There should be no problems",
      "aestheticQuality": "A very small version of the Doberman.",
      "personality": "The Miniature Pinscher is a very playful, outgoing, and friendly dog that loves to and wants to play all day with the kids. But the Miniature Pinscher can be very assertive when given the chance or wants to do something he wants to do."
    },
    {
      "name": "Papillon",
      "images": "dogs-195/53-papillon.jpg",
      "origin": "The Papillon, also called the Continental Toy Spaniel, is a breed of dog, of the spaniel type. One of the oldest of the toy spaniels, it derives its name from its characteristic butterfly-like look of the long and fringed hair on the ears. A Papillon with dropped ears is called a Phalene. Breeders believe the Papillon originated in Spain, around the 1500's.",
      "heightAtShoulder": {
        "males": "8-10",
        "females": "7-9 in."
      },
      "weight": {
        "males": "8-10",
        "females": "7-9 lbs."
      },
      "grooming": "The Papillon needs a lot of brushing and grooming for the upkeep of the dogs coat.",
      "cost": "Expensive",
      "capabilities": "Intelligent, friendly, alert, energetic, and happy. He also makes a good watchdog because he is always alert and will let you know when strangers come around.",
      "trainingTip": "The Papillon is very intelligent and learns fast.",
      "housebreaking": "Should have no problems at all",
      "aestheticQuality": "Butterfly-like look.",
      "personality": "The Papillons are loving and playful with all children. They have the Spaniel talent of being able to relate to every member of a large family as though each person were the favorite. This breed is a delight to live with and extremely easy to care for. They do need brushing and maybe a trim once a year to keep its coat looking heathy, there is some shedding. They are reasonably active indoors but do not need extensive outside exercise, which makes them wonderful city dogs."
    },
    {
      "name": "Pekingese",
      "images": "dogs-195/95-pekingese.jpg",
      "origin": "The Pekingese is a breed of toy dog, originating in China around the 700's. The breed was favored by royalty of the Chinese Imperial court as a companion dog, and its name refers to the city of Beijing where the Forbidden City is located. The breed has several characteristics and health issues related to its unique appearance.",
      "heightAtShoulder": {
        "males": "6-9",
        "females": "6-9 in."
      },
      "weight": {
        "males": "7-14",
        "females": "7-14 lbs."
      },
      "grooming": "The Pekingese needs a lot of brushing and grooming for the upkeep of the dogs coat.",
      "cost": "Expensive",
      "capabilities": "Affectionate, opinionated, aggressive, intelligent, stubborn, and good-natured.",
      "trainingTip": "Begin early and be consistent because the Pekingese can be stubborn if it gets the notion to be. Also, the Pekingese is a very aggresive dog which should have a good obidence training early. They learn fast because they are intelligent dogs and they are affectionate when they are not being opinionated.",
      "housebreaking": "Should have no problems at all",
      "aestheticQuality": "The breed has several characteristics.",
      "personality": "They need busy, active, older children who want to play. The Pekingese likes to take over if given a chance. They are probably the most charming of all. These outgoing dogs do tricks and try anything to get your attention. However, they are highly sensitive and excitable and unbelievably active indoors. They are also quite scrappy with other dogs. Small children are usually not dominant enough, or fast enough, or alert enough to handle this breed because he can be aggresive. These dogs require a gentle-but-firm hand plus one who can outwit them. They are very opinionated, and quite stubborn. They are wonderful for older kids and teenagers."
    },
    {
      "name": "Pomeranian",
      "images": "dogs-195/23-pomeranian.jpg",
      "origin": "The Pomeranian is a breed of dog of the Spitz type that is named for the Pomerania region in north-west Poland and north-east Germany in Central Europe. Classed as a toy dog breed because of its small size, the Pomeranian is descended from larger Spitz-type dogs, specifically the German Spitz. It originated in Pomerania, Poland, around the 1800's.",
      "heightAtShoulder": {
        "males": "5-7",
        "females": "5-7 in."
      },
      "weight": {
        "males": "3-7",
        "females": "3-7 lbs."
      },
      "grooming": "The Pomeranian needs a lot of brushing and grooming for the upkeep of the dogs coat.",
      "cost": "Very expensive",
      "capabilities": "Playful, extroverted, intelligent, lively, friendly, sociable, and active.",
      "trainingTip": "They are very responsive and eager to please. They do have a lively side to them so make sure you are consistent and don't be aggresive with them.",
      "housebreaking": "Should have no problems at all",
      "aestheticQuality": "Known for its fluffy fur and lively personality.",
      "personality": "The Pomeranian is a very playful, outgoing, and friendly dog that loves to and wants to play all day with the kids. The Pomeranian can be very lively."
    },
    {
      "name": "Pug",
      "images": "dogs-195/29-pug.jpg",
      "origin": "The Chinese are usually given credit for developing animals with pushed-in noses. They probably developed the ancient Pug. The breed has a long and varied history. There is evidence of the Pug in ancient Tibetan monasteries, with William, Prince of Orange, in sixteenth-century France and with Napoleon and Josephine in eighteenth-century France. They are called Pugs because of their similarity to Marmoset Monkeys, which were also called Pugs in the eighteenth century. For all that long, illustrious history, the Pug has served strictly as a love object. They are very affectionate little toy dogs.",
      "heightAtShoulder": {
        "males": "10-12",
        "females": "10-12 in."
      },
      "weight": {
        "males": "14-18",
        "females": "13-17 lbs."
      },
      "grooming": "There is some shedding, but the coat is short. Occasional brushing is good. The care of the Pug is really easy.",
      "cost": "Moderate",
      "capabilities": "Companionship.",
      "trainingTip": "Pugs can be stubborn. Be gentle and patient and don't give to many corrections. Because of their wheezy breathing they can't take hard tugs and pulling on the leash.",
      "housebreaking": "There should be no problems",
      "aestheticQuality": "Worried little tough guy.",
      "personality": "Bright, affectionate, easygoing Pugs are ideal for small apartments. They are not very active and do not need much exercise. Considerate school-age children are perfect with Pugs. Toddlers and rambunctious children of any age could be too rough for the dog. A Pug is loving and gentle with a child of any age. He is one of the sturdiest of the toy breeds, but he should always be treated with respect. They are often seen in pairs (a brace)."
    },
    {
      "name": "Shih Tzu",
      "images": "dogs-195/20-shih-tzu.jpg",
      "origin": "The Shih Tzu is a toy dog as designated in the USA or Utility breed as designated by the British kennel club. They are a pet dog breed breed originating from Tibet, China, somewhere back in ancient times.",
      "heightAtShoulder": {
        "males": "5-7",
        "females": "5-7 in."
      },
      "weight": {
        "males": "3-7",
        "females": "3-7 lbs."
      },
      "grooming": "The Shih Tzu needs a lot of brushing and grooming for the upkeep of the dogs coat.",
      "cost": "Very expensive",
      "capabilities": "Playful, clever, affectionate, intelligent, and outgoing.",
      "trainingTip": "They are very responsive and eager to please. They do have a lively side to them so make sure you are consistent and don't be aggresive with them.",
      "housebreaking": "Should have no problems at all",
      "aestheticQuality": "Known for its fluffy fur and lively personality.",
      "personality": "The Shih Tzu is a very playful, outgoing, and friendly dog that loves to and wants to play all day with the kids. The Shih Tzu can be very lively."
    },
    {
      "name": "Silky Terrier",
      "images": "dogs-195/108-silky-terrier.jpg",
      "origin": "The Australian Silky Terrier or simply Silky Terrier is a small breed of dog of the terrier dog type. The breed was developed in Australia around the 1900's or so, although the ancestral types and breeds were from Great Britain. It is closely related to the Australian Terrier and the Yorkshire Terrier.",
      "heightAtShoulder": {
        "males": "6-8",
        "females": "5-7 in."
      },
      "weight": {
        "males": "8-10",
        "females": "8-10 lbs."
      },
      "grooming": "The Silky Terrier needs a lot of brushing and grooming for the upkeep of the dogs coat.",
      "cost": "Expensive",
      "capabilities": "Alert, friendly, inquisitive, responsive, quick, and joyful.",
      "trainingTip": "They are very responsive, inquisitive, and quick to please. Do not be aggresive or loud with the Silky Terrier because they will become shy timid.",
      "housebreaking": "There should be no problems",
      "aestheticQuality": "Their silky long coats and their colors.",
      "personality": "The Silky Terrier is a very alert dog who can be a watchdog and he has a very joyful spirit. He loves to play and has plenty of energy to keep up with the kids."
    },
    {
      "name": "Toy Fox Terrier",
      "images": "dogs-195/113-toy-fox-terrier.jpg",
      "origin": "Toy Fox Terriers were bred from other Terriers in the United States in the early 1900's. Toy Fox Terriers became more popular in high-fashion settings.",
      "heightAtShoulder": {
        "males": "7-9",
        "females": "6-8 in."
      },
      "weight": {
        "males": "4-8",
        "females": "4-8 lbs."
      },
      "grooming": "There is little shedding. But the wirehaired varity needs regular brushing plus visits to the professional groomer for clipping. The smooth varity needs a brushing only now and then.",
      "cost": "Expensive",
      "capabilities": "These are wonderful watchdogs. They will bark at any sound or unusual circumstances. But they are not guard dogs.",
      "trainingTip": "Begin early and be consistent because the Toy Fox Terrier can be stubborn if it gets the notion to be. They learn fast because they are intelligent dogs and they want to please their family.",
      "housebreaking": "Should have no problems at all",
      "aestheticQuality": "Remember Asta in the Thin Man movies.",
      "personality": "They need busy, active, older children who want to play. A fox Terrier's outdoor exercise does not have to be jogging, but he needs a lot of time to chase balls and see what's going on. Such active dogs need a fair-sized home in the city or country. Be sure to explain to the child and the dog that the child must be in charge at all times. Fox Terriers like to take over if given a chance. Fox Terriers are superstars. They are probably the most charming of all. These outgoing dogs do tricks and try anything to get your attention. However, they are highly sensitive and excitable and unbelievably active indoors. They are capable of driving your family quite mad with their energy, barking, and demand for attention. They are also quite scrappy with other dogs. Small children are usually not dominant enough, or fast enough, or alert enough to handle this breed. These dogs require a gentle-but-firm hand plus one who can outwit them. They are very clever, and quite stubborn. They are wonderful for older kids and teenagers."
    },
    {
      "name": "Yorkshire Terrier(Yorkie)",
      "images": "dogs-195/13-yorkshire.jpg",
      "origin": "The Yorkshire Terrier, also known as a Yorkie, is a British breed of toy dog of terrier type. It is among the smallest of the terriers and indeed of all dog breeds, with a weight of no more than 3.2 kg. It originated in the nineteenth century in the English county of Yorkshire, after which it is named.",
      "heightAtShoulder": {
        "males": "6",
        "females": "5 in."
      },
      "weight": {
        "males": "3-7",
        "females": "3-7 lbs."
      },
      "grooming": "The Yorkie needs a lot of brushing and grooming for the upkeep of the dogs coat.",
      "cost": "Expensive",
      "capabilities": "Lively, intelligent, bold, affectionate, confident, curious, active, independent, playful, and courageous.",
      "trainingTip": "Begin early and be consistent because the Pekingese can be stubborn if it gets the notion to be. Also, the Yorkie is a very independent dog which should have good training early. They learn fast because they are intelligent dogs and they are affectionate when they are not being curious and independent.",
      "housebreaking": "Should have no problems at all",
      "aestheticQuality": "A small, lively, and bold dog.",
      "personality": "The Yorkie is a very playful, outgoing, and friendly dog that loves to and wants to play all day with the kids."
    }
  ]
},{
  "_id": {
    "$oid": "672267f04f38e8f78abfd533"
  },
  "category": "working",
  "dogInfo": [
    {
      "name": "Akita",
      "images": "dogs-195/48-akita.jpg",
      "origin": "The Akita is a powerful dog that was developed in Japan. It is a breed of dog that originated in northern Japan. It was developed and bred to hunt bears and other large animals. Akitas were once owned by Royalty in Japan, and the dogs are still revered in that country.",
      "heightAtShoulder": {
        "males": "26-28",
        "females": "24-26 in."
      },
      "weight": {
        "males": "75-90",
        "females": "65-80 lbs."
      },
      "grooming": "Care of the Akita is easy. There is some shedding, but the coat is short. An occasional brushing is good",
      "cost": "Very Expensive",
      "capabilities": "The Akita is a very alert and responsive dog. They make great guard dogs and they very Loyal to their families. They will guard and watch younger children as well as older ones. They love playing with kids and interacting with them and their families",
      "trainingTip": "These dogs are very intelligent, sensitive, and very loyal. They do not need harsh or loud corrections. A gentle voice and a patient manner works wonders for the Akita because he is a very responsive dog. Praise them as soon as they have obeyed a command and be generous with the praise. Training need not begin at a terribly early age.",
      "housebreaking": "No problem.",
      "aestheticQuality": "Akitas are known for their Loyalty.",
      "personality": "Children of any age will be ecstatically happy with a Japanese Akita. They tend to lean on the people they love and they are very loyal to them. They are gentle, even-tempered and patient and love being around their families. People outside the dogs immediate family are usually ignored. This breed deserves a decent amount of outdoor exercise but remains reasonably relaxed and quite indoors, so it does well in the city."
    },
    {
      "name": "Alaskan Malamute",
      "images": "dogs-195/65-alaskan-malamute.jpg",
      "origin": "The Alaskan Malamute is a strong, rugged sled dog that came originally from Alaska. This breed of dog is said to come from a group of Inuit people called Malemiuts which developed the breed. The Inuit were formerly known as Eskimos.",
      "heightAtShoulder": {
        "males": "26-30",
        "females": "24-28 in."
      },
      "weight": {
        "males": "75-85",
        "females": "65-75 lbs."
      },
      "grooming": "Care of the Akita is easy. There is some shedding, but the coat is short. An occasional brushing is good.",
      "cost": "Expensive",
      "capabilities": "Companionship is a talent of theirs because, though they can serve as guard dogs because they are very protective of children and property. They also can be trained to help assist people that have disabilities, because they are a very intelligent dog.",
      "trainingTip": "These dogs are very intelligent, sensitive, and very loyal. They do not need harsh or loud corrections. A gentle voice and a patient manner works wonders for the Alaskan Malamute because he is a very responsive dog. Praise them as soon as they have obeyed a command and be generous with the praise. Training need not begin at a terribly early age.",
      "housebreaking": "No problem.",
      "aestheticQuality": "They are known for their bushy tail because they carry it over their back.",
      "personality": "Children and adults combined of any age will be happy with a Alaskan Malamute. They tend to lean on the people they love and they are very loyal to them. They are gentle, even-tempered and patient and love being around their families. People outside the dogs immediate family are usually ignored. They don't really need a lot of exercise or outdoor activity but they thrive in that situation."
    },
    {
      "name": "Anatolian Shepherd",
      "images": "dogs-195/85-anatolian-shepherd.jpg",
      "origin": "The Anatolian Shepherd originated in Turkey during ancient times. They were developed to guard sheep. They used these dogs to keep flocks of sheep safe and protected against other wild animals and to keep them from wondering off.",
      "heightAtShoulder": {
        "males": "30",
        "females": "28 in."
      },
      "weight": {
        "males": "80-150",
        "females": "70-130 lbs."
      },
      "grooming": "This breed has an outer coat that varies from short to medium long and a thick undercoat. There is some shedding, However, there is regular brushing involved and it helps to get them trimmed once in a while.",
      "cost": "Expensive",
      "capabilities": "Companionship is a talent of theirs because , though they can serve as guard dogs because they are very protective of children and property.",
      "trainingTip": "This breed must undergo obedience training to become accustomed to the people and surroundings outside its home.",
      "housebreaking": "Housebreaking should be fairly easy, start early and be persistent.",
      "aestheticQuality": "This breed has a varity of colors, coat colors include fawn(light beige), white, and brindle(black body with brown stripes).",
      "personality": "The Anatolian Shepherd is so happy and sweet natured with their family and children, and they are also busy and active and loves to play around. Although very active in doors, it needs outdoor exercise. They are large dogs, so they can withstand rough and tumble treatment from young or active children. They would do well whether they are in the city in a small apartment or out in the country."
    },
    {
      "name": "Bernese Mountain Dog",
      "images": "dogs-195/22-bernese-mountain-dog.jpg",
      "origin": "Named for the Canton of Berne in Switzerland, this canine serves the Swiss farmer herding, pulling loads, and guarding the farm house and stock. The Bernese has been closely identified with the basket weavers for centuries, helping transport their shipments to market. Progenitors of the breed were brought to Switzerland by the Romans. Selective breeding was not begun until the end of the eighteenth century. These are large stately animals with heavy medium-length fur. They can be comfortable outdoors through an entire winter but they need the closeness of their families.",
      "heightAtShoulder": {
        "males": "23-28",
        "females": "21-26 in."
      },
      "weight": {
        "males": "80-105",
        "females": "75-90 lbs."
      },
      "grooming": "The Bernese does shed, though not excessively. A good brushing once or twice a week will keep its coat in good shape.",
      "cost": "Expensive",
      "capabilities": "An owner can ask his Bernese to guard the house and children, to warn of approaching strangers, to haul loads on a cart, or to sit back and play with the kids and have a good time.",
      "trainingTip": "These dogs are very intelligent and sensitive. They do not need harsh or loud corrections. A gentle voice and a patient manner will work wonders for the Bernese. Praise them as soon as they have obeyed a command and be generous with the praise. Training need not begin at a terribly early age, but solcializing should. The puppies are adorable and should get a lot of human companionship as early as possible.",
      "housebreaking": "No problem",
      "aestheticQuality": "Big, sturdy black dog with white face and chest.",
      "personality": "Children of any age will be ecstatically happy with a Bernese Mountain Dog. They tend to lean on someone they love. If that someone is a small child, some supervision might be necessary. They are gentle, even-tempered and patient. People outside the dogs immediate family are usually ignored. This breed deserves a decent amount of outdoor exercise but remains reasonably relaxed and quite indoors, so it does well in the city."
    },
    {
      "name": "Boxer",
      "images": "dogs-195/14-boxer.jpg",
      "origin": "They are called Boxers because they tend to begin a fight by swinging their front paws. Fighting is what they were bred to do hundreds of years ago. The breed as we know it was developed long ago in Germany by crossing Bulldogs, Terriers, and probably Great Danes and Mastiffs. After bull-baiting and dog fights were outlawed in the middle of the nineteenth century, the Boxer was used in policeand guard work. It still makes a fine guard dog, but the viciousness has been bred out in the twentieth century to make the Boxer an excellent, affectionate pet.",
      "heightAtShoulder": {
        "males": "22-25",
        "females": "21-24 in."
      },
      "weight": {
        "males": "60-70",
        "females": "50-60 lbs."
      },
      "grooming": "Care of the Boxer is easy. There is some shedding, but the coat is short. An occasional brushing is good.",
      "cost": "Moderate",
      "capabilities": "Clearly the Boxer is an excellent guard dog and a companion. He is also a good watchdog.",
      "trainingTip": "Boxers can be stubborn if training begins to late. Begin early, at about three months old.",
      "housebreaking": "These dogs housebreak well when taught early in life.",
      "aestheticQuality": "Majestic stance and wise expression",
      "personality": "Boxers have intelligent, dominant personalities but surprisingly enough get along well with children. They love to play and romp with older kids. Most little children would have a hard time holding their own. The city suits this breed as well as the country. They are moderately active indoors and out. Boxers are very popular, so look for a well-bred puppy."
    },
    {
      "name": "Bullmastiff",
      "images": "dogs-195/55-bullmastiff.jpg",
      "origin": "The Bullmastiff is a breed of dog that was bred from crossing the Bulldog and the Mastiff. The Bullmastiff was developed in the 1800's on the great estates of England, which wanted a dog smaller and more agile than the Mastiff that would remain quiet until the gamekeeper needed it. The result was a fearless dog that made an excellent guard against poachers.",
      "heightAtShoulder": {
        "males": "24-27",
        "females": "23-26 in."
      },
      "weight": {
        "males": "100-130",
        "females": "90-120 lbs."
      },
      "grooming": "The Bullmastiff has a short dense coat that is very easily maintained without any shedding.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "Clearly the Bullmastiff is an excellent guard dog and a companion. He is also a good watchdog. He is very protective of his family and especially kids.",
      "trainingTip": "Bullmastiffs can be stubborn if training begins to late. Begin early, at about three months old.",
      "housebreaking": "These dogs housebreak well when taught early in life.",
      "aestheticQuality": "Majestic and wise expression like he knows everything and understands everything going on around him.",
      "personality": "Bullmastiffs have intelligent, dominant personalities but surprisingly enough get along well with children. They love to play and romp with older kids. Most little children would have a hard time holding their own. The city suits this breed as well as the country. They are moderately active indoors and out. Bullmastiffs are popular, so look for a well-bred puppy."
    },
    {
      "name": "Doberman Pinscher",
      "images": "dogs-195/18-doberman-pinscher.jpg",
      "origin": "The Doberman Pinscher originated in Germany. It is named after Louis Doberman, a German dog breeder. He first developed the dogs in the late 1800's.",
      "heightAtShoulder": {
        "males": "26-28",
        "females": "24-26 in."
      },
      "weight": {
        "males": "60-75",
        "females": "55-70 lbs."
      },
      "grooming": "A Doberman's short, smooth coat is easily maintained without hardly any brushing at all. After bathing the dog and brushing him, he will look sleek and shiny. Hardly no shedding at all.",
      "cost": "Expensive",
      "capabilities": "Dobermans are strong and muscular, with great speed and endurance. They are alert and fearless and make good guard dogs and Police dogs. Dobermans can make great affectionate, loyal pets.",
      "trainingTip": "Dobermans are very stubborn and playful. Be firm, authoritative and consistent. Begin early and give firm corrections. This is a very strong breed that needs proper training.",
      "housebreaking": "This chore is sometimes difficult. Dobermans need frequent walks, strict schedules and an early beginning. They are impervious to punishment, but strict adherence to the obedience course will create self-discipline necessary for successful housebreaking.",
      "aestheticQuality": "Known for their black and red or fawn(tan), with rust-colored markings",
      "personality": "The Doberman can be great for children because they are going to watch them and protect them. They have lots of energy and will play as long as the kids want to play."
    },
    {
      "name": "Giant Schnauzer",
      "images": "dogs-195/67-giant-schnauzer.jpg",
      "origin": "The Giant Schnauzer is a breed of dog developed in the 17th century in Germany. It is the largest of the three breeds of Schnauzerthe other two breeds being the Standard Schnauzer and the Miniature Schnauzer.",
      "heightAtShoulder": {
        "males": "26-28",
        "females": "25-27 in."
      },
      "weight": {
        "males": "60-110",
        "females": "55-75 lbs."
      },
      "grooming": "This breed has a medium-length outer coat and the heavy undercoat, both of which shed all year round. In the late spring and early fall they shed heavily to prepare for the change of season. This heavy shedding is a form of natural dry cleaning for these white dogs. Regular brushing to remove the loose fur is most important.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "The Giant Schnauzer is a very alert and responsive dog. They make great guard dogs and they very Loyal to their families. They will guard and watch younger children as well as older ones. They love playing with kids and interacting with them and their families",
      "trainingTip": "The Giant Schnauzer is very responsive and willing to please, so the training should not be difficult. Be gentle and patient. This breed is very sensitive to harsh treatment. They respond best to generous praise.",
      "housebreaking": "Housebreaking should be fairly easy, start early and be persistent.",
      "aestheticQuality": "Their long beard like fur on face.",
      "personality": "The Giant Schnauzer can be great for children because they are going to watch them and protect them. They have lots of energy and will play as long as the kids want to play."
    },
    {
      "name": "Great Dane",
      "images": "dogs-195/15-great-dane.jpg",
      "origin": "This giant breed was mentioned in eighteenth-century European animal studies and most likely existed before that. It was used to hunt the ferocious wild boar. At that time the French called it the Great Dane, although the dog does not have any connection with Denmark. Concentrated breed development of the Great Dane took place in Germany in the nineteenth century where it is called Deutsche Dogge(German Mastiff).",
      "heightAtShoulder": {
        "males": "30+",
        "females": "28+ in."
      },
      "weight": {
        "males": "135-150",
        "females": "120-135 lbs."
      },
      "grooming": "Occasional brushing is all a Dane needs. There is some shedding but the coat is short.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "Danes make good watchdogs but not guard dogs.",
      "trainingTip": "Sometimes sensitive, sometimes stubborn, these dogs need a lot of praise. Be gentle and coaxing, not harsh.",
      "housebreaking": "They housebreak well if taught early.",
      "aestheticQuality": "Majestic, graceful, and dignified.",
      "personality": "Danes must be exercised outdoors every day whether they feel like it or not. Most living situations will do because Danes are so easy and agreeable. They do well in the city and can even adapt to even small apartments, but more space is desirable. Children could have trouble with the dog's desire to lean on those he likes: a child cannot support a 150-pound dog. But if the dog is taught not to lean from the very beginning, the problem can be avoided. These are not very active dogs, so they are good with small children. Very large dogs have shorter life spans."
    },
    {
      "name": "Great Pyrenees",
      "images": "dogs-195/70-great-pyrenees.jpg",
      "origin": "The Great Pyrenees originated in the Pyrenees Mountains of France. The Great Pyrenees has been around a long, long time, perhaps 4,000 years, going back to ancient Celts.",
      "heightAtShoulder": {
        "males": "24-27",
        "females": "23-26 in."
      },
      "weight": {
        "males": "90-125",
        "females": "90-125 lbs."
      },
      "grooming": "The Great Pyrenees pure-white coat grows long and fluffy. So it needs a lot of brushing and grooming. They do shed heavily twice a year.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "The Great Pyrenees makes a excellent guard dog of both livestock and family, exspecially kids.",
      "trainingTip": "The Great Pyrenees has no problem learning and doing what is taught to him. He has a strong will and very active personality.",
      "housebreaking": "Begin early and stick to the schedule rigidly.",
      "aestheticQuality": "A massive white bear.",
      "personality": "The Great Pyrenees is great with kids as long as he was raised with them from puppyhood, but is reserved with strangers; however, he has no problem with strange dogs."
    },
    {
      "name": "Greater Swiss Mountain Dog",
      "images": "dogs-195/76-greater-swiss-mountain-dog.jpg",
      "origin": "The Greater Swiss Mountain Dog is a dog breed which was developed in the Swiss Alps. The name Sennenhund refers to people called Senn or Senner, dairymen and herders in the Swiss Alps.",
      "heightAtShoulder": {
        "males": "26-28",
        "females": "24-27 in."
      },
      "weight": {
        "males": "130-150",
        "females": "110-130 lbs."
      },
      "grooming": "The Bernese does shed, though not excessively. A good brushing once or twice a week will keep its coat in good shape.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "Clearly the Greater Swiss Mountain Dog is an excellent guard dog and a companion. He is also a good watchdog.",
      "trainingTip": "The Greater Swiss Mountain Dog is very responsive and willing to please, so the training should not be difficult. Be gentle and patient. This breed is very sensitive to harsh treatment; they are fearless dogs. They respond best to generous praise.",
      "housebreaking": "Housebreaking should be fairly easy, start early and be persistent.",
      "aestheticQuality": "Big, sturdy black dog with white face and chest.",
      "personality": "Children and adults combined of any age will be happy with a Greater Swiss Mountain Dog. They tend to lean on the people they love and they are very loyal to them. They are gentle, even-tempered and patient and love being around their families. They don't really need a lot of exercise or outdoor activity but they thrive in that situation."
    },
    {
      "name": "Komondor(KOH mahn dawr)",
      "images": "dogs-195/178-komondor.jpg",
      "origin": "The Komondor is a breed of dog that was raised for centuries to guard livestock on the Hungarian plains. This large white dog is thought to have been brought to Hungary from Central Asia by the Magyars in the 800's.",
      "heightAtShoulder": {
        "males": "30",
        "females": "28 in."
      },
      "weight": {
        "males": "150",
        "females": "100 lbs."
      },
      "grooming": "A full-grown Komondor is covered with a heavy coat that falls toward the ground in cords. It needs a lot of brushing and grooming.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "An owner can ask his Komondor to guard the house and children, to warn of approaching strangers, to haul loads on a cart, or to sit back and play with the kids and have a good time.",
      "trainingTip": "These dogs are very intelligent and sensitive. They do not need harsh or loud corrections. A gentle voice and a patient manner will work wonders for the Komondor. Praise them as soon as they have obeyed a command and be generous with the praise. Training need not begin at a terribly early age, but solcializing should.",
      "housebreaking": "These dogs housebreak well when taught early in life.",
      "aestheticQuality": "Their size and coat that looks like a mop.",
      "personality": "The Komondor can be great for children because they are going to watch them and protect them. They have lots of energy and will play as long as the kids want to play."
    },
    {
      "name": "Hungarian Kuvasz(KOO vahs)",
      "images": "dogs-195/177-hungarian-kuvasz.jpg",
      "origin": "The Kuvasz is a large powerful dog. The Kuvasz was chiefly developed in Hungary. The name comes from a Turkish word that means armed guard of the nobility. The Kuvasz has a broad, muscular body but walks with a light-footed gait.",
      "heightAtShoulder": {
        "males": "29",
        "females": "27 in."
      },
      "weight": {
        "males": "115",
        "females": "90 lbs."
      },
      "grooming": "The Kuvasz pure-white coat grows long long on the neck and the back of the hind legs. So it needs a lot of brushing and grooming once in a while.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "Kuvasz make good watchdogs and guard dogs.",
      "trainingTip": "These dogs are very intelligent, sensitive, and very loyal. They do not need harsh or loud corrections. A gentle voice and a patient manner works wonders for the Kuvasz because he is a very responsive dog.",
      "housebreaking": "Housebreaking should be fairly easy, start early and be persistent.",
      "aestheticQuality": "Luxurious, thick, white fur coat.",
      "personality": "The Kuvasz can be great for children because they are going to watch them and protect them. They have lots of energy and will play as long as the kids want to play."
    },
    {
      "name": "Mastiff",
      "images": "dogs-195/33-mastiff.jpg",
      "origin": "If you want a large dog, look no further than the Mastiff. He has long been renowned as a guard dog and fighting dog. Indeed, Caesar is said to have admired the way the breed fought by its originators' side. There are many tall tales about Mastiffs fighting creatures such as Elephants and Lions.",
      "heightAtShoulder": {
        "males": "28-32",
        "females": "26-28 in."
      },
      "weight": {
        "males": "120-150",
        "females": "100-130 lbs."
      },
      "grooming": "The Mastiff does shed a little but not that much, so some brushing would help.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "The are great guard dogs and protectors of their families.",
      "trainingTip": "They like to pull people, too. Training must begin early. These are strong, stubborn dogs that need convincing. They ignore punishment, so firm, consistent obedience training is very important.",
      "housebreaking": "These dogs housebreak well when taught early in life.",
      "aestheticQuality": "A massive dog who loves to play.",
      "personality": "The Mastiff is great with kids as long as he was raised with them from puppyhood, but is reserved with strangers; however supervise small kids with the Mastiff because he is a big dog."
    },
    {
      "name": "Newfoundland",
      "images": "dogs-195/41-newfoundland.jpg",
      "origin": "This breed was developed on the northeastern island of Newfoundland to help the fishermen with their nets, save shipwrecked men, haul heavy loads, and protect the children. The 'Neuf' performs all of these tasks to perfection. There are no record of what dogs went into the breeding of the Newfoundland several hundred years ago, but they must have been imported, because there were no dogs native to the American continent.",
      "heightAtShoulder": {
        "males": "28",
        "females": "26 in."
      },
      "weight": {
        "males": "150",
        "females": "120 lbs."
      },
      "grooming": "This breed has a medium-long outer coat and a heavy undercoat, both of which shed year round. In the late spring and early fall they shed heavily to prepare for the new season. A lot of brushing is necessary.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "Technically Newfoundlands are not guard dogs because they won't naturally protect buildings or boundaries, but they will usually come to the protection of their children. Neufs are truly canine nannies. They will also function as watchdogs.",
      "trainingTip": "The Newfoundland is very responsive and willing to please, so the training should not be difficult. Be gentle and patient. This breed is very sensitive to harsh treatment; it makes them shy. They respond best to generous praise.",
      "housebreaking": "No problem.",
      "aestheticQuality": "A massive black bear.",
      "personality": "Although they are quite large, they are splendid with toddlers as well as older kids. Neufs are always affectionate. They love water almost as much as they love their families. If possible, swimming is the best exercise for these big, happy, reliable dogs. Such large animals needs a large home, but it can be in the city or the country. They are inactive indoors like most large breeds and like most large breeds they have a short life expectancy."
    },
    {
      "name": "Portuguese Water Dog",
      "images": "dogs-195/49-portuguese-water-dog.jpg",
      "origin": "The Portuguese Water Dog originated from the Algarve region of Portugal. From there the breed expanded to all around Portugal's coast, where they were taught to herd fish into fishermen's nets, retrieve lost tackle or broken nets, and act as couriers from ship to ship, or ship to shore.",
      "heightAtShoulder": {
        "males": "20-22",
        "females": "17-20 in."
      },
      "weight": {
        "males": "40-60",
        "females": "33-49 lbs."
      },
      "grooming": "The Portugese Water Dog has a real curly dense coat that needs brushing daily and professional grooming a couple times a year.",
      "cost": "Expensive",
      "capabilities": "Portugese Water Dog make good watchdogs and companions.",
      "trainingTip": "Begin early and be persistent. The Portugese Water Dog is a very intelligent dog but he can be quarrelsome with other dogs.",
      "housebreaking": "Begin early and stick to the schedule rigidly.",
      "aestheticQuality": "Their Poodle like looks because some people styles its coat like they do poodles.",
      "personality": "The Portugese Water Dog can be great for children because they are going to watch them and protect them. They have lots of energy and will play as long as the kids want to play."
    },
    {
      "name": "Rottweiler",
      "images": "dogs-195/8-rottweiler.jpg",
      "origin": "The Rottweiler (/rtwalr/, UK also /-valr/, German: [tval] ) is a breed of domestic dog, regarded as medium-to-large or large. The dogs were known in German as Rottweiler Metzgerhund, meaning Rottweil butchers' dogs, because their main use was to herd livestock and pull carts laden with butchered meat to market. This continued until the mid-19th century when railways replaced droving. Although still used to herd stock in many parts of the world, Rottweilers are now also used as search and rescue dogs, guard dogs, and police dogs.",
      "heightAtShoulder": {
        "males": "24-27",
        "females": "22-25 in."
      },
      "weight": {
        "males": "110-132",
        "females": "77-105 lbs."
      },
      "grooming": "Rottweiler coats tend to be low maintenance, although they experience heavy shedding before their seasons (females) or seasonally (males). According to American Kennel Club breed standards, a Rottweiler's coat is short and straight.",
      "cost": "Expensive",
      "capabilities": "Rottweiler breeders aim at a dog of abundant strength, black coated with clearly defined rich tan markings, whose powerful appearance does not lack nobility and which is exceptionally well suited to being a companion, service, rescue and working dog.",
      "trainingTip": "They like to pull people, too. Training must begin early. These are strong, stubborn dogs that need convincing. They ignore punishment, so firm, consistent obedience training is very important.",
      "housebreaking": "Begin early and stick to the schedule rigidly.",
      "aestheticQuality": "Rottweilers are very distinctive.",
      "personality": "The Rottweiler which is exceptionally well suited to being a companion, service, rescue and working dog. The are great guarddogs because they are going to protect their family. They also love kids when they grow up with the kid and raised with them."
    },
    {
      "name": "St. Bernard",
      "images": "dogs-195/52-st-bernard.jpg",
      "origin": "The St. Bernanrd achieved fame as the dog of choice at a refuge for people who traveled the treacherous, snowy paths through the Alps between Switzerland and Italy. It is estimated that they have been responsible for rescuing over 2,000 people.",
      "heightAtShoulder": {
        "males": "26-30",
        "females": "24-28 in."
      },
      "weight": {
        "males": "110-140",
        "females": "100-130 lbs."
      },
      "grooming": "The St. Bernard sheds a lot and he needs a lot of brushing.",
      "cost": "Very Expensive, to acquire and feed.",
      "capabilities": "The St. Bernard is an excellent guard dog and a companion. He is also a good watchdog. He is very protective of his family and especially kids.",
      "trainingTip": "Begin early and be persistent. The St. Bernard is a very intelligent dog but he can be quarrelsome with other dogs.",
      "housebreaking": "They housebreak well if taught early.",
      "aestheticQuality": "The gentle giant.",
      "personality": "The St. Bernard is so happy and sweet natured with their family and children, and loves to play around. They are large dogs, so they can withstand rough and tumble treatment from young or active children. The St. Bernard sleeps a lot so they really don't need a lot of exercise."
    },
    {
      "name": "Samoyed",
      "images": "dogs-195/56-samoyed.jpg",
      "origin": "The Samoyed people live in northwest Russia, near Finland, with their happy, laughing, white dogs. The people and the dogs have lived there longer than recorded history. These dogs have herded reindeer, pulled heavy loads on sleds, and protected their families while maintaining their phenomenal good spirit. They are much admired for their sumptuous white fur.",
      "heightAtShoulder": {
        "males": "21-24",
        "females": "19-21 in."
      },
      "weight": {
        "males": "50-75",
        "females": "40-55 lbs."
      },
      "grooming": "This breed has a medium-length outer coat and the heavy undercoat, both of which shed all year round. In the late spring and early fall they shed heavily to prepare for the change of season. This heavy shedding is a form of natural dry cleaning for these white dogs. Northern dogs have strong wheather-resistant coats that tend to stay cleaner than other breeds. If they have romped through mud, just clean the dirty area and keep the regular baths to a minimum. Regular brushing to remove the loose fur is most important.",
      "cost": "Moderate",
      "capabilities": "The Samoyed is a good watchdog but not a guard dog. They do like to pull sleds.",
      "trainingTip": "They like to pull people, too. Training must begin early. These are strong, stubborn dogs that need convincing. They ignore punishment, so firm, consistent obedience training is very important.",
      "housebreaking": "Begin early and stick to the schedule rigidly. Be patient. Reward success every time; admonish failures, but don't bother punishing. Samoyeds have trouble with housebreaking, but eventually they succeed.",
      "aestheticQuality": "Luxurious, thick, white fur coat.",
      "personality": "The Samoyed is a very happy, playful, active animal. He is slightly calmer than the Siberian Husky, so he is better for younger children, but with supervision. Samoyeds are happiest in large apartments or houses. This dog needs a lot of exercise inside and out, but he does seem to do well in the city."
    },
    {
      "name": "Siberian Husky",
      "images": "dogs-195/16-siberian-husky.jpg",
      "origin": "The Chukchi natives bred the Siberian Husky to pull sleds over the long expanses of snow and ice in the Russian northeast. These dogs work in teams to pull light loads over incredible distances. They are very popular at sled dog races in the United States and Canada.",
      "heightAtShoulder": {
        "males": "21-24",
        "females": "20-22 in."
      },
      "weight": {
        "males": "45-60",
        "females": "35-50 lbs."
      },
      "grooming": "The harsh outer coat and the heavy undercoat, shed all year long. In the late spring and early fall they shed heavily to prepare for the new season. The heavy shedding and the dog's natural habit of cleaning himself somewhat like a cat make frequent baths unnecessary.",
      "cost": "Moderate",
      "capabilities": "Pulling sleds and playing are the Siberian's talents. Guarding or watching are out of the question. They don't even bark, they howl.",
      "trainingTip": "Siberians are very stubborn and playful. Be firm, authoritative and consistent. Begin early and give firm corrections. This is a very strong breed.",
      "housebreaking": "This chore is sometimes difficult. Siberians need frequent walks, strict schedules and an early beginning. They are impervious to punishment, but strict adherence to the obedience course will create self-discipline necessary for successful housebreaking.",
      "aestheticQuality": "Mischievous Wolf.",
      "personality": "These happy, happy dogs need to run, play, and see people and lots of children. They are entergetic, medium-sized dogs that seldom calm down. Small children would be overwhelmed. Huskies hate to be left alone. Huskies do best in large apartments or houses where ther is room for all of that energy, but many Huskies have adjusted to city life."
    },
    {
      "name": "Standard Schnauzer",
      "images": "dogs-195/92-standard-schnauzer.jpg",
      "origin": "The Schnauzer or Mittelschnauzer is a German breed of dog in the Pinscher and Schnauzer group. It is characterised by an abundant bristly beard and whiskers, usually lighter than the coat.",
      "heightAtShoulder": {
        "males": "19-20",
        "females": "18-19 in."
      },
      "weight": {
        "males": "31-44",
        "females": "31-44 lbs."
      },
      "grooming": "The Standard Schnauzer does shed, though not excessively. A good brushing once or twice a week will keep its coat in good shape. Also you may want to take them to a professional groomer once or twice a year.",
      "cost": "Very Expensive",
      "capabilities": "Intelligent, lively, good-natured, devoted, playful, and trainable.",
      "trainingTip": "The Standard Schnauzer is very responsive, trainable, and willing to please, so the training should not be difficult. Be gentle and patient. They respond best to generous praise.",
      "housebreaking": "There should be no problems at all.",
      "aestheticQuality": "Abundant bristly beard and whiskers.",
      "personality": "The Standard Schnauzer is so happy and sweet natured with their family and children, and loves to play around. They are medium sized dogs, so they can withstand rough and tumble treatment from young or active children."
    }
  ]
}]