[
    {
        "category": "Specialty",
        "trainingInfo": [
            {
                "name": "An Overview of Events",
                "description": "If your dog masters a variety of tricks for fun at home, it might be time to think about getting involved in Specialty advanced dog-sport events. There are many different types of dog sports (both competitive and noncompetitive) that you and your pooch can participate in, and it's not difficult to find classes for all of these activities. Ask your trainer if he or she offers such classes (As Myself), contact your local breed club, check the offerings at your local community college, or search the internet. Before you sign up for a class in a particular dog sport, be sure your dog is ready to preform. As is true in the case of all of the tricks described throughout this site and up to this point, your dog must know and respond to Basic Obedience commands in order to participate in these sports. If you have to call him several times before he comes or if he won't sit or lie down the first time you tell him to do so, a little remedial work at home or in a class is in order before trying a dog sport.",
                "steps": [
                    {
                        "step": "The American Kennel Club sanctions a variety of events that will keep you and your dog young and healthy for many years to come. Sometimes, these performance events are very general in their competition; other times, they are breed- or group-specific. The AKC events are for purebred dogs only, but other organizations allow any breed or mixed breed to compete."
                    },
                    {
                        "step": "All of these events are a lot of fun to compete in but if true competition isn't for you, perhaps you can find a club or training facility that offers regular practice matches for you to participate in. The following are just some of the organized events that you can participate in:"
                    },
                    {
                        "step": "Obedience Trials"
                    },
                    {
                        "step": "Agility Trials"
                    },
                    {
                        "step": "Tracking"
                    },
                    {
                        "step": "Field Trials and Hunting Tests"
                    },
                    {
                        "step": "Herding"
                    },
                    {
                        "step": "Lure Coursing"
                    },
                    {
                        "step": "Earthdog Tests"
                    }
                ]
            },
            {
                "name": "What About Mixed Breeds?",
                "description": "Don't worry if your dog is not purebred. There are other organizations besides the AKC that sponsor different competitiveevents. Mixed breeds are eligible to compete in agility trials sponsored by Canine Performance Events, USDAA, and NADAC, for instance. If you find that your mixed-breed dog has a talent for a particular sport, do some research and find out if there are any sponsored events for that activity in your area. The following sections provide a breif overview of sporting events for dogs, many of which incorporate performing fun and interesting tricks. So if you and your dog are ready to take center stage and strut your stuff in public, then read on!"
            },
            {
                "name": "Obedience Trials",
                "description": "The idea of obedience is to help meld you and your dog into a good working team. Obedience Trialing is a rewarding endeavor that doesn't require extensive travel or a lot of money investment. Anyone can participate in the sport of dog obedience-desire is far more important than natural talent. People of all ages and physical conditions can become top competitors, and dogs of all breeds and backgrounds (rescued and formerly abused dogs, too) appear in the winner's circle. Handlers who participate in obedience trianing will experience the rewards of a better-trained dog as well as the camaraderie with peers-and maybe even the thrill of earning an occasional title. Obedience trials test and score a dog's ability to perform specific exercises. The American Kennel Club sanctions the majority  of these events. The AKC has more than 13,000 field trial, obedience, and other specialty clubs, and hundreds of AKC-sanctioned dog shows occur every week all over the United States. Trials governed by the United Kennel Club, States Kennel Club, and others are also quickly gaining popularity. Regardless of which kennel club is governing, the rules are nearly identical, or involve only minor variations, so little additional training is required to earn more titles. In AKC and most other obedience competitions, dogs work toward titles in three levels, each progressively more difficult. The classes, titles, and general summary of requirements are as follows:",
                "steps": [
                    {
                        "step": "Novice - Companion Dog (CD): This level includes on- and off-leash heeling, recall and stand, sit and down stay. Novice is the only class in which the dog is leashed for part of the performance and, when the leash is removed, the handler can guide the dog by the collor while moving from one exercise to the next."
                    },
                    {
                        "step": "Open - Companion Dog Excellent (CDX): This level involves commands such as drop on recall, retrieve on flat, retrieve over high jump, broad jump, and sit and down stays with the handler out of sight."
                    },
                    {
                        "step": "Utility - Utility Dog (UD): This category tests hand signals, scent discrimination, moving stand, and directed jumping and retrieving."
                    }
                ],
                "variables": {
                    "topic": "Open and Utility are considered the advanced classes. In these, the leash is removed as the team enters the ring. The dog is never touched, except to be measured or praised. In order to earn a title in each level the dog must earn three qualifying scores. A perfect score is 200 points, and to qualify a dog must earn 170 points and 50 percent of the available points for each exercise. Dogs who earn a UD are eligible to compete for two other obedience titles. The UDX (Utility Dog Excellent) is earned when the dog qualifies in Open and Utility class at the same show ten times. After a dog accumulates one hundred points, he wins the OTCh (Obedience Trial Championship). A dog earns points if he places first or second in Open or Utility, and the size of the class determines the number of points earned.",
                    "howTo": [
                        "This is the only competitive obedience title (Obedience Trials), meaning a dog earns points by defeating other dogs, rather than simply performing exercises in accordance with the rulebook. Special competitions, otherwise known as tournaments, are held for the best of the best. In order to enter, the dog must prove himself at AKC or other kennel-club sanctioned events. Top obedience dogs are ranked each year using various systems designed by breed clubs, obedience clubs, and obedience publications such as Front and Finish, or The Dog Trainer's News. Although these aren't official designations, they're esteemed and sought after.",
                        "American Kennel Club competitions are limited to purebred registered and ILP (indefinite listing privilege) dogs, but many other governing bodies allow mixed breeds to compete. All obedience competitions allow spayed and neutered dogs to participate. If you'd like to observe an Obedience Trial, call local training clubs (listed in the yellow pages or on the internet.) or browse dog show superintendents' pages on the internet."
                    ]
                },
                "tips": [
                    "Learning More About Obedience Trials: - For information about Obedience Trials, check out The American Kennel Club Web site, at 'www.akc.org', or the United Kennel Club Web site, at 'www.ukcdogs.com'. You're likely to find events several times a each month that take place within easy driving distance from where you live."
                ]
            },
            {
                "name": "Agility Trials",
                "description": "This fun, fast-paced sport stresses teamwork, expert training, and athleticism. Agility requires the dog -directed by his handler- to navigate a series of obstacles, such as A-frames, balance beams, tunnels, and weave poles, as well as different types of jumps -through tires, hoops, or over single or double bars, for instance. In Agility Trials, classes are divided by jump heights determined by the dog's height at the shoulder. The judge determines the order of the obstacles, and handlers are allowed to walk the course for ten minutes prior to the beginning of their class (without their dogs) to plan their strategy. This is a timed event where the dog and handler must complete the course in order within the predetermined amount of time in order to receive a qualifying score. Point deductions in the form of wrong courses and faults are deducted from a total score of 100. Each level allows a certain number of faults and wrong courses to the handler and dog; the higher the level the more perfect the performance must be. In AKC Agility, there are four levels of competition:",
                "steps": [
                    {
                        "step": "Novice Agility - The title you earn is NA."
                    },
                    {
                        "step": "Open Agility - The title you earn is OA."
                    },
                    {
                        "step": "Agility Excellent - The title you earn is AX."
                    },
                    {
                        "step": "Master Agility Excellent - The title you earn is MX."
                    }
                ],
                "variables": {
                    "topic": "Recently, the AKC has added another category called Preferred for dogs who are unable to jump their full height due to their age or their owners' preference. Dogs competing in this performance class jump in the next lower category for their height. The letter P comes after each of their titles; NAP is novice agility preferred.",
                    "howTo": [
                        "In order to earn a title, your dog must attain three qualifying scores, referred to as legs. The score is 100 points, dogs are judged on speed and accuracy, and infractions are deducted from 100. First through fourth place is awarded to dogs who have the highest scores by their course times.",
                        "Dogs who enjoy being athletic and have a strong learning ability and a willingness to please make good Agility prospects. If your dog has the ability to think for himself but also takes direction well, that's a plus in this sport, too. Even if your dog doesn't have the speed of top Agility breeds, such as the Border Collie, he can still be capable of solid, consistent Agility performance.",
                        "Before starting Agility training, your dog should know and respond to basic commands including Sit, Down, Stay, and Come/Here. Even young puppies can begin to learn elements of Agility, such as going through tunnels, balancing on the teeter-totter, and negotiating the A-frame set a low height. You should avoid teaching your puppy to jump higher than elbow height (theirs, not yours) until they reach physical maturity at eighteen months of age.",
                        "Agility is fast becoming one of the most popular of all dog sports, because it's tremendous fun. It's always an exceptional show, so you and your dog are sure to be entertained whether you decide to compete or not."
                    ]
                },
                "tips:": [
                    "Seeking out Agility Competitions: - If you're intrested in Agility, check out Organizations such as American Kennel Club, The United States Dog Agility Association, The North American Dog Agility Council, and the United Kennel Club. They all sponser Agility competitions. (Titles and rules vary from Organization to Organization.)",
                    "Do a Health Check: - As with any sport, a dog who competes in Agility must be in excellent physical condition. Take your dog in for a Veterinary exam before beginning training. Health conditions such as Hip Dysplasia or other Musculoskeletal problems, decreased vision, heart problems, and Obesity preclude participation in Agility."
                ]
            },
            {
                "name": "Tracking",
                "description": "Tracking requires not just a good nose, but an understanding of what is required in what can be a serious profession. Teach your dog to track, and you'll have a dog with a useful skill, as well as a new way to enjoy the outdoors with him. Your dog can earn an AKC tracking title by completing a single successful track. By following a human scent trail, dogs can earn several titles:",
                "steps": [
                    {
                        "step": "Tracking Dog - The title you earn is TD."
                    },
                    {
                        "step": "Tracking Dog Excellent - The title you earn is TDX."
                    },
                    {
                        "step": "Variable Surface Tracking - The title you earn is VST."
                    }
                ],
                "variables": {
                    "topic": "To earn a title in this field your dog has to complete the following requirements for an AKC Tracking title that is offered in this competiton:",
                    "howTo": [
                        "For the TD test, the track is 440 to 500 yards long, with a minimum of two right-angle turns. It must be half an hour to two hours old. The per4son laying the track must be unfamiliar to the dog. At the end of the track, the person laying the track drops a scent article, which the dog must locate. The TDX track is longer, older (three to five hours), more complicated, and includes more varied terrian, such as ditches, stream beds, and tall grass. It's length is 800 to 1,000 yards, and it has several turns and two cross tracks. Along the way, there are also dummy scent articles meant to lure your dog off the trail.",
                        "TD and TDX tests usually take place in rural areas, but the VST tests a dog's tracking ability in more developed locales, such as suburban neighborhoods or city streets. The length of a VST track is 600 to 800 yards, and it goes over three types of surfaces, such as asphalt, concrete, grass, gravel, or sand. To add to the difficulty, a portion of the track must lack vegetation, which helps to hold scent. The track must be three to five hours old with four to eight turns. A dog who passes all three tests earns the title Champion Tracker (CT).",
                        "This competition is open to all breeds, and it's surprising how many breeds participate. Although many people work at Tracking with their dogs just as a hobby, some dogs who start out in this competition go on to search-and-rescue or police work."
                    ]
                }
            },
            {
                "name": "Fieldwork",
                "description": "Field Trials and Hunting Tests are performance events that individual dog clubs sponsor. They are held under AKC rules and regulations but are put on by the sponsoring club. This means they are always in the market for volunteers to help them run a smooth trial. If this is an area of intrest to you and you'd like to find out more, offer to help at a trial to see what it's like.",
                "steps": [
                    {
                        "step": "Field Trials and Hunting Tests are performance events aimed at the Sporting Group (and a few Hounds). These events evaluate a dog's ability to retrive game (the function for which some dogs, such as Golden and Labrador Retrievers, were originally bred). Fieldwork is a great opportunity for these sorts of breeds that have natural retrieving tendencies to show their abilities and earn titles. This sport involves retrieving lots of fallen birds, some of which are already dead (thrown by helpers to simulate being shot). Puppies who show retrieving instinct early can be introduced to birds as soon as eight to nine weeks of age. Teaching your dog to retrieve fallen birds requires that your dog have a basic knowledge of the retrieve. As always, a dog should also be familiar with basic commands. Commands such as Sit, Down, Stay, Heel, and Come/Here form the foundation for Hunting training. A dog should also be trained to remain quiet until given further instructions, because barking and whining are penalized and can even cause a dog to be eliminated from the stake."
                    },
                    {
                        "step": "Field-trial preperation also involves conditioning, to make sure a dog is in good shape for the amount of work he'll be doing. If you're intrested in Field Trials, you should work your dog gradually until he's able to walk or run for several miles a day."
                    },
                    {
                        "step": "When teaching your dog to do fieldwork, keep in mind it's a bad idea to let his first experience with retrieving be something that's a dead, smelly bird that he would much rather roll on than put it in his mouth. You might start with a Bumper (a cylindrical plastic or canvas training aid) or a plastic model of a dead duck. The benefit to this is that you don't have to keep thawing out or re-freezing dead birds, which tend to smell quite ripe after a while. Using the shaping tools and steps for retrieving already described in Advance, choose one of these objects as your starter. When your dog is willingly picking up and holding the Bumper or plastic bird dummy, switch it for the real thing and start again."
                    },
                    {
                        "step": "Once your dog learns how to retrieve the bird, it's then your job to think up as many circumstances as possible that he will encounter in his field career. The birds he's supposed to retrieve might be hidden in tall grass or in bushes. Sometimes they will be waterlogged and hardly breaking the water surface. Your dog will have to retrieve in all kinds of weather and despite distractions like birds flying overhead, gunshots, or other working dogs. Teach him to pick up the bird under as many of these circumstances as you can."
                    }
                ],
                "variables": [
                    {
                        "topic": "Field-Trial Specifics",
                        "howTo": [
                            "A good Retriever is able to follow the trajectory of a shot bird and find where it landed. He isn't afraid to go after a bird, no matter where it is, and he retrieves with style. He pays attention to his handler, has a good sense of smell, and doesn't shy away from the sound of gunfire. Retrievers should perform equally well on land and in water. Just as important, a good Retriever has a soft mouth, meaning he doesn't damage the bird during the retrieve. Retrievers are judged on their ability to mark, or remember, the location of downed birds, retrieve them quickly, and then deliver them gently to their handlers.",
                            "Dogs compete against each other for placements and points toward a field championship. The titles that can be earned are:",
                            "Amateur Field Champion (AFC)",
                            "Field Champion (FC)",
                            "Once earned, these titles become part of the dog's name. For instance, a dog with a field championship would have a registered name that looks like this: FC Johnny Boy.",
                            "To participate, dogs must be atleast six months old and registered with the AKC. Field Trial classes, known as stakes, test dogs of varying ages and levels of experience. Stakes also separate amateur and professional handlers. Retriever Field Trials have four stakes, two major and two minor. The major stakes are classified as open all-age and amateur all-age; the minor stakes are classified as qualifying and derby. Championship points are earned in the two major stakes, with at least two judges officiating."
                        ]
                    },
                    {
                        "topic": "Hunt-Test Specifics",
                        "howTo": [
                            "Hunting Tests are a means of judging a dog's ability to perform against a standard of perfection established by the AKC regulations. Unlike Field Trials, they are noncompetitive, meaning the dogs must simply meet a standard of performance, rather than beat other dogs. Dogs who recieve qualifying scores at a given number of tests can earn the following titles:",
                            "Junior Hunter (JH)",
                            "Senior Hunter (SH)",
                            "Master Hunter (MH)",
                            "Each successive title requires more skill, and dogs are judged more strictly as they advance. Once a dog has qualified at a higher level, she cannot move back to a lower level.",
                            "Beginners start with marked birds, meaning they can see the bird or bumper fly and fall. They must then stay until the handler gives the command to retrieve the bird. As the dog advances, Hunting Tests become more difficult, but at all levels the dog is usually not required to retrieve from a distance greater than 100 yards.",
                            "If you're intrested in getting started with Hunting Tests, join a local club. By training with a group, you'll benefit from the experiences of other people and learn a variety of training techniques."
                        ]
                    }
                ],
                "tips:": [
                    "Field Trial Eliminations: - Be sure your dog is prepared for just about anything in this sport. Dogs can be eliminated from trials for such behaviors as failure to enter rough cover, water, ice, mud, or any other unpleasant or difficult situation; returning to the handler before finding a bird in a marked retrieve; stopping the hunt; repeated evidence of poor scenting ability; or failing to pick a bird up after finding it."
                ]
            },
            {
                "name": "Herding",
                "description": "Not surprisingly, Herding is aimed at the Herding group. The relationship with herding dogs is one of the oldest relationships humans have. Herding-Trial exercises are used to gauge the development of what is still a very important job for many herding dogs. Although Herding is more about work than performing tricks, it's included here because it's also a lot of fun. The AKC seperates herding dogs into four district groups:",
                "steps": [
                    {
                        "step": "Shepherd: - These dogs are usually used with sheep and typically lead a flock."
                    },
                    {
                        "step": "Drover: - These dogs work livestock from behind, usually sheep or cattle."
                    },
                    {
                        "step": "Livestock Guarding: - These dogs don't move livestock; they guard it from other predators."
                    },
                    {
                        "step": "All-Round Farm Dogs: - These dogs usually can respond quickly to different situations and can perform a number of different jobs."
                    }
                ],
                "variables": {
                    "topic": "To earn a title in this field your dog has to complete the following requirements for an AKC Herding-Trial Certificate that is offered in this category:",
                    "howTo": [
                        "The first few exercises are called tests. These test the general inborn instincts of your animal and his ability to be trained. After that, You're off to the pasture. There are six different levels to achieve. The first two tests are:",
                        "Herding Tested (HT)",
                        "Pre-Trail Tested (PT)",
                        "In these levels, your dog's abilities are judged, again, based on inborn reaction as well as certain trained functions. The next levels are progressively harder. The idea is that a dog must keep ducks, sheep, or cattle together, sometimes under very difficult circumstances. The four remaining certificates to be achieved are:",
                        "Herding Started (HS)",
                        "Herding Intermediate (HI)",
                        "Herding Excellent (HX)",
                        "Herding Champion (HCh)"
                    ]
                }
            },
            {
                "name": "Lure Coursing",
                "description": "Lure Coursing is mainly for Sight Hounds (dogs that hunt by sight), and it's probably one of the best spectator sports in all of Dogdom. Over an open, but rigged, course, Sight Hounds (used by humans to hunt over open plains since the time of the Pharaohs) chase a flag at incredibly fast speeds. The breeds of dog involved include Afghan Hounds, Basenjis, Borzoi, Greyhounds, Ibiza Hounds, Rhodesian Ridgebacks, Salukis, Scottish Deerhounds, and Whippets. A lure, or prey (which in most cases is a fluttering plastic bag), is pulled quickly along a series of wires, as the dogs give chase. In Lure Coursing, dogs are judged on overall ability, quickness, endurance, follow, and agility. Three titles can be earned:",
                "steps": [
                    {
                        "step": "Junior Courser (JC)"
                    },
                    {
                        "step": "Senior Courser (SC)"
                    },
                    {
                        "step": "Field Champion (FC)"
                    }
                ]
            },
            {
                "name": "Earthdog Tests",
                "description": "Earthdog Tests are noncompetitive events designed to test the hunting skills of small breeds such as Terriers and Dachshunds. Dogs such as these, once called 'ratters,' were traditionally bred to help farmers kill rodents and other small mammals that damage crops, so it's no surprise that the entry-level test, called Introduction to Vermin, entails chasing mice. Here's how it works: Two large mice or rats are placed safely in a cage at the end of a long underground tunnel, and then the dog is let loose. The dog is judged on his desire to do everything necessary to get to those two rodents trapped in a cage underground. (Don't fret about the welfare of these furry little critters-the rodents are safe, as the dogs cannot actually get to them.) Three Earthdog titles can be earned:",
                "steps": [
                    {
                        "step": "Junior Earthdog (JE)"
                    },
                    {
                        "step": "Senior Earthdog (SE)"
                    },
                    {
                        "step": "Master Earthdog (ME)"
                    },
                    {
                        "step": "If you have one of these small dogs, this could be a great event for her."
                    }
                ]
            }
        ]
    }
]